{
  "guid": "https://old.reddit.com/r/sysadmin/comments/1ph0gmo/umm_im_gen_z_i_know_how_to_use_computers/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sysadmin/comments/1ph0gmo/umm_im_gen_z_i_know_how_to_use_computers/\" target=\"_blank\">\"Umm, I'm Gen Z. I know how to use computers.\"</a></h1>",
  "link": "https://old.reddit.com/r/sysadmin/comments/1ph0gmo/umm_im_gen_z_i_know_how_to_use_computers/",
  "pubDate": "2025-12-08T02:11:34.000Z",
  "description": "<div><p>I was onboarding a new employee in my office the other day and going through the usual setup process. After configuring their 2FA, I had them sign into their assigned laptop. While the profile loads, usually about 60 seconds on first login, I typically use that time to go over a few policies, domain links, where to submit a ticket, and explain our phishing campaign. I do all of this from my computer to save time.</p> <p>As soon as he signed in, I said, \"Let's give your profile a moment to load and I'll show you a few things in our environment.\"<br /> Before I could continue, he cut me off in a somewhat arrogant tone with, \"Umm, I'm Gen Z. I know how to use computers.\"</p> <p>I replied, \"Of course. I just need to show you a few things specific to our environment. Do you know what a phishing email is?\"</p> <p>He looked at me like a deer in headlights.<br /> \"A what?\"<br /> \"A phishing email.\"<br /> \"I don't know what that is.\"</p> <p>No problem. I gave him a quick rundown on what phishing looks like, how our simulator works, and how to report suspicious emails. He wasn't rude, but he definitely looked at me like I was some out-of-touch boomer trying to mansplain the internet while he sipped his Starbucks Frappuccino. (To be honest though, I do have a grey beard but I'm no where near a boomer's age. I'm Gen X)</p> <p>The funny part is, I could have just handed him the laptop with no explanation. But without that introduction, he almost certainly would have clicked one of the simulated emails in the first few days, which automatically enrolls users in mandatory extended training. Or even worse, a real threat. And guess who that reflects on? Us, for \"not informing the user.\" I have all users sign an inventory sheet that also states we went over a brief phishing explanation so they can't ever say we didn't inform them.</p> <p>I’m just venting a bit about how people can sometimes come across as assuming or defensive when IT is simply trying to do its job. Kind of like we're speaking down to them. And to be fair, that attitude isn't tied to any one generation, I’ve seen it across the board.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/DesertDogggg\"> /u/DesertDogggg </a> <br /> <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1ph0gmo/umm_im_gen_z_i_know_how_to_use_computers/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1ph0gmo/umm_im_gen_z_i_know_how_to_use_computers/\">[comments]</a></span>",
  "timestamp": 1765159894000,
  "source": "5eff3526b0a6",
  "category": ""
}