{
  "guid": "https://old.reddit.com/r/sysadmin/comments/1mw94o7/just_abruptly_ended_a_meeting_with_my_boss_midyell/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sysadmin/comments/1mw94o7/just_abruptly_ended_a_meeting_with_my_boss_midyell/\" target=\"_blank\">Just abruptly ended a meeting with my boss mid-yell</a></h1>",
  "link": "https://old.reddit.com/r/sysadmin/comments/1mw94o7/just_abruptly_ended_a_meeting_with_my_boss_midyell/",
  "pubDate": "2025-08-21T12:09:22.000Z",
  "description": "<div><p>Ive been interested in this field for decades, all the way back to a kid tinkering with settings trying to get EverQuest to run properly. My first IT job was at a call center helping old people reset their internet. My patience has been honed through flames, mostly because I really relied on that paycheck. I would have eaten tons of shit just to stay employed, because homelessness really sucked.</p> <p>So 15 years later, when I'm a consultant, post sys-admin and sys-eng, and my boss starts literally yelling at me in a meeting with my peers because of an email that I hadn't sent yet, it was quite shocking when my hand moved towards the end call button on its own.</p> <p>Im tired, friends. I have no more room in my heart for sitting quietly while some manager with zero technical background; whom I warned for months was making very poor decisions on this project, starts pointing fingers and placing blame. I don't need this. No one needs this.</p> <p>There's a big world out there. Don't let these cretins ruin your life, because chances are, they know jack shit and are merely pretenders.</p> <p>Edit- Thank you everyone for your kindness. I sent an email to HR, so I'll see what happens next I guess. I have my cats and my wife to pick me back up, so I think I'll be okay either way :)</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/SEND_ME_PEACE\"> /u/SEND_ME_PEACE </a> <br /> <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1mw94o7/just_abruptly_ended_a_meeting_with_my_boss_midyell/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1mw94o7/just_abruptly_ended_a_meeting_with_my_boss_midyell/\">[comments]</a></span>",
  "timestamp": 1755778162000,
  "source": "5eff3526b0a6",
  "category": ""
}