{
  "guid": "https://old.reddit.com/r/sysadmin/comments/1itiu8n/it_team_fired/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sysadmin/comments/1itiu8n/it_team_fired/\" target=\"_blank\">IT Team fired</a></h1>",
  "link": "https://old.reddit.com/r/sysadmin/comments/1itiu8n/it_team_fired/",
  "pubDate": "2025-02-19T22:38:06.000Z",
  "description": "<div><p>Showed up to work like any other day. Suddenly, I realize I can’t access any admin centers. While I’m trying to figure out what’s going on, I get a call from HR—I’m fired, along with the entire IT team (helpdesk, network engineers, architects, security).</p> <p>Some colleagues had been with the company for 8–10 years. No warnings, no discussions—just locked out and replaced. They decided to put a software developer manager as “Head of IT” to liaise with an MSP that’s taking over everything. Good luck to them, taking over the environment with zero support on the inside.</p> <p>No severance offered, which means we’ll have to lawyer up if we want even a chance at getting anything. They also still owe me a bonus from last year, which I’m sure they won’t pay. Just a rant. Companies suck sometimes.</p> <p>Edit: We’re in EU. And thank you all for your comments, makes me feel less alone. Already got a couple of interviews lined up so moving forward.</p> <p>Edit 2: Seems like the whole thing was a hostile takeover of the company by new management and they wanted to get rid of the IT team that was ‘loyal’ to previous management. We’ll fight to get paid for the next 2-3 months as it was specified in our contracts, and maybe severance as there was no real reason for them to fire us. The MSP is now in charge.Happy to be out. Once things cool off I’ll make an update with more info. For now I just thank you all for your kind comments, support and advice!</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Brr_123\"> /u/Brr_123 </a> <br /> <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1itiu8n/it_team_fired/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1itiu8n/it_team_fired/\">[comments]</a></span>",
  "timestamp": 1740004686000,
  "source": "5eff3526b0a6",
  "category": ""
}