{
  "guid": "https://old.reddit.com/r/sysadmin/comments/1p7hmjn/what_happened_to_the_it_profession/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sysadmin/comments/1p7hmjn/what_happened_to_the_it_profession/\" target=\"_blank\">What happened to the IT profession?</a></h1>",
  "link": "https://old.reddit.com/r/sysadmin/comments/1p7hmjn/what_happened_to_the_it_profession/",
  "pubDate": "2025-11-26T19:52:30.000Z",
  "description": "<div><p>I have only been in IT for 10 years, but in those 10 years it has changed dramatically. You used to have tech nerds, who had to act corporate at certain times, leading the way in your IT department. These people grew up liking computers and technology, bringing them into the field. This is probably in the 80s - 2000s. You used to have to learn hands on and get dirty \"Pay your dues\" in the help desk department. It was almost as if you had to like IT/technology as a hobby to get into this field. You had to be curious and not willing to take no for an answer.</p> <p>Now bosses are no longer tech nerds. Now no one wants to do help desk. No one wants to troubleshoot issues. Users want answers on anything and everything right at that moment by messaging you on Teams. If you don't write back within 15 minutes, you get a 2nd message asking if you saw it. Bosses who have never worked a day in IT think they know IT because their cousin is in IT.</p> <p>What happened to a senior sysadmin helping a junior sysadmin learn something? This is how I learned so much, from my former bosses who took me under their wing. Now every tech thinks they have all the answers without doing any of the work, just ask ChatGPT and even if it's totally wrong, who cares, we gave the user something.</p> <p>Don't get me wrong, I have been fortunate enough to have a career I like. IT has given me solid earnings throughout the years.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/saltyschnauzer27\"> /u/saltyschnauzer27 </a> <br /> <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1p7hmjn/what_happened_to_the_it_profession/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sysadmin/comments/1p7hmjn/what_happened_to_the_it_profession/\">[comments]</a></span>",
  "timestamp": 1764186750000,
  "source": "5eff3526b0a6",
  "category": ""
}