{
  "guid": "https://news.ycombinator.com/item?id=46691243",
  "title": "<h1><a href=\"https://news.ycombinator.com/item?id=46691243\" target=\"_blank\">Ask HN: Do you have any evidence that agentic coding works?</a></h1>",
  "link": "https://news.ycombinator.com/item?id=46691243",
  "pubDate": "Tue, 20 Jan 2026 12:45:57 +0000",
  "description": "\n<p>I've been trying to get agentic coding to work, but the dissonance between what I'm seeing online and what I'm able to achieve is doing my head in.</p><p>Is there real evidence, beyond hype, that agentic coding produces net-positive results? If any of you have actually got it to work, could you share (in detail) how you did it?</p><p>By \"getting it to work\" I mean:\n * creating more value than technical debt, and\n * producing code that’s structurally sound enough for someone responsible for the architecture to sign off on.</p><p>Lately I’ve seen a push toward minimal or nonexistent code review, with the claim that we should move from “validating architecture” to “validating behavior.” In practice, this seems to mean: don’t look at the code; if tests and CI pass, ship it. I can’t see how this holds up long-term. My expectation is that you end up with \"spaghetti\" code that works on the happy path but accumulates subtle, hard-to-debug failures over time.</p><p>When I tried using Codex on my existing codebases, with or without guardrails, half of my time went into fixing the subtle mistakes it made or the duplication it introduced.</p><p>Last weekend I tried building an iOS app for pet feeding reminders from scratch. I instructed Codex to research and propose an architectural blueprint for SwiftUI first. Then, I worked with it to write a spec describing what should be implemented and how.</p><p>The first implementation pass was surprisingly good, although it had a number of bugs. Things went downhill fast, however. I spent the rest of my weekend getting Codex to make things work, fix bugs without introducing new ones, and research best practices instead of making stuff up. Although I made it record new guidelines and guardrails as I found them, things didn't improve. In the end I just gave up.</p><p>I personally can't accept shipping unreviewed code. It feels wrong. The product has to work, but the code must also be high-quality.</p>\n\n<p>Comments URL: <a href=\"https://news.ycombinator.com/item?id=46691243\">https://news.ycombinator.com/item?id=46691243</a></p>\n<p>Points: 299</p>\n<p># Comments: 297</p>\n",
  "timestamp": 1768913157000,
  "source": "daa59745c6e0",
  "category": ""
}