{
  "guid": "https://old.reddit.com/r/consulting/comments/1qgase6/left_mbb_for_client_side_corp_strategy_great_pay/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consulting/comments/1qgase6/left_mbb_for_client_side_corp_strategy_great_pay/\" target=\"_blank\">Left MBB for client side corp strategy, great pay, chill lifestyle seemed like the dream at first but now I’m stuck with no viable career path</a></h1>",
  "link": "https://old.reddit.com/r/consulting/comments/1qgase6/left_mbb_for_client_side_corp_strategy_great_pay/",
  "pubDate": "2026-01-18T15:02:08.000Z",
  "description": "<div><p>As the title says I was at an MBB and left for a director level role in F250 financial services, corp strat team.</p> <p>For the first year or so I felt very lucky, pay was similar-ish to EM (~250k all in) but no travel and 40-45 hour weeks. Culture is cool, a lot of visibility with C-level folks.</p> <p>Then I realized the strategy team is a dead-end for careers at this company. It was a relatively new function and the head of strategy originally pitched it was a \"career launchpad\" into product roles and exec ranks. Well not long after I joined he was fired and we now report to a new head of strategy who doesn't seem to have the same philosophy.</p> <p>I'm presenting to C-level leaders on a regular basis and drafting board decks but at the end of the day I'm a glorified slide monkey. I'm the guy they go to when they want a pretty deck that's going to wow the board but not help them make strategic decisions. At least for the last 3-4 years no one has left strategy to advance their career in the company. a few lateral moves but nothing with clear path to growing responsibilities</p> <p>Seems my options are to wait around and hope one of the C level folks opens a role up for me (unlikely but not impossible, I'm well liked and respected) or find something else. The problem is my only experience is MBB and...strategy. I don't want to just lateral to another strategy team with the same work and same problem career-wise.</p> <p>Anyone else find themselves in this position? Any advice?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/skystarmen\"> /u/skystarmen </a> <br /> <span><a href=\"https://old.reddit.com/r/consulting/comments/1qgase6/left_mbb_for_client_side_corp_strategy_great_pay/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consulting/comments/1qgase6/left_mbb_for_client_side_corp_strategy_great_pay/\">[comments]</a></span>",
  "timestamp": 1768748528000,
  "source": "b0cadefce5a3",
  "category": ""
}