{
  "guid": "https://old.reddit.com/r/consulting/comments/1pzebmt/are_young_mbb_consultants_too_entitled/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consulting/comments/1pzebmt/are_young_mbb_consultants_too_entitled/\" target=\"_blank\">Are Young (MBB) consultants too entitled?</a></h1>",
  "link": "https://old.reddit.com/r/consulting/comments/1pzebmt/are_young_mbb_consultants_too_entitled/",
  "pubDate": "2025-12-30T10:02:28.000Z",
  "description": "<div><p>So this is a European perspective (I’m based in Germany), and working at MBB, shortly before my EM/PL promotion.</p> <p>To some extent I find it absolutely wild how much perks we enjoy at such a junior age, among them: always business class flights (even short haul, like 50min flights), 5 star hotels incl. well known brands (such as the Ritz, etc), company car (in my case just got a brand new BMW X3 suv), retreats (went to Austrian/Swiss ski resort last year, went to Oktoberfest, went to several European capitals for one day events), regular Michelin guide dinners expensing &gt;100 EUR per person on a casual Tuesday.</p> <p>Yet I feel like most people are extremely pretentious/ungrateful. For example: the car policy thing above gets constantly belittled/hated because there are tier 2 firms like Roland Berger which have higher budgets and have self pay on top (ie, even juniors could rent cars like a Porsche). </p> <p>Another example are promotion timelines. There are people who make engagement manager/PL roughly 3.5 years out of college but are constantly complaining how bad our promotion timelines are (I mean what to you expect? Get EM/PL after 3 years as standard?!). </p> <p>I’m writing this because I’m home over Christmas, completely detached from the MBB bubble. My childhood friends are in completely different sectors, earning a fraction of our comp and would dream of perks such as getting a company car. </p> <p>It’s wild to hear that some of my friends had a certain co-pay for drinks on their company’s annual Christmas parties whereas we expense 150-200 EUR p.p. Dinners year round and act like it’s the most normal thing in the world.</p> <p>Honestly I feel like MBB is filled with so many ungrateful little brats. I just come from a normal middle class background and realize how this job has changed me over the past years. I’ve gotten way more entitled around everything but I only realize that most other kids in my cohort were raised like this all their life.</p> <p>We need to come more down to earth again.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Extension_Turn5658\"> /u/Extension_Turn5658 </a> <br /> <span><a href=\"https://old.reddit.com/r/consulting/comments/1pzebmt/are_young_mbb_consultants_too_entitled/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consulting/comments/1pzebmt/are_young_mbb_consultants_too_entitled/\">[comments]</a></span>",
  "timestamp": 1767088948000,
  "source": "b0cadefce5a3",
  "category": ""
}