{
  "guid": "https://old.reddit.com/r/consulting/comments/1qbszl2/the_ai_consulting_gold_rush_turned_us_into_the/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consulting/comments/1qbszl2/the_ai_consulting_gold_rush_turned_us_into_the/\" target=\"_blank\">The AI consulting gold rush turned us into the thing we used to mock: expensive generalists selling other people's IP</a></h1>",
  "link": "https://old.reddit.com/r/consulting/comments/1qbszl2/the_ai_consulting_gold_rush_turned_us_into_the/",
  "pubDate": "2026-01-13T14:38:02.000Z",
  "description": "<div><p>I've been doing AI automation consulting for UK SMEs for the past 18 months, having come to this from an extensive career in AWS &amp; GCP development. Decent money. Growing pipeline. Clients seem happy.</p> <p>And I'm increasingly convinced we're all part of a collective delusion.</p> <p><strong>Here's what's bothering me:</strong></p> <p>Three years ago, if someone told you they were a \"blockchain consultant\" charging £800/day to implement smart contracts they barely understood, you'd have laughed them out of the room.</p> <p>Now? I watch people with six months of ChatGPT experience call themselves \"AI consultants,\" charge £5k for a Zapier workflow, and get funded by Innovate UK to do it. And the industry just accepts it.</p> <p><strong>The barrier to entry is a joke.</strong></p> <p>I know people billing £600-£1200/day who literally cannot code. Their entire technical stack:</p> <ul> <li>ChatGPT Plus subscription (£20/month)</li> <li>Zapier (maybe Make if they're fancy)</li> <li>A Notion database of prompts they copied from Twitter</li> <li>Confidence</li> </ul> <p>That's it. No ML background. No software architecture. No understanding of production systems. Just really good at sounding technical in discovery calls.</p> <p>And it works. Because clients don't know what questions to ask.</p> <p><strong>I'm complicit in this.</strong></p> <p>Here's the uncomfortable bit: I charge £2k-£8k per build depending on complexity. Most of what I deliver could be replicated by a competent business analyst with a weekend and access to YouTube.</p> <p>The value I provide:</p> <ul> <li>I've done it 50 times so I know where it breaks</li> <li>I can translate \"I need AI\" into \"you actually need better data hygiene and a webhook\"</li> <li>I know which tools to use when</li> <li>I write documentation so they're not screwed when I leave</li> </ul> <p>But is that worth £3k? £5k? I genuinely don't know anymore.</p> <p><strong>The client side is worse.</strong></p> <p>I've had potential clients tell me competitors quoted them:</p> <ul> <li>£12k for a \"proprietary AI solution\" (it was GPT-4 with a system prompt)</li> <li>£8k for a chatbot that I could see was obviously a white-labelled Voiceflow template</li> <li>£15k for \"AI-powered CRM integration\" that was Zapier connecting HubSpot to ChatGPT</li> </ul> <p>When I explained they could build these themselves for £100/month in tools, they didn't believe me. Because surely if it was that simple, the other consultants would have said so.</p> <p><strong>We've created a market for expensive mediation between clients and tools they could use directly.</strong></p> <p>This is the same thing we used to rip into:</p> <ul> <li>Change management consultants charging £200k to \"facilitate transformation\" with PowerPoints</li> <li>Digital transformation consultants selling Salesforce implementations with 40% margin</li> <li>Blockchain consultants in 2021 who'd learned Solidity three months prior</li> </ul> <p>We're just the 2025 version.</p> <p><strong>What actually separates good from bad right now:</strong></p> <p>I think about this a lot because I want to be on the right side of it.</p> <p><strong>Good AI consulting (I think):</strong></p> <ul> <li>Custom ML models when off-the-shelf doesn't work</li> <li>Integration work for complex multi-system environments</li> <li>Proper security and compliance architecture (GDPR, SOC2, etc.)</li> <li>Building actual software that happens to use AI</li> <li>Honest scoping: \"You don't need this\" when appropriate</li> </ul> <p><strong>What most of us are actually doing:</strong></p> <ul> <li>Connecting APIs that have documented integration guides</li> <li>Writing system prompts (which is just copywriting?)</li> <li>Implementing tools that have free trials and YouTube tutorials</li> <li>Charging for knowledge that's freely available if clients knew what to Google</li> </ul> <p><strong>The MBB parallel no one wants to talk about:</strong></p> <p>This feels like when MBB firms started their \"digital\" practices in 2015. Hire a bunch of people from tech, charge them out at strategy rates, deliver implementations that a dev shop could do for 60% less.</p> <p>Except we don't have the brand moat. And the tech is moving so fast that our \"expertise\" has a shelf life of about six months before the platforms abstract it away.</p> <p><strong>So what's the move?</strong></p> <p>I don't know. And that's what's keeping me up.</p> <p>Options I'm considering:</p>  <li><strong>Go full product</strong> - Stop consulting, build vertical AI products (I've got three in development). Actual recurring revenue, not time-for-money.<br /></li> <li><strong>Go deeper technically</strong> - Learn proper ML engineering, move upstream to clients who need custom models and real infrastructure.<br /></li> <li><strong>Get out</strong> - Take the money while it's good, recognise this is a 2-3 year window, pivot before AI agents automate us out of existence.<br /></li> <li><strong>Embrace it</strong> - Accept that all consulting is expensive mediation between clients and things they could theoretically do themselves. We're not special.<br /></li>  <p><strong>The question I can't answer:</strong></p> <p>Are we genuinely adding value, or are we just arbitraging a temporary information asymmetry?</p> <p>Because in 18 months when every SME has used ChatGPT, when Zapier's AI builder is good enough that you don't need to understand logic flows, when Make releases natural language automation...</p> <p>What are we selling then?</p> <p>Curious if anyone else is thinking about this or if I'm just having an existential crisis on a Tuesday.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Efficient_Degree9569\"> /u/Efficient_Degree9569 </a> <br /> <span><a href=\"https://old.reddit.com/r/consulting/comments/1qbszl2/the_ai_consulting_gold_rush_turned_us_into_the/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consulting/comments/1qbszl2/the_ai_consulting_gold_rush_turned_us_into_the/\">[comments]</a></span>",
  "timestamp": 1768315082000,
  "source": "b0cadefce5a3",
  "category": ""
}