{
  "guid": "https://old.reddit.com/r/AskEconomics/comments/1qhaslg/why_do_economists_seem_so_uninterested_in_power/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qhaslg/why_do_economists_seem_so_uninterested_in_power/\" target=\"_blank\">Why do economists seem so uninterested in power dynamics?</a></h1>",
  "link": "https://old.reddit.com/r/AskEconomics/comments/1qhaslg/why_do_economists_seem_so_uninterested_in_power/",
  "pubDate": "2026-01-19T17:35:51.000Z",
  "description": "<div><p>My background is in the humanities, with a lot of intersection with psychology, sociology, anthropology, etc. In these spaces the conversations about the subject position, the way desires are constructed, constrained, and overdetermined, historical contingency, and the broad impacts of social structures are *the* relevant questions.</p> <p>I’ve been lurking on this sub for a while and casually reading more about economics in general and it feels really jarring how little attention there seems to be to any of that, even when those questions seem like they should be relevanf. The idea of putting the success of one company over another for example down to “consumer preferences” *before* talking about accessibility or advertising or system default or social pressure or regulatory capture etc seems bizarre. Even the idea that purchasing power functions as a proxy for preference seems weird and unrealistic because it elides that *people with a lot of purchasing power* are a distinct group with specific preferences that are related to the fact they have a lot of purchasing power.</p> <p>What am I missing? I understand this probably reads like a caricature of the field and that lots of economists don’t really deal with theory and they’re more trying to model what’s actually going on in the economy rather than answer questions like “what do people really want” but it overall still feels like a very weirdly limited and unrealistic model for human behavior and it’s surprising how out of touch it is with most other social sciences where something like Weberian conflict theory is not even particularly controversial. What do economists think about this?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/TheExquisiteCorpse\"> /u/TheExquisiteCorpse </a> <br /> <span><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qhaslg/why_do_economists_seem_so_uninterested_in_power/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qhaslg/why_do_economists_seem_so_uninterested_in_power/\">[comments]</a></span>",
  "timestamp": 1768844151000,
  "source": "13f5ae248e1a",
  "category": ""
}