{
  "guid": "https://old.reddit.com/r/AskEconomics/comments/1qg9rq1/studies_on_diseconomies_of_scale_the_olive/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qg9rq1/studies_on_diseconomies_of_scale_the_olive/\" target=\"_blank\">Studies on diseconomies of scale, the olive problem, and enshittification?</a></h1>",
  "link": "https://old.reddit.com/r/AskEconomics/comments/1qg9rq1/studies_on_diseconomies_of_scale_the_olive/",
  "pubDate": "2026-01-18T14:20:08.000Z",
  "description": "<div><p>I'm trying to figure out if more has been written about this, so bare with me. In 1987 American Airlines discovered that removing one olive from each first class meal would save $40,000 a year. This is often lauded in businesses as how one small change can save companies huge amounts.</p> <p>This admiration of the olive problem has spread throughout tons of businesses. Clothing companies remove a stitch, retail stores cut an hour, consumer electronics leave out a capacitor. Everyone tries to find the small change that will save money without altering the spirit of the product.</p> <p>This is where I'm curious - what's been written or studied about and entire culture whose goal is the olive problem? I think enshittification touches on this, but it feels like that's posed as more of a conscious decisions, where the olive problem are non-malicious actors whose goal, en masse, just so happens to result in a worse product.</p> <p>That's what I have been thinking of. I have been searching for papers on this but I'm not using the right words. Does this ring any bells for economic study?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/theresamouseinmyhous\"> /u/theresamouseinmyhous </a> <br /> <span><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qg9rq1/studies_on_diseconomies_of_scale_the_olive/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AskEconomics/comments/1qg9rq1/studies_on_diseconomies_of_scale_the_olive/\">[comments]</a></span>",
  "timestamp": 1768746008000,
  "source": "13f5ae248e1a",
  "category": ""
}