{
  "guid": "https://old.reddit.com/r/learnvietnamese/comments/1q1252k/try_my_beta_mobile_app_for_intermediate_learners/",
  "title": "<h1><a href=\"https://old.reddit.com/r/learnvietnamese/comments/1q1252k/try_my_beta_mobile_app_for_intermediate_learners/\" target=\"_blank\">Try my beta mobile app for intermediate learners of Vietnamese, get it for free when it launches!</a></h1>",
  "link": "https://old.reddit.com/r/learnvietnamese/comments/1q1252k/try_my_beta_mobile_app_for_intermediate_learners/",
  "pubDate": "2026-01-01T11:27:02.000Z",
  "description": "<div><p>Hi guys,</p> <p>I’m building a mobile app that helps you learn Vietnamese through internet content, such as YouTube and News Articles. It’s like a mobile web browser, but the advantage is that you can do one click word lookup and flashcards that you can use to review the word later. If you’re familiar with LingQ or Migaku, it is similar in concept to those (paid) apps.</p> <p>You can read more about my app here</p> <p><a href=\"https://www.mugengo.app/?language=vi\">https://www.mugengo.app?language=vi</a></p> <p>It’s currently in development, and I would love to build features with the community. To reflect the fact that it’s still fairly rough, if you try it out now, I’ll put you on a list to get lifetime premium once it launches. It’s like a KickStarter, but you don’t have to pay, or wait! </p> <p>All you have to do is join my discord where I’m coordinating feature requests / bug reports</p> <p><a href=\"https://discord.gg/KrR6Wu33Md\">https://discord.gg/KrR6Wu33Md</a></p> <p>and DM me the email you used to sign up so I know who you are. I’m Kevin, the only mod on the server. Currently my users are mainly Chinese learners, but I would love to have some Vietnamese learners too! I'm the only Vietnamese learner at the moment (My app supports Chinese, Japanese, Korean, and Vietnamese)</p> <p>iOS users can follow the instructions here to download the beta app</p> <p><a href=\"https://testflight.apple.com/join/ahrfPtSh\">https://testflight.apple.com/join/ahrfPtSh</a> </p> <p>Android users can DM me their email, and I will put you on the list to send out when it’s ready (probably next weekish). There's an alpha build used by one user at the moment.</p> <p>About me: I’m a typical second generation Vietnamese in a western country - resented my Sundays being taken up by Vietnamese classes, didn’t take it seriously. During middle school, I started learning Japanese, and got really interested in learning languages. I double majored in Japanese and Computer Science at university, and self learnt Chinese and Korean. I spent a lot of time learning these languages, and learnt a lot about language learning and what works, but learning Vietnamese has always taken a back seat. Well I’m hoping 2026 is the year that my Vietnamese is revived! And maybe some of you can join me!</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/SorbetNo1676\"> /u/SorbetNo1676 </a> <br /> <span><a href=\"https://i.redd.it/snm0krr53qag1.png\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/learnvietnamese/comments/1q1252k/try_my_beta_mobile_app_for_intermediate_learners/\">[comments]</a></span>",
  "timestamp": 1767266822000,
  "source": "2ed51bab791d",
  "category": ""
}