{
  "guid": "https://old.reddit.com/r/learnvietnamese/comments/1qgwbg6/report_on_2500_hours_of_active_vietnamese_practice/",
  "title": "<h1><a href=\"https://old.reddit.com/r/learnvietnamese/comments/1qgwbg6/report_on_2500_hours_of_active_vietnamese_practice/\" target=\"_blank\">Report on 2500 hours of active Vietnamese practice</a></h1>",
  "link": "https://old.reddit.com/r/learnvietnamese/comments/1qgwbg6/report_on_2500_hours_of_active_vietnamese_practice/",
  "pubDate": "2026-01-19T06:09:50.000Z",
  "description": "<div><p><strong>tl;dr:</strong> in which I gain social existence</p> <p>All tracked time is active, 100% focused on the task at hand.</p> <p>Passive listening time I estimate at 950 additional inattentive hours.</p> <p><strong>Starting from:</strong> English monolingual beta</p> <p><strong>Current strategy:</strong> Consume fiction, audiobooks, chat online</p> <p><strong>Long-term goal:</strong> D1 fluency and a paid original fiction publication by 2040</p> <p><strong>Past updates:</strong></p> <ul> <li><a href=\"https://www.reddit.com/r/languagelearning/comments/16qrqux/report_on_530_hours_of_active_vietnamese_practice/\">530 hours</a></li> <li><a href=\"https://www.reddit.com/r/languagelearning/comments/1bxs5ag/report_on_1000_hours_of_active_vietnamese_practice/\">1000 hours</a></li> <li><a href=\"https://www.reddit.com/r/languagelearning/comments/1gqvkue/report_on_1500_hours_of_active_vietnamese_practice/\">1500 hours</a></li> <li><a href=\"https://www.reddit.com/r/VietNam/comments/1lqxwop/report_on_2000_hours_of_active_vietnamese_practice/\">2000 hours</a></li> </ul> <p><strong>Current level:</strong></p> <p>I talk about this in Vietnamese in an unscripted speaking vlog <a href=\"https://youtu.be/mzlK7aGWoIo\">here</a>.</p> <p>Stuff that used to be hard and effortful study, like reading manga, reading novels, listening to audiobooks, watching Vietnamese youtube, are now relaxation activities. Dictionary is definitely still required but at a lower frequency. Instead of seeking out content that is comprehensible to me, I seek out content on topics I’m interested in and learn about it in Vietnamese. So on that front there’s definitely progress.</p> <p>When I listen to nonfiction audiobooks and hear a word I don’t know, I look it up now. Looking words up from sound used to be impossible, and the amount of words I used to need to look up prohibited looking up as I listened. (With fiction or narrative nonfiction it’s still impractical most of the time.)</p> <p>Hanging out with native speakers is the new frontier. I never know when I’m going to have a great conversation or fail to communicate at even a basic level.</p> <p><strong>Rejected Strategies:</strong></p> <ul> <li>Apps (too boring)</li> <li>Grammar explanations (too boring)</li> <li>Drills, exercises, or other artificial output (too boring)</li> <li>Content made for language learners (too boring)</li> <li>Classes (too lazy for them, and not sold on the value prop)</li> </ul> <p><strong>Methods:</strong></p> <p>Since the last update, I have un-forsaken Anki. Anki and I are back together. It’s hard to replicate the efficiency of intensive listening practice that Anki provides.</p> <p>My routine is as follows.</p> <p>Before work:</p>  <li>(15m) Review Anki audio-only front cards. Try to transcribe in my head, check the result. I explain this in detail in <a href=\"https://youtu.be/cyWdzh-6m_M?si=D3O0GWxzKO5gkVJ1\">this video</a>.</li> <li>(1h) Pace around my house (in the winter) or take a walk (in the warm seasons) listening to an audiobook.</li>  <p>At lunch:</p>  <li>(30m) Read a novel with dictionary.</li>  <p>Before bed:</p>  <li>(30m) Read manga sans dictionary.</li>  <p>This is the minimum, and then I may do more if I’m into a show or book at that time.</p> <p>For speaking, lately I socialize in Vietnamese voice rooms on discord. I’ve made a few friends who are interested in stuff I happen to know about, like software engineering. So we’ll chat about those things and even if I have to repeat myself or ask about a word, they don’t mind because I’m helping them debug their homework.</p> <p><strong>Time Breakdown:</strong></p> <p><a href=\"https://preview.redd.it/apaap8dwy8eg1.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=2875dab8e10f9a4441ef3975ab7f698d7590761b\">https://preview.redd.it/apaap8dwy8eg1.jpg?width=1170&amp;format=pjpg&amp;auto=webp&amp;s=2875dab8e10f9a4441ef3975ab7f698d7590761b</a></p> <p>I use atracker on iOS since it's got a quick interface on apple watch.</p> <ul> <li>56% listening (1393h27m)</li> <li>29% reading (722h09m)</li> <li>9% conversation (234h55m)</li> <li>6% anki audio sentence recognition cards (140h26m)</li> <li>0% writing (7h36m)</li> <li>0% speaking to camera (3h20m)</li> <li>0% chorusing practice (0h30m)</li> </ul> <p><strong>Reflections:</strong></p> <p>I have two accents in Vietnamese: one where I roleplay and one where I don’t.</p> <p>In the one where I don’t roleplay, there’s a heavy English accent, but many people are able to understand me anyway.</p> <p>The one where I do roleplay, there’s less english influence. Often the reason I activate this one is that I said something and people didn’t understand in the first accent. So I’m like, “Okay, let me start talking like a dub actor,” and that usually works.</p> <p><strong>Recommendations:</strong></p> <p>I'm not yet fluent so I have no qualifications to give advice. My next update, which I'll write at 3000 hours, may contain different opinions.</p> <ul> <li>Read <strong>Peak</strong> <ul> <li>This book gave me an understanding of how learning works, and I’ve used those principles to create my routines.</li> </ul></li> <li>Read <strong>The Way of The Linguist</strong> <ul> <li>Daddy Steve knows how to maintain perspective: keep stuff light, fun, adventurous.</li> </ul></li> <li>Explore minimalism <ul> <li>Learning a language takes a lot of time. That’s factual. In my opinion it also requires that you live a relaxed life. You can’t learn while stressed! I changed jobs and simplified my life in order to commit to language learning.</li> </ul></li> <li>Get deep in the sound system. <ul> <li>I’m allergic to pretty much every form of study, but I admit the extreme importance of understanding this sound system. This sound system is a dragon.</li> <li>Read this paper <a href=\"https://www.taylorfrancis.com/books/mono/10.4324/9780203500088/vietnamese-tone-laurence-horn-andrea-hoa-pham\">https://www.taylorfrancis.com/books/mono/10.4324/9780203500088/vietnamese-tone-laurence-horn-andrea-hoa-pham</a>. This explains the 8 tones in Vietnamese and how they are distinguished by vocal register and phonation.</li> <li>Spend just one session putting some of the native speech recordings you struggle to understand into <a href=\"https://www.fon.hum.uva.nl/praat/\">praat</a> to figure out what’s going on, what are you mishearing. It’s a powerful tool. It can render pitch contours, vowel formants, etc.</li> </ul></li> </ul> <p><strong>Resources:</strong></p> <p>These are some resources I've created or collected that helped me learn.</p> <ul> <li><a href=\"https://inarticulate.xyz/posts/minimal-pair-training/\">Minimal pair decks</a></li> <li><a href=\"https://inarticulate.xyz/posts/vietnamese-immersion-content/\">Southern immersion content index</a></li> </ul> <p>Best of luck to other Vietnamese learners, and see y'all again after 500 more hours!</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/roxven\"> /u/roxven </a> <br /> <span><a href=\"https://old.reddit.com/r/learnvietnamese/comments/1qgwbg6/report_on_2500_hours_of_active_vietnamese_practice/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/learnvietnamese/comments/1qgwbg6/report_on_2500_hours_of_active_vietnamese_practice/\">[comments]</a></span>",
  "timestamp": 1768802990000,
  "source": "2ed51bab791d",
  "category": ""
}