{
  "guid": "https://old.reddit.com/r/Psychic/comments/1qh80xv/tired_of_date_settlers_and_false_predictions/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Psychic/comments/1qh80xv/tired_of_date_settlers_and_false_predictions/\" target=\"_blank\">Tired of date settlers and false predictions</a></h1>",
  "link": "https://old.reddit.com/r/Psychic/comments/1qh80xv/tired_of_date_settlers_and_false_predictions/",
  "pubDate": "2026-01-19T15:59:16.000Z",
  "description": "<div><p>Im tired of people going into Reddit, 4chan, Twitter, Youtube and other places who put dates on \"something happening\" soon only to be proved wrong. I feel like these false prophets needs to get accountable for, no matter if the prediction is an educated guess, came to them in a dream or a NDE, etc.</p> <p>These people either give other people who are tired and depressed false hope about an ascension of consciousness, an alien intervention, the rapture, the coming of the messiah, etc., or give them predictions of fear like pole shift, third world war, earthquakes, tsunamis, a carrington event, etc.</p> <p>And when nothing happens they change the dates or remove their posts or change what they said. I called out someone who predicted Trump would die past Sunday only to get blocked without even accounting for their claims.</p> <p>These kind of people give a bad name to true psychics and experiencers, and I find hard to believe there isnt a place to shun these people from ever interacting on those kind of places, otherwise they would keep getting away making false claims and dates over and over.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Medmael\"> /u/Medmael </a> <br /> <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qh80xv/tired_of_date_settlers_and_false_predictions/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qh80xv/tired_of_date_settlers_and_false_predictions/\">[comments]</a></span>",
  "timestamp": 1768838356000,
  "source": "57955621f333",
  "category": ""
}