{
  "guid": "https://old.reddit.com/r/Psychic/comments/1qe03jp/have_you_had_premonitionsvisions_or_recieved_a/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Psychic/comments/1qe03jp/have_you_had_premonitionsvisions_or_recieved_a/\" target=\"_blank\">Have you had premonitions/visions or recieved a message about a war recently?</a></h1>",
  "link": "https://old.reddit.com/r/Psychic/comments/1qe03jp/have_you_had_premonitionsvisions_or_recieved_a/",
  "pubDate": "2026-01-15T23:52:52.000Z",
  "description": "<div><p>Hi, I'm new here. I searched to see if this has been discussed before and I couldn't find it. I don't want this to become a political debate. I'm just curious what do you think/feel is happening? </p> <p>I'm not a psychic, I think I might be intuitive though. For years I have had the feeling that we will witness a 3rd world war. And in the past, whenever something big happens in the world I get afraid. That said, this year has started crazier, even crazier than last year. And, even though I tend to be a very anxious person, something inside me has been making me feel like everything will be alright (which is something very uncommon in me, I tend to be pessimistic).</p> <p>I'm Venezuelan, but because of the dictatorship in my country I moved out many years ago. I still feel for my people. I'm glad the political prisoners are being liberated. But, I'm also so sad learning about the tortures they were victims of and also about the ones that didn't survive those mistreatment. I wish for justice and freedom.</p> <p>This year we also have everything happening in Iran, which it has some similarities to my country. So much suffering in this world. And part of me sees US's support to these two countries as a possible opportunity to help them (with many other negative scenarios being possible, too). </p> <p>But, then I see Trump threatening Greenland and I don't get it? They are not living in a dictatorship. That is a 1st world country, an ally. And then Canada, Germany and Irland sent their troops to help Greenland in case US attacks? What the heck is going on? It definitely sounds like a real world war could start any day now. Some people say it's just a bluff, but many said the same things about the threats to Venezuela. Of course those are 2 completely different scenarios. But, still, I never thought I would see it happening until it did.</p> <p>So, all this to ask if anyone here has had a premonition, vision, a message, something? about the possibility of a world war sooner rather than later? Do you know what is going to happen to Venezuela? What about Iran?</p> <p>Do you think I'm correct feeling things are going to end well?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Jenny_FromAnthrBlck\"> /u/Jenny_FromAnthrBlck </a> <br /> <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qe03jp/have_you_had_premonitionsvisions_or_recieved_a/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qe03jp/have_you_had_premonitionsvisions_or_recieved_a/\">[comments]</a></span>",
  "timestamp": 1768521172000,
  "source": "57955621f333",
  "category": ""
}