{
  "guid": "https://old.reddit.com/r/Psychic/comments/1qhztku/32m_jobless_after_8_years_working_fulltime_as_a/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Psychic/comments/1qhztku/32m_jobless_after_8_years_working_fulltime_as_a/\" target=\"_blank\">32M – Jobless after 8 years working full-time as a remote psychic, feeling lost and unsure what’s next</a></h1>",
  "link": "https://old.reddit.com/r/Psychic/comments/1qhztku/32m_jobless_after_8_years_working_fulltime_as_a/",
  "pubDate": "2026-01-20T12:29:21.000Z",
  "description": "<div><p>Hi everyone, I’m a 32-year-old male and today I officially found myself jobless.</p> <p>For the past 8 years, I’ve worked full-time as a remote psychic, which has been my only source of income and my main profession.</p> <p>Things started falling apart around October 2024, when my cooperation with ZodiacPsychics ended after the company was sold. Since then, I tried moving forward and joined Nebula, but honestly, I don’t recommend it—the user traffic was extremely low and it wasn’t sustainable.</p> <p>Most recently, I lost my cooperation with Astroyogi, and that was the final blow for me.</p> <p>I’ve applied to or tried getting into most of the major platforms you see on Google (Purple Garden, Kasamba, PsychicOz, Keen, and others in the top 5–7), but they’re either not hiring right now or I haven’t been accepted.</p> <p>This work is what I know, what I’ve done professionally for nearly a decade, and what I rely on to live. Seeing things get rough like this is honestly very disappointing and discouraging. I’m feeling lost and unsure what my next move should be.</p> <p>I’m posting here to ask:</p> <p>Has anyone here gone through something similar—especially losing a niche or unconventional career?</p> <p>Any advice on pivoting, finding alternative income, or platforms I might have missed? Or even just some perspective from people who’ve had to start over in their 30s.</p> <p>Thanks for reading. Any advice or shared experience would really mean a lot right now.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/MaximusDcimusMerdius\"> /u/MaximusDcimusMerdius </a> <br /> <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qhztku/32m_jobless_after_8_years_working_fulltime_as_a/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Psychic/comments/1qhztku/32m_jobless_after_8_years_working_fulltime_as_a/\">[comments]</a></span>",
  "timestamp": 1768912161000,
  "source": "57955621f333",
  "category": ""
}