{
  "guid": "https://old.reddit.com/r/psychadelics/comments/1qfwb6e/sex_and_tripping/",
  "title": "<h1><a href=\"https://old.reddit.com/r/psychadelics/comments/1qfwb6e/sex_and_tripping/\" target=\"_blank\">Sex and Tripping</a></h1>",
  "link": "https://old.reddit.com/r/psychadelics/comments/1qfwb6e/sex_and_tripping/",
  "pubDate": "2026-01-18T02:27:13.000Z",
  "description": "<div><p>I’ve been a casual user of mushrooms since I was like 16. These days I prefer a micro dose as I don’t want to get too crazy. I have kids and such so I can’t be gone into the void for too long. Dmt would be ideal since it’s so short but shrooms as all available at the time. Anyways, last night my wife and I decided to go on a little journey with some older shrooms we had been sitting on. We had a little more than normal because we figured they had lost some potency after being in a drawer for a year. As it turns out, they have not! In the past we have been a little cuddly on shrooms but these were just like an aphrodisiac. It was sooooo intense for both of us. I literally felt EVERY nerve ending in my erogenous zones. It was a very awesome connection for both of us. At one point I had my head thrown back and was just pumping away and the words in my head kept repeating “I am transcending.”. I was giggling softly to myself reveling in the ecstasy. But yeah, I’m just putting this here because besides her I have no one to tell. I have tripped in some capacity at least 100 times in my life. (I am early 40s for reference) I have just never really felt super horny as this time. I have had sex a few times in the past on them too but it just didn’t compare to this. It was a true blessing. Just wondering If anyone else has had this experience. We have a 4 day weekend so I think I might want to try it again! Hopefully it’s the same results. Anyways, thanks for listening! I hope you find the same experience as it was amazing. Peace!</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/TheRobotSnake\"> /u/TheRobotSnake </a> <br /> <span><a href=\"https://old.reddit.com/r/psychadelics/comments/1qfwb6e/sex_and_tripping/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/psychadelics/comments/1qfwb6e/sex_and_tripping/\">[comments]</a></span>",
  "timestamp": 1768703233000,
  "source": "596b48172916",
  "category": ""
}