{
  "guid": "https://old.reddit.com/r/Entrepreneur/comments/1qa2ow9/why_do_people_think_tax_write_offs_are_this/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qa2ow9/why_do_people_think_tax_write_offs_are_this/\" target=\"_blank\">Why do people think tax write off’s are this magical thing</a></h1>",
  "link": "https://old.reddit.com/r/Entrepreneur/comments/1qa2ow9/why_do_people_think_tax_write_offs_are_this/",
  "pubDate": "2026-01-11T15:50:32.000Z",
  "description": "<div><p>As an entrepreneur when I hear other people, W2 workers and other entrepreneurs, constantly say the rich did it for a tax write off. I automatically think this person is just dumb. Who in the world wants to spend a dollar to save 35 cents. It makes sense if you were going to do it because it’s a necessary thing for your business to grow but it’s just an expense, of course it’s not going to count towards your taxable basis. Can someone explain if I’m just missing something.</p> <p>I’m in real estate depreciation is much different because it’s a passive loss and gets added back to income which makes you more bankable. So I can see why cost segs under 100% bonus depreciation is hyped but not “write off’s” in other businesses</p> <p>Edit: People are not realizing I am talking about the people who say “you can just write it off” about everything. I’m talking about the items that aren’t necessarily needed, or a new one is not needed but someone is wanting to decrease their tax bill. The math doesn’t make any sense. Any expense necessary for a business to improve of course should be deducted as an expense</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Cancerman691\"> /u/Cancerman691 </a> <br /> <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qa2ow9/why_do_people_think_tax_write_offs_are_this/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qa2ow9/why_do_people_think_tax_write_offs_are_this/\">[comments]</a></span>",
  "timestamp": 1768146632000,
  "source": "cf942cedaa7f",
  "category": ""
}