{
  "guid": "https://old.reddit.com/r/Entrepreneur/comments/1qd128c/someone_asked_if_i_could_upcycle_their_dead/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qd128c/someone_asked_if_i_could_upcycle_their_dead/\" target=\"_blank\">Someone asked if I could \"upcycle their dead houseplants into art\" and I thought they were joking but now it's a big chunk of my revenue</a></h1>",
  "link": "https://old.reddit.com/r/Entrepreneur/comments/1qd128c/someone_asked_if_i_could_upcycle_their_dead/",
  "pubDate": "2026-01-14T22:08:27.000Z",
  "description": "<div><p>I run a small online plant shop, mostly succulents and stuff for apartments. Been doing it for about 2 years, decent side income that turned into my main thing last year. Anyway, back in September this lady emails me asking if I could take her dead plants and turn them into some kind of preserved art piece for her wall. Like pressed flowers but for her crispy monstera that she killed. I honestly thought she was messing with me.</p> <p>But she was dead serious (no pun intended) and offered to pay me $80 for it. I was like whatever, why not, had some saved money from Stаke set aside for random experiments anyway. Took me maybe 3 hours total including the framing. Posted a pic of the final thing on instagram just cause it looked pretty cool, got way more engagement than my usual posts.</p> <p>Next thing I know I'm getting like 15 DMs a week from people wanting the same thing. Turns out theres this whole guilt thing with plants where people feel bad throwing them away and want to \"honor\" them or whatever. Some interior designers started reaching out too because apparently dead plant art is having a moment??</p> <p>Now Im doing 20 to 30 of these a month at $95 each and honestly the margins are insane compared to selling live plants. No shipping stress, no dealing with weather delays killing inventory, and people are way less picky than with living plants. The community around it is also super engaged which helps with word of mouth.</p> <p>I still sell regular plants but this accidental thing is now my main income source and I barely advertised it. Just goes to show sometimes the dumbest sounding ideas are worth testing out.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/FewAbility4477\"> /u/FewAbility4477 </a> <br /> <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qd128c/someone_asked_if_i_could_upcycle_their_dead/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1qd128c/someone_asked_if_i_could_upcycle_their_dead/\">[comments]</a></span>",
  "timestamp": 1768428507000,
  "source": "cf942cedaa7f",
  "category": ""
}