{
  "guid": "https://old.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/\" target=\"_blank\">Bought a $1,200 product from Alibaba, listed it on FB Marketplace for $2,500 out of curiosity. Now I’m wondering if I stumbled onto something real.</a></h1>",
  "link": "https://old.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/",
  "pubDate": "2025-12-26T19:27:30.000Z",
  "description": "<div><p>So here’s the story.</p> <p>I was looking at some car accessories and kept seeing the same products priced at what felt like a crazy markup. Out of curiosity, I started digging into Alibaba to see what the actual manufacturing cost looked like. After a decent amount of research into suppliers, reviews, and verifying the manufacturer, I pulled the trigger on one unit.</p> <p>When it arrived, I was honestly expecting stereotypical cheap Chinese knockoff quality. But it wasn’t. The build quality was on par with the name-brand US versions I’d been comparing it to.</p> <p>Just for fun, I threw it up on Facebook Marketplace to see if there was any interest. The response surprised me. My all-in cost including shipping was around $1,200. Comparable products were selling locally for $2,500+. I had multiple inquiries within days.</p> <p>So now I’m testing it for real. Bought a few more units, planning to flip them. If it works, I’ll open an LLC and do everything above board. Here’s where my background helps: I work in logistics, so I’ve been able to optimize shipping and cut some costs that I think most people wouldn’t know how to avoid. I’m wondering if that gives me a legitimate edge, or if this whole space is so saturated that margins get crushed the moment you try to scale.</p> <p>My questions for this community:</p> ∙ Is the “Alibaba to local resale” model played out, or are there still niches where this works? ∙ Did I just get lucky with this particular product category, or is there a repeatable process here? ∙ For those who’ve done this: what’s the capital requirement to actually make it a real business vs. a side hustle?  <p>Would love to hear from anyone who’s tried this, whether it worked or didn’t. Not looking for validation; just trying to figure out if this is worth pursuing seriously or if I should just enjoy the quick wins and move on.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Different-Bridge5507\"> /u/Different-Bridge5507 </a> <br /> <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1pwcnz3/bought_a_1200_product_from_alibaba_listed_it_on/\">[comments]</a></span>",
  "timestamp": 1766777250000,
  "source": "cf942cedaa7f",
  "category": ""
}