{
  "guid": "https://old.reddit.com/r/Entrepreneur/comments/1q9n9uo/after_travelling_for_5_years_and_not_working/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1q9n9uo/after_travelling_for_5_years_and_not_working/\" target=\"_blank\">After travelling for 5 years and not working - Honestly don't know what to do. f#@%!!!</a></h1>",
  "link": "https://old.reddit.com/r/Entrepreneur/comments/1q9n9uo/after_travelling_for_5_years_and_not_working/",
  "pubDate": "2026-01-11T02:26:15.000Z",
  "description": "<div><p>Hey guys,</p> <p>I'm in such a weird situation. I'm 38M. I grew up in Toronto Canada. I had founded a few small businesses before and exited all of them. It was after COVID, I had money in the bank. I went out to live my dream - I travelled/surfed full-time. Did not give a fuck about anything.</p> <p>It was the dream life. Now, 5 years later, I get hit with a huuuuge tax bill ($100k+) from a previous transaction (real estate). It's gonna wipe out a lot of my net worth, so I can't survive on SP500/BTC anymore as I did before. </p> <p>I now live in Mauritius (world-class surf/kitesurf spot) but I can't legally work here. Also, it's a shit market to work in. The population is 1.3M and people are poor. It's paradise leisurely but a nightmare economically. BYOM (Bring your own money). </p> <p>I'm only legally allowed to work in Canada or online. </p> <p>I need to pull income again and refill my net worth. </p> <p>No idea where to start....</p> <p>Do I become a plumber? I basically need to restart my career...</p> <p>I can start my own business again but honestly don't know what field. I haven't been in Canada for 5 years and now I'm visiting. I feel lost. I have no network....I'm a surfer dude who just came back into the Matrix after a 5-year hiatus. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/LegitimateDream4942\"> /u/LegitimateDream4942 </a> <br /> <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1q9n9uo/after_travelling_for_5_years_and_not_working/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Entrepreneur/comments/1q9n9uo/after_travelling_for_5_years_and_not_working/\">[comments]</a></span>",
  "timestamp": 1768098375000,
  "source": "cf942cedaa7f",
  "category": ""
}