{
  "guid": "https://old.reddit.com/r/intermittentfasting/comments/1qhe1u2/approx_100_lbs_down_with_intermittent_fasting_and/",
  "title": "<h1><a href=\"https://old.reddit.com/r/intermittentfasting/comments/1qhe1u2/approx_100_lbs_down_with_intermittent_fasting_and/\" target=\"_blank\">Approx 100 lbs down with intermittent fasting and swimming</a></h1>",
  "link": "https://old.reddit.com/r/intermittentfasting/comments/1qhe1u2/approx_100_lbs_down_with_intermittent_fasting_and/",
  "pubDate": "2026-01-19T19:29:05.000Z",
  "description": "<div><p>Recently found my old dress and was shocked to see the difference in how I used to look. Even my bracelets fit better, they used to not be able to go higher up my arm than my wrist. </p> <p>I weighed in at around 350lbs just over 2 years ago, and I’m 1000% sure I gained more since that weigh in, cause ya girl was slamming bags of popcorn and pastries like it was my full time job. I stopped weighing myself for a good year, and around 6 months into that year I started eating intermittently, anywhere from 16, to 46 hours fasted, with the latter recently in the past month being when I’ve started doing alternate day longer fasts. Never restricting any food groups or calorie counting. </p> <p>Now, I have had periods of not fasting and regaining, but I weigh in now at 265 lbs. I’m predicting around 100lbs of weight loss but confirmed 85. </p> <p>Around 6 months ago I started swimming 1-4 times a week for an hour at a time and have been feeling more fit and healthy in my daily movements. </p> <p>I am a 5’4 29y/o woman and this was the over the course of 2 years, it happened so gradually that I genuinely did not notice a difference in my appearance besides my neck until i compared the photos. Even my family, husband, and closest friends did a double take because it’s been such a gradual and healthy change that the difference isn’t so obvious day by day, but this old photo really shows it. </p> <p>I still have a long way to go, but the time passes anyways and I enjoy the way I’ve been living so I’ll just keep going happily. I’ve never felt like I’m on a diet or even intentionally losing weight, I just genuinely enjoy how I feel fasting and how I feel during and after swimming. It’s true what people say about it needing to be a lifestyle change to stick. </p> <p>Also: I can touch my feet together when standing now. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/memequeen\"> /u/memequeen </a> <br /> <span><a href=\"https://i.redd.it/ca6bifj0yceg1.jpeg\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/intermittentfasting/comments/1qhe1u2/approx_100_lbs_down_with_intermittent_fasting_and/\">[comments]</a></span>",
  "timestamp": 1768850945000,
  "source": "9c1ea338348a",
  "category": ""
}