{
  "guid": "https://old.reddit.com/r/digitalnomad/comments/1py1xd1/it_finally_happened_i_got_drugged_in_colombia_i/",
  "title": "<h1><a href=\"https://old.reddit.com/r/digitalnomad/comments/1py1xd1/it_finally_happened_i_got_drugged_in_colombia_i/\" target=\"_blank\">It finally happened; I got drugged in Colombia. I wasn’t robbed, but it was close.</a></h1>",
  "link": "https://old.reddit.com/r/digitalnomad/comments/1py1xd1/it_finally_happened_i_got_drugged_in_colombia_i/",
  "pubDate": "2025-12-28T20:43:19.000Z",
  "description": "<div><p>What’s scary is that it was done by someone I’d known for 2–3 years. He played the long game. Getting drugged is a risk I’ve always known exists, and I want to share it as a warning. I just never thought this person would.</p> <p>Me and my “friend” arrived in Medellin from Bogota, dropped our stuff at a place he lined up for us to “stay, and we started at a hookah bar in El Poblado. We ended up in a local neighborhood in Antioquia. I’d only had a couple drinks by then and at some point, my “friend” and someone he clearly knew offered me what I thought was a blunt. I only drank water at Antioquia and didn’t have much of the blunt, and I think that saved me.</p> <p>Over time, instead of coming down, I got more dizzy and confused. I smoke regularly and knew this wasn’t normal. I’m aware of scopolamine, and once the confusion increased despite no alcohol, I knew what was happening.</p> <p>I called them out, and they started to talk very openly in Spanish about how they expected to rob me. They knew I speak decent Spanish and they still didn’t care. I was already hip to the plan even before they told me though. I let them get me into an Uber back to where we were staying (I ordered it so I knew where it was going), but on the ride home I deleted banking apps, contacted my emergency contact, and called both 123 and the U.S. Embassy emergency line. I made sure my “friend” knew authorities were involved.</p> <p>When we arrived, I refused to go inside, demanded my stuff, and stayed on the phone with the police. I told this guy to get my things and this would all go away. He got my stuff like I demanded, I grabbed my backpack with the meds I desperately needed, ordered another Uber, and went straight to a hotel.</p> <p>Knowing Spanish was huge here, and knowing what to do and staying calm in the moment is the only thing that saved me. The police did nothing and neither them or the clinic staff spoke any English, and the general vibe was basically: if you got drugged, it’s your fault.</p> <p>Stay alert. Even people you think you know can surprise you. Have an action plan too so you can execute it even if you’re only half conscious.</p> <p>Edit: For anybody still tracking this post or who sees it later, apparently, you can put scopolamine in certain sections of a blunt and pass the blunt to the victim when it is most concentrated. So. To anybody saying, “they were smoking it too”, that’s your answer.</p> <p>Source: I’ve heard this from several people from who live here and are familiar with the practice. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Nblearchangel\"> /u/Nblearchangel </a> <br /> <span><a href=\"https://old.reddit.com/r/digitalnomad/comments/1py1xd1/it_finally_happened_i_got_drugged_in_colombia_i/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/digitalnomad/comments/1py1xd1/it_finally_happened_i_got_drugged_in_colombia_i/\">[comments]</a></span>",
  "timestamp": 1766954599000,
  "source": "0a01755f5faf",
  "category": ""
}