{
  "guid": "https://old.reddit.com/r/sales/comments/1q1veht/how_marketings_kpis_are_making_your_job_harder/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sales/comments/1q1veht/how_marketings_kpis_are_making_your_job_harder/\" target=\"_blank\">How Marketing's KPIs Are Making Your Job Harder - Explanation And Solution Inside</a></h1>",
  "link": "https://old.reddit.com/r/sales/comments/1q1veht/how_marketings_kpis_are_making_your_job_harder/",
  "pubDate": "2026-01-02T10:36:24.000Z",
  "description": "<div><p>Do you ever notice many of the \"marketing qualified leads\" turn out to be garbage - the leads don't remember filling out your form, don't know who you are, or don't seem to exist.</p> <p>The reason this happens is due to marketing's KPIs.</p> <p>Let's walk through a common scenario.</p> <p>The marketing team have been told their KPIs are:</p> <ul> <li><p>The number of visitors</p></li> <li><p>The number of leads</p></li> <li><p>Low cost per lead</p></li> </ul> <p>These KPIs are impossible to achieve. Why? Real traffic is expensive. Real leads can be <em>really</em> expensive. So what can they do?</p> <p>They choose to buy cheap traffic. This will be things like Google Search Partners, Google Display, the Meta Audience Network, and the TikTok Audience network. A great side effect of this cheap traffic is it submits loads of leads. </p> <p>Sounds great, right? They're getting lots of traffic, lots of leads, and the cost per lead is low. The KPIs are being smashed.</p> <p>But there's a problem. The traffic is fake. It's bot traffic doing click fraud. The scam works like this:</p> <ul> <li><p>Publishers (the websites showing your ads on Google Search Partners, Google Display, the Meta Audience Network, and the TikTok Audience network) earn money every time someone or <em>something</em> clicks on the ads on their websites.</p></li> <li><p>So they use bots to click on the ads. As long as these bots are made properly (change IP address for every click, fake the device fingerprint, and created using a \"stealth framework\"), the ad networks will consider the traffic valid.</p></li> <li><p>To ensure the bot traffic looks even more real, the bots are programmed to submit real-looking fake leads. These fake leads trick the ad networks into thinking the bots are high quality human traffic.</p></li> </ul> <p>The above, known as click fraud, is a massive problem, and steals over $100B from advertisers every year. To give some numbers, have a look at the click fraud rates by audience network below:</p> <ul> <li><p>Meta (Audience): 67%</p></li> <li><p>Google (Display): 27%</p></li> <li><p>Linked In (Audience): 24%</p></li> <li><p>Microsoft (Audience): 24%</p></li> <li><p>TikTok (Audience): 79%</p></li> </ul> <p>The above numbers are from objective detection (100% provably bots) and should be considered the minimum rates.</p> <p>So, marketers are advertising on these crappy networks, getting lots of cheap traffic, and that traffic submits loads of fake leads. The end result? You waste your time chasing leads which don't exist. Marketing blames you for not following up fast enough, or not being good enough at your jobs.</p> <p><strong>The solution</strong></p> <p>As you've probably guessed, the problem is marketing's KPIs. They're going to do what they have to do to hit those KPIs. I've spoken to at least 1,000 marketing teams and marketing agencies, and almost all of them are the same - instead of doing things properly they're focussed on their KPIs. And can you blame them? That's what their bosses told them to do, and getting lots of cheap leads is near impossible.</p> <p><em>Option 1</em></p> <p>Have a meeting with your manager and your manager's manager (it needs to come from the top) to change marketing's KPIs to be sales qualified leads and revenue. No more vanity metrics which can be easily faked using bots. That will force them to do things properly and stop buying fake traffic.</p> <p><em>Option 2</em></p> <p>Marketing will resist Option 1. The CMO will threaten this will ruin the company. And the CEO may follow their lead, as he'll be afraid of messing things up. In this case, you get the marketing team to use bot protection. That will stop the fake leads and re-train the ad networks to send real, high quality, targeted leads. They'll resist this too of course, but they'll take it instead of Option 1.</p> <p>Good luck!</p> <p>PS I'm doing a doctorate in this topic.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/polygraph-net\"> /u/polygraph-net </a> <br /> <span><a href=\"https://old.reddit.com/r/sales/comments/1q1veht/how_marketings_kpis_are_making_your_job_harder/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sales/comments/1q1veht/how_marketings_kpis_are_making_your_job_harder/\">[comments]</a></span>",
  "timestamp": 1767350184000,
  "source": "3920c0ca1b66",
  "category": ""
}