{
  "guid": "https://old.reddit.com/r/sales/comments/1q6d02x/this_job_is_so_lonely_and_i_dont_think_anyone/",
  "title": "<h1><a href=\"https://old.reddit.com/r/sales/comments/1q6d02x/this_job_is_so_lonely_and_i_dont_think_anyone/\" target=\"_blank\">This job is so lonely and I don't think anyone talks about it enough</a></h1>",
  "link": "https://old.reddit.com/r/sales/comments/1q6d02x/this_job_is_so_lonely_and_i_dont_think_anyone/",
  "pubDate": "2026-01-07T11:31:04.000Z",
  "description": "<div><p>Sorry to be back here again, I don't really have anywhere else to say this stuff.</p> <p>So, I work from home and 8-9 hours of my day, I try to get people to respond to me. We know the absymal response rates of cold outreaches - most of them don't. I have considered that maybe I died in the pandemic and this is purgatory.</p> <p>My team has a Slack (it's so DREADFUL) but it's mostly just my colleagues posting wins and managers asking about pipeline. Today my manager sent \"EOD pipeline updates please 🙏\" at 4:30 pm like he does every single day. Nobody ever asks how anyone's actually doing. I could send \"I am losing my mind\" and he'd probably react with a 👍 and move on.</p> <p>Yesterday, I sent 73 emails and made 28 calls. I had 4 conversations, three were \"not interested\" and a guy named Dick who was, in fact, a dick about it. I talked to my dog Bean more than I talked to humans. </p> <p>AND my friends don't get it. Last Saturday, I went to a classic birthday dinner and someone asked what I do. I said sales and they made that Wolf of Wall Street joke. Well, fuck it - I didn't have the heart to explain that I spent Friday afternoon sending 32 LinkedIn connection requests and refreshing my inbox hoping someone would acknowledge that I exist. </p> <p>When I do book a meeting I have nobody to celebrate with. Last week, I finally got a reply from a Director of Ops I'd been chasing since October. I literally fist pumped at my desk alone in my apartment - posted it in Slack, got a 🎉 from someone named Anita I've never met in person, and that was it. My wife said \"that's great babe\" and went back to watching Love Island. </p> <p>The worst part is the silence. You send 50 emails and hear nothing. I have started to take the guilt personally which I know is insane but also I am becoming insane so it tracks.</p> <p>Are we all just fucking pretending to be okay...like fr guys</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/kubrador\"> /u/kubrador </a> <br /> <span><a href=\"https://old.reddit.com/r/sales/comments/1q6d02x/this_job_is_so_lonely_and_i_dont_think_anyone/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/sales/comments/1q6d02x/this_job_is_so_lonely_and_i_dont_think_anyone/\">[comments]</a></span>",
  "timestamp": 1767785464000,
  "source": "3920c0ca1b66",
  "category": ""
}