{
  "guid": "https://old.reddit.com/r/UFOs/comments/1qdl3jg/us_state_department_denied_visas_for_8_varghina/",
  "title": "<h1><a href=\"https://old.reddit.com/r/UFOs/comments/1qdl3jg/us_state_department_denied_visas_for_8_varghina/\" target=\"_blank\">US State Department denied visas for 8 Varghina UFO crash witnesses to come testify in Washington DC according to James Fox</a></h1>",
  "link": "https://old.reddit.com/r/UFOs/comments/1qdl3jg/us_state_department_denied_visas_for_8_varghina/",
  "pubDate": "2026-01-15T14:33:26.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/UFOs/comments/1qdl3jg/us_state_department_denied_visas_for_8_varghina/\"> <img src=\"https://external-preview.redd.it/cm5sdHVybzV4aWRnMcKiPiCKioiFfZhRpOrv8Lm0iIXDqrF31ZwLhnK-abA8.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=6ea11cc90565bb34d95d118d824dcf67cde52a0f\" alt=\"US State Department denied visas for 8 Varghina UFO crash witnesses to come testify in Washington DC according to James Fox\" title=\"US State Department denied visas for 8 Varghina UFO crash witnesses to come testify in Washington DC according to James Fox\" /> </a>  <div><p>US State Department denied visas for 8 Varghina UFO crash witnesses to come testify in Washington DC according to James Fox</p> <p><a href=\"https://x.com/RedPandaKoala/status/2011569744240079104\">https://x.com/RedPandaKoala/status/2011569744240079104</a></p> <p>James Fox excuses one of his key witnesses in his Varghina UFO documentary lying </p> <p>“Most other people who are witness to an event lie about it until they're ready to not lie about it.\"</p> <p><a href=\"https://x.com/RedPandaKoala/status/2011565884373156078\">https://x.com/RedPandaKoala/status/2011565884373156078</a></p> <p><strong>James Fox Hunts REAL Alien Footage From a UFO Crash!</strong> </p> <p>James Fox is a dog with a bone, as obsessed as Captain Ahab’s in his pursuit of Moby Dick, as dogged as Indiana Jones’s quest for the Holy Grail. Fox, one of the best-known documentary filmmakers to ever focus on the UFO mystery, has spent 14 long years investigating an astounding series of events often referred to as ‘the Brazilian Roswell.’ </p> <p>Fox's 2022 film “Moment of Contact” revealed powerful testimony from an impressive array of independent witnesses in and around Varginha, Brazil, some of whom saw the craft, the crash, the large deployment of military personnel, and the capture of at least one of the injured crew members who fled from the disabled UFO. The being was described as a bizarre, oily-skinned, nonhuman entity, one that seemed intelligent, injured, and frightened. In the years since the release of that film, Fox has returned to Brazil multiple times to seek out the rumored medical team which met, treated, and communicated with the alien life form. Now, he is unveiling the rest of the story. </p> <p>In this episode of Weaponized, James Fox shares with Jeremy and George the story of how he tracked down the key witnesses who have previously been too frightened to say anything, why they were intimidated and by whom, and details about a wide-ranging cover-up that is still active nearly 30 years after the original events. A new, updated version of his film has now been released, and a major media event is being staged just days from now. </p> <p>On January 20, at the National Press Club in Washington, D.C., Fox will introduce several of the firsthand witnesses. Getting them into the US proved to be difficult and Fox says his pursuit of a videotaped recording of the creature also drew the attention of unknown saboteurs. Fox also revealed to Weaponized a secondary objective of the January news conference. He wants the US military and intelligence community to tell Congress what became of the creature, and any other evidence related to non-human beings that may have been recovered from documented UFO crashes in the US and elsewhere. (The public is invited to attend the event and media personnel will be permitted to livestream the entire event.)</p> <p><a href=\"https://www.youtube.com/@JeremyCorbell\"></a></p> <p><a href=\"https://www.youtube.com/watch?v=n6TWJeptiv8\"><strong>https://www.youtube.com/watch?v=n6TWJeptiv8</strong></a></p> </div>   submitted by   <a href=\"https://old.reddit.com/user/87LucasOliveira\"> /u/87LucasOliveira </a> <br /> <span><a href=\"https://v.redd.it/yo17fco5xidg1\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/UFOs/comments/1qdl3jg/us_state_department_denied_visas_for_8_varghina/\">[comments]</a></span> ",
  "timestamp": 1768487606000,
  "source": "c2a764883c7a",
  "category": ""
}