{
  "guid": "https://old.reddit.com/r/tasker/comments/1lulpiq/dev_tasker_662beta_shizuku_integration/",
  "title": "<h1><a href=\"https://old.reddit.com/r/tasker/comments/1lulpiq/dev_tasker_662beta_shizuku_integration/\" target=\"_blank\">[DEV] Tasker 6.6.2-beta - Shizuku Integration!</a></h1>",
  "link": "https://old.reddit.com/r/tasker/comments/1lulpiq/dev_tasker_662beta_shizuku_integration/",
  "pubDate": "2025-07-08T11:05:33.000Z",
  "description": "<div><p><strong>Note</strong>: Google Play might take a while to update. If you don’t want to wait for the Google Play update, get it right away <a href=\"https://www.dropbox.com/scl/fi/gyxfw8kimxyb0b1d1yaqu/Tasker.35.apk?rlkey=yacgs4ykb5c3rxb1wgn46a6oa&amp;dl=0\"><strong>here</strong></a>. (Direct-Purchase Version <a href=\"https://www.dropbox.com/scl/fi/0fe0ec9rrdor0t3q8xk1f/Tasker.28.Direct.apk?rlkey=gn75fce80mwcmfhjtmwweeyp5&amp;dl=0\">here</a>)</p> <p>If you want you can also check any previous releases here: </p> <h1>Shizuku Integration is Here!</h1> <p>Demo: <a href=\"https://youtu.be/9StQBtUuOl0\">https://youtu.be/9StQBtUuOl0</a></p> <p>This has been a long time coming! 😃 A <strong>LOT</strong> of people have asked me to add this to Tasker, and it's finally here!</p> <p>If you don't know, <a href=\"https://github.com/RikkaApps/Shizuku\">Shizuku</a> is an app that connects itself to ADB Wifi <strong>without the need for a computer</strong> (Android 11+; on Android 10 and below you still need a computer) and then allows other apps (like Tasker) to run special Android APIs that they usually can't because of the lack of permissions.</p> <p>Shizuku is available on <a href=\"https://play.google.com/store/apps/details?id=moe.shizuku.privileged.api\">Google Play</a>, but I recommend installing the <a href=\"https://github.com/RikkaApps/Shizuku/releases\">latest Github version</a> because it fixes a few issues on the more recent Android versions.</p> <h1>Running Restricted Android APIs</h1> <p>For example, on Android 16, Google changed how Wifi Tethering works under the hood, and normal apps can no longer toggle it. But since Shizuku gets access to elevated permissions, Tasker can now connect to it (with your permission) and toggle <strong>Wifi Tether</strong> once again!</p> <h1>Running Restricted Shell Commands</h1> <p>Tasker can also run <strong>Shell Commands</strong> with Shizuku, with a new option in the <strong>Run Shell</strong> action. Simply enable the new option, and commands that were previously only available to root or adb wifi users, can now be ran normally, and transparently!</p> <p>For example, you can now easily enable/disable your lock screen, toggle permissions for apps, disable apps or even uninstall them altogether!</p> <h1>Run Shell Helper</h1> <p>You now have access to the <strong>Run Shell Helper</strong> with Shizuku, which allows you to very easily select from one of these pre-defined commands, or you can even try to find <strong>hidden commands</strong> under the <strong>Services</strong> option there! The <strong>Services</strong> option looks at your phone and gets a list of ALL service commands that your phone provides, and allows you to select from ANY of them. Who knows what hidden gems people will find there! 😅</p> <p>To use the <strong>Run Shell Helper:</strong></p> <ul> <li>go into a Task</li> <li>add a <strong>Run Shell</strong> action</li> <li>Use the <strong>Magnifying Glass</strong> above the <strong>Command</strong> field</li> <li>Select the <strong>Services</strong> option</li> </ul> <p>If you do find something useful there, let everyone know so everyone can benefit! 😎</p> <h1>Built-In Actions Using Shizuku</h1> <p>Some restricted actions can be ran with Shizuku transparently, meaning that you just need to have Shizuku running in the background, and they'll work! These are the actions I intergrated Shizuku in for now:</p> <ul> <li>Airplane Mode</li> <li>Wifi Tether</li> <li>Wifi</li> <li>Bluetooth</li> <li>Kill App</li> </ul> <p>So, for <strong>Wifi</strong> and <strong>Bluetooth</strong> for example, you don't even need to install the <strong>Tasker Settings</strong> app anymore! I need to take a look at the other actions and see what else I can use Shizuku with!</p> <h1>Check Shizuku</h1> <p>I also added the <strong>Check Shizuku</strong> function to the <strong>Tasker Function</strong> action in Tasker, so that you can easily check if Shizuku is running or not, and if Tasker has the Shizuku permission enabled.</p> <p>You get access to 4 variables:</p> <ul> <li><strong>%can_shizuku_be_used</strong> (if this is true, you can be sure that you can use Shizuku)</li> <li><strong>%has_shizuku_permission</strong> (if Tasker has the Shizuku permission enabled inside the Shizuku app)</li> <li><strong>%is_shizuku_running</strong> (if Shizuku is even running)</li> <li><strong>%is_shizuku_installed</strong> (if Shizuku is even installed at all)</li> </ul> <p>Hopefully these will fulfil all your needs 😅</p> <h1>Small Get Sunrise/Sunset Times Enhancements</h1> <p>In this action you can now specify the <strong>date</strong> for which you want to know the sunrise/sunset times, so you don't always have to get them for the current day.</p> <p>You can also specify a custom <strong>sun elevation angle</strong> and know at what times the sun will be at that angle in the sky!</p> <h1>Full Changelog</h1> <ul> <li>Added option to <strong>Run Shell</strong> action to run the command with Shizuku</li> <li>Allow using the Shell helper to run many commands with Shizuku</li> <li>Made <strong>Airplane Mode</strong>, <strong>Wifi</strong>, <strong>Bluetooth</strong> and <strong>Kill App</strong> actions use Shizuku if available</li> <li>Added <strong>Check Shizuku</strong> function to <strong>Tasker Function</strong> action</li> <li>Added <strong>Custom Sun Elevation Angle</strong> input to <strong>Get Sunrise/Sunset</strong> action and the corresponding output variables</li> <li>Added optional <strong>Seconds Since Epoch</strong> input to <strong>Get Sunrise/Sunset</strong> action to allow getting the times for different dates</li> <li>Added a bunch of new outputs to the <strong>Get Sunrise/Sunset</strong> action</li> <li>Changed output times of <strong>Get Sunrise/Sunset</strong> to seconds since epoch (it was previously millis since epoch)</li> <li>Disable USB Midi handler if user doesn't use <strong>MIDI Play</strong> action in their setup</li> <li>Fixed some issues with the <strong>Get Sunrise/Sunset</strong> action's output</li> <li>Fixed translations when picking the type of <strong>Widget v2</strong> to use</li> <li>Fixed some crashes related to having Lock enabled in Tasker</li> <li>Fixed issue when importing some specific kinds of projects where it wouldn't correctly detect the type being imported</li> <li>Fixed <strong>Wifi Tether</strong> action for Android 16+ by using Shizuku</li> <li>Updated min SDK to 24 (Android 7.0)</li> <li>Made the app's APK smaller</li> </ul> </div>   submitted by   <a href=\"https://old.reddit.com/user/joaomgcd\"> /u/joaomgcd </a> <br /> <span><a href=\"https://old.reddit.com/r/tasker/comments/1lulpiq/dev_tasker_662beta_shizuku_integration/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/tasker/comments/1lulpiq/dev_tasker_662beta_shizuku_integration/\">[comments]</a></span>",
  "timestamp": 1751972733000,
  "source": "774d6f54d4ec",
  "category": ""
}