{
  "guid": "https://old.reddit.com/r/leanfire/comments/1q4pnl0/done_at_54_followup/",
  "title": "<h1><a href=\"https://old.reddit.com/r/leanfire/comments/1q4pnl0/done_at_54_followup/\" target=\"_blank\">\"done\" at 54: follow-up</a></h1>",
  "link": "https://old.reddit.com/r/leanfire/comments/1q4pnl0/done_at_54_followup/",
  "pubDate": "2026-01-05T16:05:07.000Z",
  "description": "<div><p>I leanFIRE'd about a year and a half ago, and I was asked by one of the commenters to do a follow up on this post, so I'm making good on that. I'm especially doing this because I see a lot of posts with folks expressing high caution but holding or targeting multi-millions. It's not one size fits all, so those high NW figures may indeed be best for most, but I want to offer a perspective that is more aggressive than that, FWIW.</p> <p>Here's the original:</p> <p><a href=\"https://www.reddit.com/r/leanfire/comments/1h6hgh5/done_at_54/\">https://www.reddit.com/r/leanfire/comments/1h6hgh5/done_at_54/</a></p> <p>The post above tells most of the story shortly after my retirement. Where I stand now:</p> <p>Market has obviously performed well, so I'm feeling great. My Joe-Kuhn-style bucket strategy has kept me/us very comfortable; it's all going (mostly) according to plan (more below). Although he doesn't disclose high specifics, it does seem pretty clear he has substantially more padding than I do. He does run a retirement YT channel, after all.</p> <p>Still, I feel comfortable and confident. My wife does still do her part-time work, which is a huge help (but no benefits). My side hustles and hobbies continue, but no real breakouts financially. It's not materializing yet, and I thought it might, a little... It's true that you do get out of it what you put into it, and I've distracted myself with other things like home projects, gaming, etc., so it's not like it doesn't make sense.</p> <p>The value of being \"comfortable and confident\" while not working cannot be overstated -- it's the Monday after New Year's, and I'm not working today, tomorrow, or the day or week or month or year after that. I'm not working on my resume or trying to network or present myself to see if I can catch an opportunity. I'm spending my time as I want. It doesn't get old.</p> <p>As time goes on, I appreciate how burned out I was while working. To a crisp, I think. But because I was soldiering on, I think I told myself I was ok and while I'd admit I'd rather not be working and would love to be retired, I think in retrospect, I was fully cooked.</p> <p>So after all these months, I'm feeling so much better. Looking at the ceiling from bed doesn't get old. Looking up at the sky when going on walks at whatever time of day doesn't get old. Pausing to choose what to do next doesn't get old. The freedom is so fulfilling.</p> <p>I only share these feelings to encourage those who are struggling. It did take me years to set up a leanfire retirement. Even with the ACA subsidies increasing, our outlook is fine and healthy.</p> <p>We've had a couple of surprises which hit us financially, but because of our setup, it's been no sweat and these things (like unforeseen but necessary home upgrades) turn into a net-positive. Bucket 1 is basically a large emergency fund which can be replenished from other buckets while staying in a tax-favorable income model.</p> <p>The upshot here is that our NW is higher than it was than when I retired (both in terms of balances and home value). That's a huge success in my mind, because my 54yo self was working with different numbers and if I had foreseen some of these setback projects / issues, it may very well have dampened my spirit to submit resignation.</p> <p>What's challenging:</p> <p>- I'm 56 now, so the plan from now to 59.5 has to continue to be planned carefully. So far, so good, but I look forward to getting beyond this phase.</p> <p>- Prioritizing actions and being disciplined doesn't go away. Work had plenty of prioritization pressures; being self-driven means you're accountable solely to yourself (and spouse)... Since I'm fairly easy-going, I let myself off the hook a lot, meaning I'm behind on certain goals like health/fitness, side hustle progress, etc. Behind on goals, but not getting worse, if that makes sense. Just not going as fast as I could. In corporate America, that traditionally is not very acceptable. And when you DO meet and exceed corporate goals, as we all know, they just want more. Yes, I'm a bit bitter about those experiences, which is why I want to be CEO of my own stuff, vs. catering to other C-level wants, needs and desires (which I'd sometimes find misguided / unreasonable / not very interesting to me). So, while I welcome the freedom from all that, I still need to be accountable and push myself, which I do find challenging at times. Even as I write this, it helps me reflect on things I can do to be better in this regard.</p> <p>So in summary, $1m saved can still be \"enough,\" although many factors are at play. For example: strong SS forecast, paid off house, self-sufficient or already-deceased parents, kids on their own, still-working part-time spouse. If you can't check those boxes, they can be offset by other things (the rare pension, a more lucrative side hustle/hobbies, etc). It's all highly individualized, which is why it takes a LOT of planning and modeling.</p> <p>The main purpose of my follow-up note is to offer hope, encouragement and optimism for those working on this giant puzzle of freedom from work, and who may be discouraged by all the \"I have $3m across various accounts and a pension... am I ready?\" type posts, which seem to be a lot... Good for them, really. That's awesome. And best of luck to you in 2026!</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/breathedown\"> /u/breathedown </a> <br /> <span><a href=\"https://old.reddit.com/r/leanfire/comments/1q4pnl0/done_at_54_followup/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/leanfire/comments/1q4pnl0/done_at_54_followup/\">[comments]</a></span>",
  "timestamp": 1767629107000,
  "source": "a7f3d42440e2",
  "category": ""
}