{
  "guid": "https://old.reddit.com/r/leanfire/comments/1puxyov/my_job_finally_drove_me_out_im_thankful_for_the/",
  "title": "<h1><a href=\"https://old.reddit.com/r/leanfire/comments/1puxyov/my_job_finally_drove_me_out_im_thankful_for_the/\" target=\"_blank\">My job finally drove me out. I'm thankful for the leanfire life style. Merry Christmas.</a></h1>",
  "link": "https://old.reddit.com/r/leanfire/comments/1puxyov/my_job_finally_drove_me_out_im_thankful_for_the/",
  "pubDate": "2025-12-24T21:36:08.000Z",
  "description": "<div><p>I put in my notice the other day. I couldn't take it any more. My job went from being the best job I ever had to a complete nightmare. I had an amazing manager, good co-workers, and great benefits. </p> <p>One day my manager basically rage quits after the new CIO insulted him one way or another. After that, total chaos. I ended up reporting to 7 different managers this year. What the actual fuck.</p> <p>I was living in the chaos fine until we got our last manager. It was ok at first and then his true colors came out. Changing everything. Implementing some new 'system'. The final deal breaker was weekend overnight call shifts. Some days I'd have to wake up 3 times in the middle of the night to check some bullshit. I was working 7 days a week.</p> <p>My wife finally said why are you doing this to yourself. Quit. And I did.</p> <p>This probably makes me identifiable, but I don't care. If you see this GO FUCK YOURSELF.</p> <p>Assets </p> <p>House (100% paid off) Equity ~ $400,000.00 </p> <p>Cash (HYSA) $97,698.00 </p> <p>IRA 1 $8,127.74 </p> <p>IRA 2 $8,127.74 </p> <p>fidelity $274,514.47 </p> <p>401k 1 $154,826.00 </p> <p>401k 2 $404,861.00 </p> <p>Roth IRA 1 $65,144.50 </p> <p>ROTH IRA 2 $38,836.90 </p> <p>HSA $24,407.77 </p> <p>Expenses about 40-50k a year. Wasn't clear earlier, but this is for both of us, not just me. </p> <p>Anyways I have over a million dollars. I'm just going to chill for awhile.</p> <p>I'm thankful for all the advice I got from this subreddit over the years. It's proven to be invaluable.</p> <p>TLDR: Job changed quickly and went to shit. Checked my accounts and then put in my notice. I'm going to enjoy freedom for awhile and switch careers. I only need like 40k a year.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Dumpster_FI_RE\"> /u/Dumpster_FI_RE </a> <br /> <span><a href=\"https://old.reddit.com/r/leanfire/comments/1puxyov/my_job_finally_drove_me_out_im_thankful_for_the/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/leanfire/comments/1puxyov/my_job_finally_drove_me_out_im_thankful_for_the/\">[comments]</a></span>",
  "timestamp": 1766612168000,
  "source": "a7f3d42440e2",
  "category": ""
}