{
  "guid": "https://old.reddit.com/r/AdamCurtis/comments/1qbakgd/century_of_self_is_more_relevant_today_than_ever/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AdamCurtis/comments/1qbakgd/century_of_self_is_more_relevant_today_than_ever/\" target=\"_blank\">Century of Self is more relevant today than ever before.</a></h1>",
  "link": "https://old.reddit.com/r/AdamCurtis/comments/1qbakgd/century_of_self_is_more_relevant_today_than_ever/",
  "pubDate": "2026-01-12T23:12:00.000Z",
  "description": "<div><p>The fact that century of self predates social media is nothing short of terrifying. The documentary is talking about a world where companies are trying to group consumers based on their own perceived individualism. Giving them exactly what they want. Ignoring any sacrifice and giving them unearned pleasure no matter what. We are in a world where most people’s spare time is used to give instagram (owned by meta) data entry points, clicking like on content that appeals to them, engaging in comments, allowing them to track time spent watching a certain video. They are supplying these social media companies of their social networks, who gets sent what , who chats to who. Think to social media posts you see, every single one engages a highly emotional topic. From humour to horniness, horror to anger. It is creating a world where we are willing focus groups to our own lives and are acting purely off of emotional impulse. I find it crazy people don’t talk about that aspect of social media. The side of data entry for massive companies. I find this a lot scarier than falling attention rates.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/ConfidentReveal2669\"> /u/ConfidentReveal2669 </a> <br /> <span><a href=\"https://old.reddit.com/r/AdamCurtis/comments/1qbakgd/century_of_self_is_more_relevant_today_than_ever/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AdamCurtis/comments/1qbakgd/century_of_self_is_more_relevant_today_than_ever/\">[comments]</a></span>",
  "timestamp": 1768259520000,
  "source": "8d711987e5ea",
  "category": ""
}