{
  "guid": "https://old.reddit.com/r/problemgambling/comments/1pxt0at/what_happens_to_you_when_youre_addicted_to/",
  "title": "<h1><a href=\"https://old.reddit.com/r/problemgambling/comments/1pxt0at/what_happens_to_you_when_youre_addicted_to/\" target=\"_blank\">What Happens To You When You're Addicted to Gambling?</a></h1>",
  "link": "https://old.reddit.com/r/problemgambling/comments/1pxt0at/what_happens_to_you_when_youre_addicted_to/",
  "pubDate": "2025-12-28T14:46:27.000Z",
  "description": "<div><p>You may have seen my responses to various gamblers from time to time with this statement \"35 years addicted, 3 years in recovery. If you want to talk about your gambling, hit me up in chat. Regards, John\"</p> <p>I'm 55 years old, and I was fortunate to have recovered from this devastating illness. Many do not. I've talked to a great number of people, offering guidance. Some people want to be legitimately helped and some people just want to find out more information. Both is fine. But one thing that will happen if a compulsive gambler continues to gamble. Sooner or later, it will eventually destroy their life.</p> <p>I'm not saying that to make anyone feel bad, but it's the 100% truth. Gambling addiction causes people to commit crime, threaten suicide, become homeless, use drugs and alcohol, become highly indebted, lose their partners, spouses, children and families and enter deep psychological depression. If you know you have a gambling addiction, the time to act is now.</p> <p>Gambling addiction is a progressive disease, which means it can only get worse over time. <strong>Compulsive gamblers are addicted to the action of gambling. The addiction is NEVER about the money.</strong> <strong>This is an important distinction.</strong> Once a compulsive gambler gets addicted, their brain has essentially been hijacked. If you are a compulsive gambler, you've probably noticed at some point the nonstop signals you receive from your brain telling you to gamble gamble gamble. A compulsive gambler slowly transforms into a zombie and the addiction gets stronger the more they gamble. It's a real disease with devastating consequences.</p> <p>Gambling takes many forms. You can go to physical casinos. You can trade stocks and crypto. There are online sportsbooks. Bookies are at your feet, 24/7, waiting to take your bets on a ping pong game across the globe. You can gamble at crypto casinos online. You can buy lottery tickets, day trade stocks and the list goes on. Everywhere you look, gambling is there for you, 24 hours a day. We see advertisements of highly dressed people, sitting around a blackjack table and celebrating the dealer busting a hand of blackjack. But don't be fooled - that is all an illusion.</p> <p><strong>The statistical probability that a compulsive gambler will profit from gambling over the long term is 0</strong>. <strong>You have absolutely no chance of winning the more you gamble.</strong> Compulsive gamblers have a hard time accepting this truth. Now, you may have gambled and won a $500 bet on any given day at long odds. But for the compulsive gambler, that means betting that $500 the next day and losing it, plus a lot more. The odds are stacked against you from the very beginning. The safest way to win is by not gambling at all.</p> <p>Nowadays, these online companies have gotten much more clever, and promote \"free games\" with no obligation to betting money. The average person may think there is no risk to doing this, but there is a big risk. You may think \"there is no risk to gambling because I am not betting any money\" right? Wrong. What these companies are actually doing is setting you up. These \"free games\" are psychologically designed to addict you to gambling. They track exactly how much you play the free games and when they are certain you are psychologically addicted, that's when they contact you and insist that you start placing actual money bets. A casino host will pop up in your chat box, offering you something with what appears to be a \"can't resist\" offer, such as \"deposit 100 dollars real cash and get 1,000 in casino credit\". But it's all a scam. They know you're addicted, and they know you'll just give it all back. They are trying to build their financial happiness off of the misery they have caused in your life. Do not allow this to happen.</p> <p>It takes approximately 6 months for your brain to repair itself from a gambling addiction. You must stay 100% laser focused on your self-awareness. Scrutinize everything you do, down to the last detail. Your brain will play tricks on you, and you have to make yourself say no when coming off of an intense gambling addiction. The impulses will lessen over time, but you will need additional help. This is what I recommend you do if you think you are addicted to gambling:</p> <p>(1) Immediately get yourself into group therapy for compulsive gamblers. Each city usually has services for those and they are most often free. GA (Gamblers Anonymous) is a wonderful organization to help you. This will raise your self-awareness about gambling.</p> <p>(2) Find an individual therapist that specializes in gambling addiction and begin having sessions. If you can't afford it, look for free services offered by the community.</p> <p>(3) <strong>If you are having uncontrollable urges to gamble after recently trying to stop gambling, go into the bathroom, look into the mirror, and say out loud \"Gambling is a scam, a trap, and I am not going back to it.\"</strong> Say it 100 times a day if you must. This will keep you in the reality and separate you from the illusion that you need to keep gambling.</p> <p>(4) Start keeping a journal and write down everything and anything you feel. This will keep you self aware and in touch with your feelings. There are free online journals for you if you sign up at their sites. I have held mine for many years at no cost.</p> <p>(5) Tell everyone in your life the complete 100% truth about your gambling addiction (except your employer). Be open about your addiction and talk about your struggles. This will be hard at first because no one likes to be judged. But, it will allow the people you love to support you and you will not have to hide. <strong>This takes an immense amount of pressure off of the gambler as they recover.</strong> You will also gain back your self-respect and the respect of others. Gambling is highly associated with deceit, and is predicated on lies. Honesty with yourself and others is essential to beating a gambling addiction. A gambling addiction cannot survive in an honest environment. Adopt honesty as your new approach into everything you do in your life, it's a beautiful thing.</p> <p>(6) Stay away from toxic people that are self-destructive who do not support you in your recovery. Do not associate with other gamblers, drink alcohol or use drugs. Being around these influences will only encourage you to relapse. If people are texting or calling to encourage you to gamble, block them. If you need some new friends, make them at your support meetings.</p> <p>(7) Do not play games of chance, even if they are free. Do not buy or sell stocks, crypto or play any online games. No playstation games, cheat codes, none of that. Those things will only fuel your addiction. Remember, you're trying to rewire your brain so it repairs itself. You have to give it the utmost support.</p> <p>(8) If you are unable to control the use of your money, it's time to find someone else you trust to do it. Explain everything in detail to them, being 100% honest. Remove the temptation of having funds at your discretion until you regain control of your life.</p> <p>This will not be easy for you, but if you remain determined toward your recovery, you will succeed. <strong>There are no shortcuts through recovery from a gambling addiction, you just have to do the work</strong>. You can do this if you put your mind to it, and I wish you all the best as you try and get your life back. Gambling recovery is day by day. It is a marathon, not a sprint. Remember these things and hit me up in chat if you have any questions. Regards, John</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/DoneWithThis50\"> /u/DoneWithThis50 </a> <br /> <span><a href=\"https://old.reddit.com/r/problemgambling/comments/1pxt0at/what_happens_to_you_when_youre_addicted_to/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/problemgambling/comments/1pxt0at/what_happens_to_you_when_youre_addicted_to/\">[comments]</a></span>",
  "timestamp": 1766933187000,
  "source": "bdfb9cabb13d",
  "category": ""
}