{
  "guid": "https://old.reddit.com/r/problemgambling/comments/1pux4m2/lost_250k_from_age_1826_my_8year_spiral_from_day/",
  "title": "<h1><a href=\"https://old.reddit.com/r/problemgambling/comments/1pux4m2/lost_250k_from_age_1826_my_8year_spiral_from_day/\" target=\"_blank\">Lost 250k from age 18-26. My 8-Year Spiral from Day Trading to sports betting to Rock Bottom</a></h1>",
  "link": "https://old.reddit.com/r/problemgambling/comments/1pux4m2/lost_250k_from_age_1826_my_8year_spiral_from_day/",
  "pubDate": "2025-12-24T20:55:16.000Z",
  "description": "<div><p>Hey All, </p> <p>I'm 26 and I've lost $250,000 to what I convinced myself was \"trading\" and \"skill-based investing.\" Writing this out feels like ripping off a bandaid, but I need to do it for myself and maybe for someone else who's in the same hell I'm in.</p> <h1>How It Started: $50k and a Dream</h1> <p>At 18, I had $50k saved up from birthday money, gifts from relatives, and busting my ass at whatever jobs I could get as a kid. I opened a brokerage account thinking I was being smart and mature. Options trading looked like the fastest way to turn that money into real wealth. I binged YouTube, lurked in trading Discord servers, and genuinely believed I was educating myself.</p> <p>Then COVID happened and everything went absolutely insane.</p> <h1>The Run That Destroyed My Life</h1> <p>2020-2021 were unreal. I'm talking turning that $50k into almost $350k. The market was stupid easy, everyone was making money on meme stocks, and I felt like I'd unlocked some secret code to life. I'd wake up, make some plays, watch thousands of dollars appear in my account, and feel this rush that I can't even describe. I wasn't like everyone else slaving away at some boring job. I was special.</p> <p>The trading community I was in kept feeding this delusion. When I had bad weeks, they'd tell me it's normal, that I just needed better risk management, that becoming consistently profitable takes years and most people quit too early. I ate it up.</p> <h1>Losing It All (The First Time)</h1> <p>I blew through all $350k in 1 month on 1 bbad bet. Then I started dumping my entire paycheck from my tech sales job into my trading account. I'd lose it, make some back, convince myself I was \"recovering,\" then lose it all again. This cycle just kept repeating.</p> <p>Here's the fucked up part - I KNEW I was addicted halfway through. I knew it. But I couldn't stop because stopping meant admitting I'd wasted years and hundreds of thousands of dollars chasing something that was never real.</p> <h1>Sports Betting and Prediction Markets (aka How I Got Even Worse)</h1> <p>After burning through trading, I discovered sports betting and these new crypto prediction markets. I convinced myself this was different - more analytical, more about actual skill. Not like pulling a slot machine lever, right?</p> <p>Four months. I turned $25k into $450k in four months.</p> <p>Two weeks later it was all gone.</p> <p>I was checking scores at 3am, hedging bets while I should've been sleeping, telling myself the next one would finally be the winner that let me quit my job forever. Every loss just made me deposit more because I KNEW I could get it back.</p> <h1>The Actual Damage</h1> <p>I finally sat down and went through everything - bank statements, credit card bills, every brokerage account. Here's the truth:</p> <ul> <li>Out-of-pocket losses: $250k (my savings plus years of paychecks)</li> <li>Total money I won and then lost back: around $800k</li> <li>What I have to show for it: absolutely nothing</li> </ul> <p>I'm 26. Most people I graduated with ahave moved out or at least have some savings. Me? I'm still living with my mom and my brother who's a raging drug addict . I've got six figures in student loans and an IRS payment plan hanging over my head. I feel completely stuck and honestly pathetic. I need to get out of this living situation so badly but I can't even start to figure out how.</p> <h1>What Keeps Pulling Me Back In</h1> <p>I've recognized my triggers at this point:</p> <p><strong>The freedom thing</strong> - The idea of never having to work for someone else again, making my own schedule, being my own boss, the high-rolla lifestyle. \"Im not average, and i am smarter than 99% of people\" This one hooks me harder than anything. Anytime work feels suffocating, my brain goes \"one big win and you're free forever.\"</p> <p><strong>Seeing other people win</strong> - I see people my age or younger who actually made it. Nice cars, traveling, beautiful girls. I get so jealous and think \"I'm smart, I can do that too, I just need to manage risk better this time.\"</p> <p><strong>Job anxiety</strong> - Tech sales is brutal. I've been laid off multiple times. The constant pressure of hitting quota and worrying about the next layoff makes me think \"I should gamble just in case I need money.\" Which is insane because I'm destroying any safety net I could actually build.</p> <p><strong>Sunk cost</strong> - After losing this much, my brain tells me I HAVE to keep going to make it back. That quitting means all those losses were for nothing. So I keep saying \"just one more time\" and it's been eight fucking years of \"one more time.\"</p> <h1>The Same Lie, Over and Over</h1> <p>\"This time I'll use proper risk management.\"</p> <p>I've told myself this probably hundreds+ times and it's never been true. Not once. Because when you're addicted to gambling, the only \"proper risk management\" is not gambling at all. But I couldn't accept that. I always thought I was different, that I could control it, that THIS time would be the one.</p> <p>It never was.</p> <h1>Where I'm At Now</h1> <p>I'm not writing this because I figured it out or I'm on the other side. I'm still in the shit, just relapced today with another paycheck. I still get the urge. I still catch myself thinking \"maybe just once more.\"</p> <p>I'm writing this because I need to be honest with myself about what this really is. This isn't investing or trading or building a side income. This is straight up gambling addiction and it's taken eight years of my life and $250k that I'm never getting back.</p> <p>If you're reading this and see yourself in any of this - if you think you're different, that you just need more discipline, that you're THIS close to cracking the code - please don't make my mistakes. You're not going to beat the system. I wasn't special and neither are you (and I mean that in the kindest way possible).</p> <p>I know I can't keep doing this but I honestly don't know how to stop. I'm putting this out there as my attempt at accountability.</p> <p><strong>To everyone in this community - I really need your advice. How did you actually quit? What worked for you? How do you deal with the triggers? How do you stop your brain from telling you \"just one more time\"? I'm desperate for any guidance here.</strong></p> <p>Thanks for reading this whole thing. It means a lot to just get it out.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Party-Blackberry9989\"> /u/Party-Blackberry9989 </a> <br /> <span><a href=\"https://old.reddit.com/r/problemgambling/comments/1pux4m2/lost_250k_from_age_1826_my_8year_spiral_from_day/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/problemgambling/comments/1pux4m2/lost_250k_from_age_1826_my_8year_spiral_from_day/\">[comments]</a></span>",
  "timestamp": 1766609716000,
  "source": "bdfb9cabb13d",
  "category": ""
}