{
  "guid": "https://old.reddit.com/r/energy_work/comments/1qeadws/just_learned_ive_been_doing_energy_work_for_15/",
  "title": "<h1><a href=\"https://old.reddit.com/r/energy_work/comments/1qeadws/just_learned_ive_been_doing_energy_work_for_15/\" target=\"_blank\">Just learned I've been doing energy work for 15 years without knowing what it was called. Where do I go from here?</a></h1>",
  "link": "https://old.reddit.com/r/energy_work/comments/1qeadws/just_learned_ive_been_doing_energy_work_for_15/",
  "pubDate": "2026-01-16T08:16:15.000Z",
  "description": "<div><p>When I was a teenager, my mom taught me a meditation technique for protection. Visualize white light starting at your head, moving down through your entire body to your toes before meditation.</p> <p>I took it further on my own. I realized I could actually feel and move a tingling sensation through my body. It starts behind my eyes or center of my head, and I can move it down through my shoulders, arms, and out through my hands. I feel warmth and tingling when the energy reaches my hands.</p> <p>I've been using this to charge my tarot deck before readings for years. I fill the deck with my energy, then shuffle and pull cards. I verify messages through pattern recognition by pulling 5-10 times per session and tracking which cards repeat.</p> <p>Just found out this week that what I've been doing is called Reiki. My mom's best friend practiced Reiki before she passed, but I didn't make the connection until now.</p> <p>I've only used this for tarot readings and meditation. That's it. I can feel the energy, move it consciously, and get consistent results. But I don't know the theory, history, or proper techniques beyond what I figured out intuitively.</p> <p>Looking for guidance on where to start learning more formally, how to develop this further, and whether I should get attuned or if my self-taught practice is enough. Also curious what else this energy work can be used for.</p> <p>Where do I go from here?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/DreamWalker3232\"> /u/DreamWalker3232 </a> <br /> <span><a href=\"https://old.reddit.com/r/energy_work/comments/1qeadws/just_learned_ive_been_doing_energy_work_for_15/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/energy_work/comments/1qeadws/just_learned_ive_been_doing_energy_work_for_15/\">[comments]</a></span>",
  "timestamp": 1768551375000,
  "source": "26c40323d587",
  "category": ""
}