{
  "guid": "https://old.reddit.com/r/energy_work/comments/1qia20o/keeping_your_energy_field_safe_and_shielded/",
  "title": "<h1><a href=\"https://old.reddit.com/r/energy_work/comments/1qia20o/keeping_your_energy_field_safe_and_shielded/\" target=\"_blank\">Keeping your energy field safe and shielded?</a></h1>",
  "link": "https://old.reddit.com/r/energy_work/comments/1qia20o/keeping_your_energy_field_safe_and_shielded/",
  "pubDate": "2026-01-20T19:00:19.000Z",
  "description": "<div><p>So I was admittingly stupid and opened up portals in my home that let way too much energy in. This led to things constantly in my face, touching me without consent, and not being able to sleep in rooms with portals in them (my own bedroom being one of them).</p> <p>Yes, I used a pendulum, yes I used a spirit board, and yes, I practiced automatic writing as well as typing. Yes again, I know how irresponsible and foolish that was and thousands of dollars of therapy, shaman cord cutting, energy cleansing, ER bills later, here I am dealing with acute trauma.</p> <p>It actually started with meditation. I meditated so much in the beginning that I started seeing swirling colors and swirling white energy behind my eyelids as well as geometric shapes sometimes. Then I got so curious to connect to who I thought was my higher self and I kept talking to something every day (in the wrong ways with the tools I mentioned earlier sigh...).</p> <p>I have since stopped trying to talk to any energy beings because I am so afraid to open my energy field up again. I am now more sensitive to energy and constantly hear more frequencies that amp up sometimes too. I just ignore these things and try to stay as grounded as I can.</p> <p>My question is, can I go back to just meditating and not have that open up my energy field or do I have to close my energy field after every meditation session? </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Swimming_Reporter698\"> /u/Swimming_Reporter698 </a> <br /> <span><a href=\"https://old.reddit.com/r/energy_work/comments/1qia20o/keeping_your_energy_field_safe_and_shielded/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/energy_work/comments/1qia20o/keeping_your_energy_field_safe_and_shielded/\">[comments]</a></span>",
  "timestamp": 1768935619000,
  "source": "26c40323d587",
  "category": ""
}