{
  "guid": "https://old.reddit.com/r/overemployed/comments/1qeppfq/ai_panic_pushed_me_into_oe_three_years_later/",
  "title": "<h1><a href=\"https://old.reddit.com/r/overemployed/comments/1qeppfq/ai_panic_pushed_me_into_oe_three_years_later/\" target=\"_blank\">AI panic pushed me into OE- Three years later, nothing happened.</a></h1>",
  "link": "https://old.reddit.com/r/overemployed/comments/1qeppfq/ai_panic_pushed_me_into_oe_three_years_later/",
  "pubDate": "2026-01-16T19:30:21.000Z",
  "description": "<div><p>Every time some new AI model comes out, Claude, Codex, whatnot it is the same story again.</p> <p>Software engineering is done. In 6 months AI writes 1500% of the code. Pack it up. Become a plumber.</p> <p>Not gonna lie, at one point this shit got to me.</p> <p>September 2022. Newborn at home. I tried GPT-3.5 and basically shat my pants. How the fuck am I gonna feed my family? All I know is software. Im done</p> <p>That fear is what actually pushed me into OE.</p> <p>Started slow. One job, then 1.5, then J2, then J3, then back to two. That is the sweet spot for me.</p> <p>Now it is 2026. Three and a half years later. Same articles. Same LinkedIn prophets. Same fear mongering.</p> <p>And honestly, nothing really changed. Except now I dont stress about money at all. At this point i dont even care if we get replaced</p> <p>Just a random shower thought anyway i guess ehat i wanted to say is - </p> <p>Ignore the media bullshit if you can. If you cannot, then use that fear to stack jobs and cash instead of sitting there stressed. At the end of the day nothing dramatic is going to happen even though the CEOs are saying the opposite</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/code_beer_repeat\"> /u/code_beer_repeat </a> <br /> <span><a href=\"https://old.reddit.com/r/overemployed/comments/1qeppfq/ai_panic_pushed_me_into_oe_three_years_later/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/overemployed/comments/1qeppfq/ai_panic_pushed_me_into_oe_three_years_later/\">[comments]</a></span>",
  "timestamp": 1768591821000,
  "source": "cb06f34f68ad",
  "category": ""
}