{
  "guid": "https://old.reddit.com/r/overemployed/comments/1qhqb62/rto_5_weeks_into_my_new_job/",
  "title": "<h1><a href=\"https://old.reddit.com/r/overemployed/comments/1qhqb62/rto_5_weeks_into_my_new_job/\" target=\"_blank\">RTO 5 weeks into my new job</a></h1>",
  "link": "https://old.reddit.com/r/overemployed/comments/1qhqb62/rto_5_weeks_into_my_new_job/",
  "pubDate": "2026-01-20T03:43:51.000Z",
  "description": "<div><p>About 5 weeks ago i started J2. It was supposed to be 90% remote, that was the terms when I received the offer. my manager emphasized that she did not mind where I work from, as long as the work was done. She said repeatedly she's totally fine with remote work, and her only request is that we meet 1;1 in-person weekly. I agreed. Hell the pay is decent and i can swing one day in-person per week. </p> <p>Within the first week on the job, she changed her mind and said she wants me to come to the staff meeting too, which occurs on a different day of the week. So that's 2 days in the office. I agreed because I wasn't trying to rock the boat as the newbie. </p> <p>Fast forward 2 more weeks and my manager announced that we will all be expected to come in 3 days per week. She said there's pressure from leadership. </p> <p>Then last week (5 weeks into the job) we got the announcemnet that we'll be fully returning to office. five days a week. No more remote work at all. </p> <p>obviously this isn't going to be possible. i would have been able to swing 1 day in-person a week, but anything more is not sustainable. </p> <p>I read about RTO mandates all the time on these boards, this is the my first time being affected by it. i plan to put in my resignation tomorrow. i only made it 5 weeks (35 days total) into this job. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/girlwith_thecurl\"> /u/girlwith_thecurl </a> <br /> <span><a href=\"https://old.reddit.com/r/overemployed/comments/1qhqb62/rto_5_weeks_into_my_new_job/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/overemployed/comments/1qhqb62/rto_5_weeks_into_my_new_job/\">[comments]</a></span>",
  "timestamp": 1768880631000,
  "source": "cb06f34f68ad",
  "category": ""
}