{
  "guid": "https://simplyhormones.com/?p=10893",
  "title": "<h1><a href=\"https://simplyhormones.com/its-my-birthday-and-ill-cry-if-i-want-to/\" target=\"_blank\">IT’S MY BIRTHDAY (and I’ll cry if I want to)</a></h1>",
  "link": "https://simplyhormones.com/its-my-birthday-and-ill-cry-if-i-want-to/",
  "pubDate": "Fri, 25 Jul 2025 13:33:10 +0000",
  "description": "<p>by Kathryn Colas –</p>\n<p><strong>I’ve lived a long and varied life, with its ups and downs, as you’d expect. But menopause? That’s a whole other story, and I’m still talking about it today because…</strong></p>\n<p>In the 1860s (you can see where this is going…), I wouldn’t have been allowed to stand up in front of an audience and talk about menopause. I didn’t even have the vote.</p>\n<p>A hundred years later, in the 1960s, I still wouldn’t have been permitted to speak publicly about menopause. Worse, I could have been ‘sectioned’ under the Mental Health Act because of it.</p>\n<p>In 1989, the <a href=\"https://thebms.org.uk/\">British Menopause Society</a> (BMS) was founded. Twenty-eight years later, in 2007, I joined the BMS to learn more about menopause. The internet was still in its infancy, but I created the SimplyHormones website to make sense of menopause. Could I have been ‘sectioned’ for menopause in 1989? My husband might jokingly say he’d have supported that!</p>\n<p>Also in 2007, my target audience wasn’t even online, but I pursued my passion because no one was telling women – or anyone else – what they needed to know. Around that time, I connected with MPs, Members of the House of Lords, and clinical professors. I learned how the political and medical systems work when you’re brave enough to stand up and be counted. During this period, I was invited to speak on BBC Radio 4’s Woman’s Hour, BBC Breakfast, ITV’s This Morning, and other media channels.</p>\n<p>By 2015, recognised as a pioneer in menopause support, I launched the UK’s first menopause-in-the-workplace training programme, advocating for continuous education for everyone connected to women’s health, especially those navigating menopause.</p>\n<p>That same year, a forward-thinking UK government appointed Ros Altmann as Pensions Minister, a champion of social justice and an advocate for ongoing training in an aging workforce. Honoured with a CBE in the 2014 Birthday Honours List, she’s now a peer in the House of Lords. She’s had a very distinguished career and I admire her greatly – she brought about a lot of change. We had some great email conversations at the time.</p>\n<p>Another hero of mine was Teresa Gorman, an MP in the 1970s, known for her yellow jacket in the House of Commons. A self-described maverick, she openly endorsed Hormone Replacement Therapy (HRT). I loved her rebellious spirit. I met her around 2010 in Billericay, Essex, her constituency. A businesswoman who got things done, she was a bit like Marmite – loved or loathed. Sadly, she passed away in 2015.</p>\n<p>In the 2020s, Carolyn Harris (Labour MP) and Caroline Nokes (Conservative MP) worked cross-party on women’s equality. They made great strides, but the final bill was significantly watered down.</p>\n<p>In 2025, I met my local MP, Mims Davies, currently Shadow Minister for Women and a passionate advocate for women’s equality. She’s approachable, walks the walk, and must be a bit of a rebel too- I like her!</p>\n<p>For me, it’s come full circle. When COVID stopped the world in 2020, it was, from a business perspective, my best year ever. I had just launched my book, <a href=\"https://www.amazon.co.uk/Survive-Menopause-Without-Losing-Your/dp/191357900X\">How to Survive Menopause Without Losing Your Mind</a> – the title hints at the impact menopause had on me. But then my business crashed, so I started a new one, as you do! This evolved into the <a href=\"https://kathryncolasacademy.com/home\">Kathryn Colas Menopause Academy</a>, where we blend live, online, and digital platforms with a holistic approach to the health of women, their partners, families, and colleagues. You should take a look!</p>\n<p>Menopause is more than the end of reproduction – it’s a systemic transition affecting the entire body. You could even call it symbiotic, reflecting the interaction between cells.</p>\n<p>Recently, I watched a <a href=\"https://www.bing.com/videos/riverview/relatedvideo?&amp;q=podcast+with+Dr.+Louise+Newson+and+Dr.+Karan+Rajan&amp;qpvt=podcast+with+Dr.+Louise+Newson+and+Dr.+Karan+Rajan&amp;mid=4C9A1BD8CC0E57EE38614C9A1BD8CC0E57EE3861&amp;&amp;FORM=VRDGAR\">podcast with Dr. Louise Newson and Dr. Karan Rajan</a>, where I learned that young women undergoing surgical menopause are rarely offered HRT- less than 5% receive it post-hysterectomy, and 0% are offered testosterone. The <a href=\"https://www.nice.org.uk/guidance\">NICE Guidelines</a> are clear, yet doctors often ignore them, leaving these women uninformed and struggling. Dr. Newson’s husband, a surgeon I believe, noted that men undergoing similar procedures (e.g., testicle removal) are routinely prescribed testosterone to address symptoms like brain fog, reduced memory, and poor concentration – symptoms women also experience during menopause, whether surgical or natural. This double standard isn’t good enough. Both procedures are medically termed castration and should be treated with equal consideration.</p>\n<p>In the same interview, both doctors agreed that clinicians and surgeons generally seem to have tunnel vision. They don’t see the ramifications beyond treating the target organ.</p>\n<p>When it comes to women’s health, we must take a holistic view – physiologically and psychologically – connecting the dots for better health and longer lives. This isn’t airy-fairy stuff; it’s about seeing the body as a whole.</p>\n<p>My work continues. Birthday or not, I’m still outrageously passionate about women’s health, especially during and beyond menopause. Through my own experience, I’ve learned that a little knowledge goes a long way, and women should be thriving through menopause (the title of my next book, coming soon!).</p>\n<p>I don’t want to end on a sad note, but so much research concludes with, “more research is needed.” So, I’ll cry if I want to, but you won’t see me crying, even if I’ve cried a river. Let’s celebrate and shout!</p>\n<p>Lyrical nods to:<br />\n“It’s My Party” by Lesley Gore<br />\n“You Won’t See Me Crying” by Passage<br />\n“Cry Me a River” by Julie London (1953)<br />\n“Shout” by the effervescent Lulu</p>The post <a href=\"https://simplyhormones.com/its-my-birthday-and-ill-cry-if-i-want-to/\">IT’S MY BIRTHDAY (and I’ll cry if I want to)</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1753450390000,
  "source": "11ba2e4b31d3",
  "category": ""
}