{
  "guid": "https://simplyhormones.com/?p=5606",
  "title": "<h1><a href=\"https://simplyhormones.com/menopause-perseverance-tipping-points/\" target=\"_blank\">Menopause, Perseverance & Tipping Points</a></h1>",
  "link": "https://simplyhormones.com/menopause-perseverance-tipping-points/",
  "pubDate": "Tue, 07 Sep 2021 16:19:51 +0000",
  "description": "<p><strong>Menopause Perseverance and Tipping Points </strong></p>\n<p><strong>Kathryn Colas Academy celebrates CPDUK Accreditation </strong><strong>for Menopause Training Programmes                                                  <img src=\"https://simplyhormones.com/wp-content/uploads/2020/06/KColas_193-300x300.jpg\" alt=\"Kathryn Colas\" /></strong></p>\n<p>In 2012 Kathryn Colas resigned from a senior executive role in hotel management because of an unknown challenge that she was totally unprepared for.  Menopause: the debilitating symptoms, lack of awareness and the dense shroud of taboo were totally unexpected and difficult to accept. As someone who had always relied on her inner resilience, perseverance and bounce back approach, Kathryn decided to pursue answers to all of the questions that simply didn’t make any sense.</p>\n<p><em> </em></p>\n<p>Kathryn began to investigate, starting with a series of why’s, including why this natural transition was not on any workplace agenda and why women were simply expected to put up and shut up. Nine years later she is a published author, a highly regarded guest speaker and the founder of a menopause training business, the Kathryn Colas Academy. <span></span></p>\n<p> </p>\n<p>It’s not as if women in the public eye haven’t tried to start the menopause conversation on many occasions.  Julie Etchingham ITV Presenter of News at Ten in 2016, Kirsty Wark, news reader and journalist in 2017 and Mariella Fostrup in 2018 all hosted outstanding documentaries on the menopause, but Davina McCall hit the tipping point when she hosted ‘Sex, Myths and the Menopause’ on Channel 4, highlighting the throwaway attitude society has toward the menopause and why this simply has to change.</p>\n<p>Between 2012 and 2019 Kathryn worked extensively in many different forward thinking organisations delivering menopause training and awareness. But she wanted to take her work to a much wider audience.  In 2020 Kathryn began working together with external consultant Angela Hobbs, a passionate advocate for gender equality, together they combined their business experience, in depth knowledge and research to create two training programmes for menopause in the workplace.</p>\n<p> </p>\n<p>The programmes address different customer needs but share a combined purpose of support and inclusivity.</p>\n<p>The Executive Menopause Coach programme is designed for independent trainers with experience in the delivery of learning and development in the workplace, seeking to add menopause awareness, understanding and policy development to their portfolio. The first cohort from this programme achieved certification in September this year and will be joining Kathryn and Angela on 23rd September at a live webinar: Menopause Through the Looking Glass. <a href=\"https://www.eventbrite.co.uk/e/menopause-through-the-looking-glass-with-kathryn-colas-certified-trainer-tickets-168966173373?aff=ebdssbeac\">Book here.</a></p>\n<p> </p>\n<p>The second of these programmes, called The Menopause Ambassador programme is designed for businesses looking to create their own certified internal menopause ambassadors, or menopause champions, who on completion of the programme will be able to develop a comprehensive understanding of menopause and provide ongoing support to everyone within their organisations. Kathryn and Angela are already working on programmes three and four, due for launch in 2022, and achieved external accreditation earlier this year.</p>\n<p> </p>\n<p>The CPDUK Certification Service evaluates a variety of professional learning activities, accrediting only those of the highest standard.</p>\n<p>With no enforceable employment laws providing support, companies must take matters into their own hands.</p>\n<p>Both programmes focus on the beneficial impacts qualified individuals can have on every person in every workplace,</p>\n<p> </p>\n<p><em>The Kathryn Colas Academy aims to revolutionize the way we address the menopause in every workplace. We share knowledge and insight, instilling understanding of the menopause for everyone. </em></p>\n<p><em> </em></p>\n<p>Contact us now:</p>\n<p>Angela Hobbs – <a href=\"mailto:hello@kathryncolasacademy.com\">hello@kathryncolasacademy.com</a></p>\n<p>Kathryn Colas – <a href=\"mailto:kc@kathryncolasacademy.com\">kc@kathryncolasacademy.com</a></p>\n<p>W: <a href=\"https://kathryncolasacademy.com\">https://kathryncolasacademy.com</a></p>\n<p>T: +44 (0) 1824 582010 or +44 (0) 7502383412 (direct)</p>\n<p> </p>The post <a href=\"https://simplyhormones.com/menopause-perseverance-tipping-points/\">Menopause, Perseverance &amp; Tipping Points</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1631031591000,
  "source": "11ba2e4b31d3",
  "category": ""
}