{
  "guid": "https://simplyhormones.com/?p=5459",
  "title": "<h1><a href=\"https://simplyhormones.com/the-1-tip-for-women-on-how-to-blow-your-own-trumpet/\" target=\"_blank\">The #1 tip for women on how to blow your own trumpet</a></h1>",
  "link": "https://simplyhormones.com/the-1-tip-for-women-on-how-to-blow-your-own-trumpet/",
  "pubDate": "Thu, 16 Jul 2020 12:45:29 +0000",
  "description": "<p>Blow your own trumpet is something men somehow seem to do all the time.  They just subtly drop how brilliantly they contributed to the last design, or they jokingly repeat a complement from – obviously – a highly regarded person. I have only found out over 5 years into my working life men actually do this. They are so practised they make it sound like a normal conversation. Just try it, start listening out for it, and you will find many men drop positives about themselves, and their achievements all the time.</p>\n<p>Women find this harder, and often even do the opposite. They put themselves down, or typically spend a lot of time talking about a current issue or something they messed up.</p>\n<p>That wouldn’t be a problem if we were just judged on objective outputs. However, in many organisations you get a great new project or a promotion based on your reputation. Even seemingly objective appraisals are heavily influenced by your reputation. So, let me give you the #1 tip on what to do about this.</p>\n<h2>Why is it so hard to blow your own trumpet?</h2>\n<p>But first, let me explain why it’s so hard for women to blow their own trumpet. It seems easy to solve. Surely you can just tell women it’s okay to blow their own trumpet? But it’s actually really hard to do. When you do it, it feels unnatural and it often comes out the wrong way, thus making you sound really awkward. Why is this? This is because the girl-culture women grow up in is different from boy-culture.</p>\n<p>Girls aren’t supposed to boast. If they do they are ostracized by other girls. From a young age girls bond by confirming each other. They will say, ‘Look at my drawing, it’s rubbish’ and another girl is supposed to respond by saying, ‘I’s brilliant, I love it!’. When I started listening out for it, I heard it all the time! ‘No, your dress is gorgeous!’, ‘No, you really don’t have to be good at singing – none of us are – we would love you in the mums’ choir’.</p>\n<p>In contrast, it’s actually completely normal in boys-culture to broadcast your achievements. Boys get respect from other boys when they shout ‘I made more goals than you!’. Teachers then teach them it’s not okay to boast, and that’s when they start practising to do it in more subtle ways. I heard a boy say, ‘I don’t want to boast, but I did beat him yesterday.’</p>\n<p>In addition in day-to-day life talking about life’s miseries is a great way of connecting with other women. It really resonates, and often they reciprocate by sharing a story about something they are unhappy about, building an even stronger bond.</p>\n<p>No wonder than that it’s hard for women to learn to blow their own trumpet. You have learned that you get ostracized if you do, and you have learned that you build bonds by broadcasting your problems and faults.</p>\n<h2>the #1 tip when you need to blow your own trumpet: Change your perspective</h2>\n<p>So what can you do? The most powerful technique that’s worked for me is to put blowing your own trumpet in a different perspective. Ask yourself how it would help others if you would talk about your achievements.</p>\n<p>– Your colleagues would love to know what you are good at. It makes it easier for them to come to you when they have a problem that needs solving. When I asked men what they thought about other men talking about their achievements, they said it’s exactly what they want to hear. They believed it showed passion and knowledge. They learn from it too.<br />\n– Your line manager would love to know what you have achieved. It gives them ammunition which they can use to boast about their teams achievements. It can also help them put you forward if someone else needs an experienced person.<br />\n– Potential clients are often searching everywhere for a solution. If you don’t shout off the rooftops, they will never find you. Imagine how many more people you could help if more people knew about you?</p>\n<h2>Blow your own trumpet – in practice</h2>\n<p>Then, of course, you need to do it the right way. So listen out to how men do it, and start experimenting with dropping your great stuff into conversations.</p>\n<p>How could it help others if they know about your achievements?</p>\n<p>Looking for more tips? Try <a href=\"https://www.w2oconsultingandtraining.co.uk/blog/how-to-gain-confidence-to-speak-up-and-boast-about-your-achievements/\">How to Gain Confidence to speak up and boast about your achievements</a></p>\n<h3><strong>Our Guest Blog is written by Inge Woudstra who helps recruit, retain and advance women, and typically works with organisations in tech and engineering. This was first published on Inge’s website – <a href=\"https://www.w2oconsultingandtraining.co.uk/blog/blow-your-own-trumpet/\">www.w2oconsultingandtraining.co.uk</a></strong></h3>The post <a href=\"https://simplyhormones.com/the-1-tip-for-women-on-how-to-blow-your-own-trumpet/\">The #1 tip for women on how to blow your own trumpet</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1594903529000,
  "source": "11ba2e4b31d3",
  "category": ""
}