{
  "guid": "https://simplyhormones.com/?p=5428",
  "title": "<h1><a href=\"https://simplyhormones.com/menopause-and-working-from-home-do-they-go-together/\" target=\"_blank\">Menopause and working from home – do they go together?</a></h1>",
  "link": "https://simplyhormones.com/menopause-and-working-from-home-do-they-go-together/",
  "pubDate": "Tue, 07 Apr 2020 17:14:13 +0000",
  "description": "<h2>A recent article in the <a href=\"https://www.ft.com/content/1b304300-0756-4774-9263-c97958e0054d\">Financial Times</a> looking at the future of the ‘office model’ brought a few points to my attention – ringing my diversity and equality alarm bells as I read on.</h2>\n<p>We’ve all seen the juggle of women trying to be a mum one moment and then an executive the next. Their efforts on video calls when kids or pets have wandered into view have been ridiculed – but now the men are joining in with these calls having the same trouble, it seems the whole world sits back in its collective dining room chair to accept the change!</p>\n<p>It took the experiences of men to make this acceptable. Is more proof needed that the equality gap is so wide it will take Herculean efforts by all women to get more recognition for the values of equality? But…it will be so worth it.</p>\n<p>The chief executive of British Land, Chris Grigg, said: “You have to bear in mind that there are some people struggling to juggle childcare or homeschooling with their day job.” Note to Mr Grigg – women have been struggling with the unpaid aspect of caring while juggling paid work, for some considerable time and when we throw in the menopause card without much in the way of workplace knowledge or support, then female employees are falling off a cliff and it’s all so unnecessary.</p>\n<p>A survey from <strong>leaninorg</strong>* says that women are now spending 71 hours every week on the unpaid aspect of working; housework and caregiving, including the new responsibilities of the pandemic and this is before she starts doing her actual full-time paid job.  Men, on the other hand, are doing 20 fewer hours overall. For women of colour and single mums, the demands are even greater.</p>\n<p>In the same article, Martin Sorrell, the 75-year former chief executive of WPP, in a telling interview, tells us that he spends around £35m on property, in a year, whereas he’d “much rather invest that in people.” Well, he’s certainly making the right noises and it looks like a trend set to spread across the world. But, imagine, if some of those savings went into equality, diversity and inclusion, support and training, (especially menopause) then we’re truly on to a winner.</p>\n<p>They went on to say that in six weeks, the majority of office workers now work from kitchens and living rooms across the world ‘and it’s been pretty seamless’. The article focused on whether there is still a need for the same amount of office space, or real estate, in the future but I was happy to expropriate their research and turn it into a blog focusing on equality with a slant on menopause.</p>\n<p>I couldn’t find a woman’s voice in the article (except one of the contributing journalists) but one particular global chairman eulogised on the benefits of collaborative working in a shared workspace. And, tellingly, the gradual return to work following the Covid-19 lockdown has the potential to add to the health anxieties already being experienced by many employees. You won’t be able to touch anything, will you?  Stair rails, lift buttons and doors, office doors, toilet doors, flush handles, kettle, fridge, tea and coffee supplies, etc.</p>\n<p>There needs to be a whole new protocol regarding returning to a safe, healthy workspace. A further look at the survey by <strong>leaningorg* </strong>said:<strong> “</strong>Women are more likely than men to be experiencing symptoms of stress and burnout during the coronavirus pandemic. 1 in 4 women is experiencing severe anxiety with physical symptoms like a racing heartbeat, while only 1 in 10 men reports those symptoms.”</p>\n<p>How we use ‘the workspace’ was already undergoing changes, with hot-desking and flexible hours, as well as working from home already on the list but more is required to bring the heavily regulated industries, like banking, into this new way of working and bank executives see the current situation as a valuable experiment.<br />\nOthers see it as something temporary to run away from, like Mr Pat Pettit, a co-founder of an online marketplace for freelance consultants, Catalant Technologies, who revealed that: “I have a three-and-a-half-year-old and an 11-month old so I will be sprinting back to the office the day I can.”</p>\n<p>Refer back to my previous words about women and their unpaid hours – is his partner not in paid work, then? Even if she were, I’m sure she would also see the looming advantages of ‘sprinting back’ to work at the first opportunity. However, according to research, even when a working family can afford to buy-in childcare, women still bear the main responsibility.</p>\n<p>In interviews around the world, men are saying how much they appreciate what their partners have done in the past, not realising how difficult and challenging it can be. After all, it’s been shown that a single man spends only a few hours a week on housework/shopping and this reduces to zero when co-habiting.  Let’s have a grown-up conversation about this in workplaces, from the top down.</p>\n<p>There remains a biased view from the C-Suite, globally and although they do have some interesting views, none of them realises how gender-biased they (their views) are, even in a world where equality, diversity and inclusion are making huge strides, the top floor is not getting the message.</p>\n<p>*@fortunemag</p>\n<p><a href=\"https://www.ft.com/content/1b304300-0756-4774-9263-c97958e0054d\">The Financial Times article referenced can be found here</a></p>The post <a href=\"https://simplyhormones.com/menopause-and-working-from-home-do-they-go-together/\">Menopause and working from home – do they go together?</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1586279653000,
  "source": "11ba2e4b31d3",
  "category": ""
}