{
  "guid": "https://simplyhormones.com/?p=5432",
  "title": "<h1><a href=\"https://simplyhormones.com/guest-blog-giovanna-forte-in-praise-of-a-certain-age/\" target=\"_blank\">Guest Blog: Giovanna Forte – In praise of a certain age</a></h1>",
  "link": "https://simplyhormones.com/guest-blog-giovanna-forte-in-praise-of-a-certain-age/",
  "pubDate": "Thu, 11 Jun 2020 17:19:13 +0000",
  "description": "<p><strong>“Not too bad for an Old Bird?” my question was rhetorical: I felt fabulous.</strong></p>\n<p>Older, better? Not quite better, but different – <em>fabulous</em> is allowed. The necessary mind shift for women of a certain age has to be in accepting difference; things change. Calories find new places to settle and new weight harder to shift; skin becomes host to freckle and blemish in varying shades of beige and are here to stay. Limbs and face adopt a less defined outline. This is nature; it is not wrong but it is also not kind.</p>\n<p>After a 50th birthday, one becomes less eager to approach the magnifying mirror; are those <em>my</em> eyebrows? Is that <em>my </em>upper lip? Facial and bodily deforestation become a work in progress; no more sweet, fluffy light hairs on smooth contours of the face, but a single, long, coarse whisker that appears overnight.  One cannot spot the origins of this monstrous thing; one minute it is not there … and the very next, <em>voilà!</em></p>\n<p>An early unwelcome revelation took place shortly before my half-century. I was waiting to meet a dear friend whose job with THE leading fashion glossy involved curating photographs of the most beautiful women in the world. Lovely M arrived, kissed me on the cheek and remarked cheerily, <em>Hold on, there’s something on your face, let me take it away. </em>[pause]<em>  …. Oh, it’s attached. </em>With one firm tug, impassive expression and award-winning tact M settled wordlessly next to me and gossipy cocktail-o’clock commenced.</p>\n<p>The consummate professional, M bats not an eyelid at such apparent female defects, for his World of Women, has given him to understand that nothing is perfect. He once whispered of The Supermodel who demands that her early morning arrival at the studio is met with a bowl of iced water dressed with fresh lemon, into which she rests her face. The process banishes evidence of late nights and all they entail. Rest assured, it works with mortals, too.</p>\n<p>In younger days, exercise occurred without a second thought; now, the flesh is weak and a struggle precedes each episode, but happen it must for otherwise the effect of the years will show earlier than they need to. In addition to cycling and pilates, the <a href=\"https://www.amazon.co.uk/Natural-Facelift-Joseph-Corvo/dp/0712647562/ref=sr_1_6?dchild=1&amp;qid=1589116388&amp;refinements=p_27%3AJoseph+Corvo&amp;s=books&amp;sr=1-6\" target=\"_blank\" rel=\"noopener noreferrer\">Joseph Corvo</a> ten-minute routine staves off that tempting nip and tuck.</p>\n<p>Introduced recently to a woman who owns a cosmetic surgery business, I asked how much one might pay for a simple neck and chin lift. <em>Are you thinking of having one done?</em> She asked. My reply to the affirmative prompted her to peer closer and opine with enthusiasm, <em>Oh! But you need so much more – an eye lift there and Botox here, here and here. My card – get in touch and we’ll book you in.</em></p>\n<p><strong>Lady, I SO don’t think so.</strong></p>\n<p>Mrs Robinson, the Older Woman of Choice for our generation was only around 40 and for those of us who grew up in the ’70s when looks equalled currency she had what it took. But ten years later? Like it or not the mid-life challenge can be vexatious.</p>\n<p>But with primping and preening, plucking and painting, we persevere; progress is slower than it otherwise might be and on becoming accustomed to the ageing process we understand that giving oneself permission to go along with it all is just not that hard. Good looks belong not exclusively to youth and do not disappear; they adopt a different demeanour, evolving with us all the way.</p>\n<p>Meanwhile, the nip and tuck will have to wait for whilst life is rich my pocket is not; more importantly, there is too much fun to be had to take that pause right now. And as ever, BB has the last word.</p>\n<p><strong>Not too bad for an Old Bird?</strong></p>\n<p><em>No darling.<br />\nNot too old for a Bad Bird, either.</em></p>\n<p><a href=\"https://fortewinks.com/2020/05/10/in-praise-of-a-certain-age/\">Published on Fortewinks – a personal blog by Giovanna Forte.</a>  <em><a href=\"https://www.linkedin.com/in/giovannaforte/\">Giovanna Forte</a> is CEO at <a href=\"https://forte-medical.co.uk/\">Forte Medical</a>, and E2E Ambassador and an AMR Insights Ambassador.</em></p>The post <a href=\"https://simplyhormones.com/guest-blog-giovanna-forte-in-praise-of-a-certain-age/\">Guest Blog: Giovanna Forte – In praise of a certain age</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1591895953000,
  "source": "11ba2e4b31d3",
  "category": ""
}