{
  "guid": "https://simplyhormones.com/?p=5466",
  "title": "<h1><a href=\"https://simplyhormones.com/workplace-wellbeing-exercise-in-relation-to-menopause/\" target=\"_blank\">Workplace wellbeing and exercise in relation to menopause</a></h1>",
  "link": "https://simplyhormones.com/workplace-wellbeing-exercise-in-relation-to-menopause/",
  "pubDate": "Wed, 22 Jul 2020 06:33:26 +0000",
  "description": "<p>In the simplest terms, participating in exercise is important to maintain a strong and healthy body. It is important throughout each of our decades, but if you only just start at middle age, this is OK; you’re taking action to maintain or enjoy a healthier more active lifestyle. I can guarantee whatever you do you will benefit. It will help your body and mind, plus assist you through the natural progression of changes in your body as you grow older. I’m afraid you can’t stop the natural progression of getting older; in fact, I feel it liberating. There are many advantages of getting older but that is for another day.</p>\n<p>It is crucial that humans understand themselves (both women &amp; men) as their needs are different. An example is the transition women go through starting in mid-’40s to mid-50s – menopause. These needs must be taken into account when deciding what ‘wellbeing exercise’ is best for you at this time in your life. Bearing this in mind is crucial when Workplace Wellbeing is offered to ‘add value’; perhaps think of an offering that will help both women and men.</p>\n<p>It is also important that wellbeing offerings within the workplace look at their demographics as a basis for deciding what’s best to offer. Likewise, it is important that once you start offering wellbeing services to employees to make sure you review them. Ask for feedback and make alterations in response to what is said. ‘One size doesn’t fit all’ but Yoga, Pilates, walking groups, movement classes, relaxation classes, running groups, circuits outside, and personal training are great for all abilities. Just think who could benefit from these; women &amp; men of all ages, menopausal women, for staff with depression, stress, those going through rehabilitation, pregnancy, and cancer patients to name a few.</p>\n<p>It goes without saying that you need to take a GP’s advice for a few that I mentioned such as pregnancy or cancer. Always listen to your body and understand what is working and what isn’t. Try different things for you and find what you like and what is working. This way, workplaces can continue to amend, change and enhance their offering. It is important to have different departments working together (Occupational Health and Human Resources, for example) to ensure that ‘hotspots’ are catered for too.</p>\n<p>Menopause is something that women often suffer in silence and it is important to think of offering bespoke classes, dedicated group discussions once a month or help with nutrition through menopause. This will allow women to come together and share a topic that they are all going through, discuss and learn more in a safe space. In the end, workplaces want productive employees and employees want to feel valued. Understanding your employees and offering what is needed for their health and wellbeing is key. Menopause is one that falls under the radar and women suffer in silence. No one needs to suffer in silence so look to outsource what you can’t provide. If you would like to have a chat about workplace wellbeing, please get in touch.</p>\n<h2>Chris Andrews is the MD of <a href=\"https://personaltouchfitness.co.uk/\" target=\"_blank\" rel=\"noopener noreferrer\">Personal Touch Fitness</a> and an Advisory Board Member of Global Women for Wellbeing <a href=\"https://www.gw4w.org/\" target=\"_blank\" rel=\"noopener noreferrer\">GW4W</a></h2>The post <a href=\"https://simplyhormones.com/workplace-wellbeing-exercise-in-relation-to-menopause/\">Workplace wellbeing and exercise in relation to menopause</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1595399606000,
  "source": "11ba2e4b31d3",
  "category": ""
}