{
  "guid": "https://simplyhormones.com/?p=5425",
  "title": "<h1><a href=\"https://simplyhormones.com/my-menopause-am-i-going-through-it-or-not/\" target=\"_blank\">My menopause – am I going through it or not?</a></h1>",
  "link": "https://simplyhormones.com/my-menopause-am-i-going-through-it-or-not/",
  "pubDate": "Mon, 18 May 2020 17:09:53 +0000",
  "description": "<h2><em>This guest blog is from someone who read my book, <a href=\"https://simplyhormones.com/the-book/\">How to Survive Menopause Without Losing Your Mind.</a></em></h2>\n<p>Despite not being menopausal, she read it because she’s 49 – and wanted to know about it to be armed and ready! She wrote to me to share her experiences so far plus some tips for things that have helped her with some pelvic floor issues, which we think others may like to read. She’s also buying the book for friends and family she now recognises as going through menopause – and may not realise. Here’s her story.</p>\n<p>So far, I have not experienced any symptoms yet that I am aware of. I was a late developer and got my periods late, also my breasts were still growing till I was 25, so it could well be I have all of the ‘joy’ ahead of me. I had a chat with my mum and my sister (2 years older) and both of them haven’t had many issues either. My mum did have hot flushes and remembers some other things, but nothing major. Certainly nothing she would go to a GP for.</p>\n<p>I have so far perhaps noticed:</p>\n<p>Over the last 5-10 years, I have had more trouble sleeping. E.g. I wake up at 5 or 6am, go to the toilet, drink a glass of water and fall asleep again. Overall, I really no longer enjoy sleeping in. Sometimes I don’t fall asleep again at 6, and just lie awake till 7am but it doesn’t bother me, and it doesn’t make me overly tired during the day. It feels like I still rest, even if I don’t sleep.</p>\n<p>When I wake up at night, I am very hot, but certainly nothing that relates to being drenched in sweat. Typically, it suffices to just take off all covers and cool down.</p>\n<p>A lower dose of medication for my hypothyroid condition. Ever since pregnancy at age 34 I have had a slow working thyroid. It’s something that runs in the family: my mum has it, and all my 3 sisters and the condition can be triggered by pregnancy. It’s usually stable but can change, so I get my blood checked every 6 months to see if my medication is still sufficient. After 5 years of stability, it changed last summer when I turned 49… it’s the first time my medication has gone down! For some reason the thyroid is working better, I guess. There’s too little known about hypothyroid to draw any conclusions, but it could be linked.</p>\n<p><strong>The pill</strong><br />\nWhat makes it harder to know about menopause is that most of my life I have been on the pill. So, who knows what my periods are like? I have been on the pill almost continuously after age 23. Then I had a baby at 34, so obviously wasn’t on it for a while. Then my periods returned, and my GP recommended a copper coil. What a mistake! I only realised about a year later that it was making me bleed like the Niagara Falls every month. I also got into trouble with colleagues at work and my husband due to my irrational moods from the week before my period and was in depressive moods. Once I was back on the pill, all of that vanished.<br />\nI then learned from my younger sister that there is also no need to take the pill for 3 weeks and then stop, which my GP confirmed.</p>\n<p>From that moment on I have been taking the pill continuously – no period, no mood shifts, brilliant!! I know this is not the case for many women, and the pill can have side effects, but for me it’s been brilliant.</p>\n<p><strong>Embarrassment</strong><br />\nIt was interesting to read your stories in the book of how bodily functions have been such an embarrassing topic. I have grown up in The Netherlands with a liberal mum, and three sisters, and have discussed periods, leakage and menopause with all of them (not libido though). As well as with my two best friends (who I do discuss libido with). No, it’s not an everyday topic, and does get discussed at the right time, but I have luckily never been embarrassed about it.</p>\n<p><strong>Mirena coil</strong><br />\nWhen I turned 47 the practice nurse started questioning my pill use due to my age. I had no idea why, but she kept asking every 6 months, and then explained in more detail it was related to my age – despite menopause not being mentioned.</p>\n<p>She then recommended I stop using it and so I changed to the Mirena coil. The first two weeks were very irritating, but after that it’s been brilliant. I haven’t had a single period for two years and no mood swings that I am aware of either.</p>\n<p>Occasionally there is the slightest bit of ‘breakthrough’ bleeding, but I don’t even keep track as it’s only a few times a year. So really, while reading your book I was wondering ‘how on earth am I to know I am in menopause?’ And how will I know I can take out the Mirena coil, as I would no longer be able to get pregnant anyway?</p>\n<p>Both my sister and my best friend use Mirena and have been very happy with it. Also, again I am aware that this is very individual, and that not everyone has positive experiences with Mirena.</p>\n<p><strong>Stress incontinence</strong><br />\nHere is a topic I CAN relate to, and even feel somewhat of an expert on (by personal experience). However, it’s not related to menopause in my case but to pregnancy. It’s also a topic I didn’t talk about for years – only my mum and husband knew. After giving birth at age 34, I had no control over my bladder whatsoever. That did recover to a great extent (just small pads needed).</p>\n<p>However, for some unknown reason (perhaps because I broke my leg and couldn’t walk for months?) it got a lot worse two years later. I talked about it with some school mums and learned that what I had wasn’t normal and it should have improved.</p>\n<p>I ended up getting physiotherapy from a specialist women’s health physio, who taught me how I could feel my pelvic floor. Earlier, none of the regular exercises worked, as I didn’t have any idea which muscle to pull, so when the new mums talked about pelvic floor exercises, I did them too but never did them properly.</p>\n<p>The physio taught me ways I could feel it, and we worked with electronic feedback devices too. I tried and could feel it now, but it didn’t really work. A few years later, on a hiking holiday, it got so bad that I pretty much had to go every half-mile behind a bush. Once, I forgot to go before leaving a café and walked five minutes back, but halfway it started ‘falling out’, and there was nothing I could do. The entire coffee came out while I walked home in soiled trousers and I just hoped I wouldn’t meet anyone!</p>\n<p>My female GP told me ‘This is just something women have and you will just have to live with it.’ My furious mum told me to find a better GP and I did, and later got sling surgery on my private insurance, which included more physio. The physiotherapist taught me there was no point in doing the exercises if, as you say in the book, you don’t do them daily, many times a day! Unfortunately, the surgery had made it worse – the surgeon said it always worked on younger people so I then had to find out what would work.</p>\n<p><strong>Here’s what I learnt:</strong></p>\n<ul>\n<li>Train ALL your core muscles, the pelvic floor is not on its own, and the more trained your core is, the better your pelvic floor works too.</li>\n<li>Go to the toilet before you leave the house and before you leave the office/café/friend’s house etc</li>\n<li>Don’t drink any bladder irritants: Fruit juice, coffee, black tea, alcohol. They can irritate your bladder and will be harder for your bladder to keep inside.</li>\n<li>Only drink decaf coffee, herbal teas and water – this one has made a massive difference to me! I also make sure I am near a toilet when drinking wine.</li>\n</ul>\n<p>Ever since I made these changes, leakage has been very manageable with just a small pad each day!</p>\n<p><strong>Horse riding and the pelvic floor</strong><br />\nOne surprise was taking up horse riding which I didn’t expect to be great for the leakage, but instead, I noticed it was much less. A very good horse riding friend told me that riding is great for the pelvic floor! I have been riding three times a week for the last three years, and leakage is now perhaps once a day and just a little bit. I can now trot and canter without leakage at all and can run three miles without leakage – although I do still wear a little pad.<br />\nI haven’t done a single pelvic floor exercise apart from just riding.</p>The post <a href=\"https://simplyhormones.com/my-menopause-am-i-going-through-it-or-not/\">My menopause – am I going through it or not?</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1589821793000,
  "source": "11ba2e4b31d3",
  "category": ""
}