{
  "guid": "https://simplyhormones.com/?p=5558",
  "title": "<h1><a href=\"https://simplyhormones.com/the-original-menopause-pioneer/\" target=\"_blank\">The Original Menopause Pioneer</a></h1>",
  "link": "https://simplyhormones.com/the-original-menopause-pioneer/",
  "pubDate": "Mon, 29 Mar 2021 16:06:30 +0000",
  "description": "<div><img src=\"https://simplyhormones.com/wp-content/uploads/2020/05/Kathryn-Colas-SimplyHormones-Founder-smaller-sqaure-300x300.jpg\" alt=\"Kathryn Colas\" /><p>Kathryn Colas</p></div>\n<h1>The Original Menopause Pioneer</h1>\n<p>I’ve been given the accolade The Original Menopause Pioneer but let me tell you how I got there.</p>\n<p>It all started about twelve years ago when I was going through my own menopause hell. Fast-forward to 2020/21 to probably the best twelve months I have experienced. Yes, they have been a time of change and, for some, devastation, but for me, it’s been a time of huge excitement, activity, and growth.  And, it was totally unexpected. The year 2020 started, excitingly enough,  with the launch of my first book and then, along with the rest of the world, I crashed out. All bookings for our training cancelled. Dear reader, it would be an understatement to say that I was distraught.</p>\n<p> </p>\n<h3>The Book Launch and Covid-19!</h3>\n<p>You see, I was bouncing around like Tigger, having just completed my first book, How to Survive Menopause Without Losing Your Mind (<em>see link below for your £10 Voucher</em>). Printed in February, and then, at huge expense, a London Book Launch on Thursday 12th March. My adrenaline was high and as you can imagine, I was really buzzing.</p>\n<p>New hair cut (thank you Paul Cox <a href=\"https://www.athertoncox.co.uk/\">https://www.athertoncox.co.uk/)</a>, and a new outfit. Over a hundred people had accepted our invitation to the launch, including the press and potentially an MP.</p>\n<p>As a result of the Covid-19 pandemic spreading across the world and the growing uncertainty about whether to stay at home or venture out, we started getting cancellations. The first lockdown, you may remember, officially happened on 23rd March. As I write this blog, in fact <img src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/1f60a.png\" alt=\"😊\" />.</p>\n<p>Anyway, we still had sixty people turn up for the book launch, in a fabulous nightclub in London’s Waterloo, called Tonight Josephine <a href=\"https://www.tonightjosephine.co.uk/find-us/waterloo/\">https://www.tonightjosephine.co.uk/find-us/waterloo/</a>. We put on a Bit of a Do with a lunchtime<img src=\"https://simplyhormones.com/wp-content/uploads/2021/03/COCKTAILS-1-300x215.jpg\" alt=\"Cocktails\" /> party, so that we could control the crowds <img src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/1f609.png\" alt=\"😉\" />. And, that reminds me, they still have a box of my books in their office, we couldn’t collect them as the lockdown was in full session and nobody was in the office anymore.</p>\n<p>Ezio, our media guy <a href=\"https://www.zoomfilms.co.uk/\">https://www.zoomfilms.co.uk/</a> together with his photographer were all set up and our own personalised cocktails were flowing. I was on Cloud Nine (despite the pandemic. The pandemic was happening somewhere else, obviously).</p>\n<p>Within a couple of weeks, it reality hit me. I would describe this as feeling like a train crash (not that I’m familiar) but it represented my feelings of seeing not only my business crash but my life’s passion coming to an end. Cancelled bookings. Phone stopped ringing. No new enquiries. No business.</p>\n<h3>Resurrection!</h3>\n<p>My first thoughts were, ‘<em>well, that’s it, then. Twelve years of hard work down the Swanney.’</em> I really couldn’t face starting a business all over again. I didn’t have the energy. Or, so I thought. Another week passed. By a strange quirk of fate, my team were already in the process of revamping the SimplyHormones website (<a href=\"https://simplyhormones.com\">https://simplyhormones.com</a>),  which along with the professional videos and photography already in the bag, I was heavily invested in it but had no idea what to do next.</p>\n<p>I knew I couldn’t let this go without a fight. You may say it’s a cliché but I truly feel that Menopause is my destiny. I was put on this earth to help and support women through menopause because of my own ten years of menopause hell.</p>\n<p>But, let’s not get too morbid, especially as I’m a glass half full kind o’ gal, so, put the tissues away and fast-forward twelve months and I’m buzzing again.</p>\n<p><strong>Launching The Kathryn Colas Academy                       </strong></p>\n<div><img src=\"https://simplyhormones.com/wp-content/uploads/2021/03/Angela-Hobbs-red-shirt-200x300.jpg\" alt=\"Angela Hobbs\" /><p>Angela Hobbs</p></div>\n<p>It’s March 2021. I have a new business partner, welcome to Angela Hobbs of <a href=\"https://wilkinsonhall.com/\">https://wilkinsonhall.com/</a>, who shares my passion for menopause and she’s also a great business strategist. Angela boosted my ego and told me I am ‘The Original Menopause Pioneer’, (I had no pretensions of seeing myself in this role but it was settled on my shoulders by others and I now wear it with pride). What did I do to have this great honour bestowed upon me? Little did I realise that I had developed a market that didn’t previously exist. Not only that, other people were now copying what I do.</p>\n<p>All those years ago, all I could see was that nobody was telling women what they needed to know. My own research and experience kept reminding me of this. I took everything I knew at the time and together with my passion that menopause education for ordinary men and women should be the ‘norm’, I created a market that, in the fullness of time, has seen new entrants. And that’s OK. Competition can only be a good thing. But, there’s still a lot of work to do and Angela has joined me as Co-Founder of the newly launched ‘Kathryn Colas Academy’ <a href=\"https://kathryncolasacademy.com\">https://kathryncolasacademy.com</a> where work continues apace.</p>\n<p>The Original Menopause Pioneer. Yep – that’s me, I’VE DONE THAT! <img src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/1f60a.png\" alt=\"😊\" /></p>\n<p>I had, of course, not been idle in the previous twelve months, I had done what many entrepreneurs do, once I realised there were many business possibilities during a Lockdown, I ‘pivoted’ my business; changed it to meet market needs. In other words, we had taken SimplyHormones and re-purposed it to become the <strong>Kathryn Colas Academy</strong>. This included my training programmes. We took a good hard look at how we could make everything have a new purpose, creating a benchmark for menopause workplace training at the same time. Well, we did it! Because of Covid-19 we made sure everything worked well online. Online training works on many levels, including taking up less time and not needing an expensive venue. As much as I love the human interaction of live meetings, we’re pleased with the new Hybrid version. It works on all levels.</p>\n<p>Bizarrely, last August, new business started coming in and this was a month when even in normal times, nothing much usually happens.  On top of that, our existing clients, having previously rejected the option to go online with us, said, ‘Yes, please, we’ll have some of that’. At last we had something to celebrate!</p>\n<p>Along the way, we’ve had fun, laughter and tears (not all mine <img src=\"https://s.w.org/images/core/emoji/16.0.1/72x72/1f609.png\" alt=\"😉\" />). I still say that I have the best job in the world. Because every single day, I know we are helping women, we are helping men and we are helping employers understand this ‘thing’ called menopause and benefiting financially from taking the right steps. Menopause management for every workplace.</p>\n<h3>Next Steps and Voucher Code</h3>\n<p>Taking into consideration all of the above, you can take my word for it that ‘menopause’ will be firmly embedded in the health and wellbeing section of every employer because, this time round, I won’t take ‘No’ for an answer and with our growing network of Executive Menopause Coaches (our team of professional trainers), we can make that journey easier for all concerned.</p>\n<p>I’ll leave you with this thought… By 2025, a billion women will be transitioning menopause, according to the WHO.  Don’t take my word for it but menopause is NOT a minority issue.</p>\n<p><strong>Next Steps:</strong> If you are an employer, let’s have a chat, if you are an employee, introduce us to your manager. It’s that simple.</p>\n<p>Let’s do this! Complete our contact form, now. <a href=\"https://kathryncolasacademy.com/contact\">https://kathryncolasacademy.com/contact</a></p>\n<h3><strong>VOUCHER CODE</strong> –  <img src=\"https://simplyhormones.com/wp-content/uploads/2020/05/book-2-300x203.jpg\" alt=\"\" />Get a personally signed book direct from Kathryn for only £10 (plus p&amp;p). Please add the code: HOTFLUSH10 at checkout and it will automatically apply the discount: <a href=\"https://simplyhormones.com/product/the-book-how-to-survive-menopause-without-losing-your-mind-by-kathryn-colas/\">https://simplyhormones.com/product/the-book-how-to-survive-menopause-without-losing-your-mind-by-kathryn-colas/</a></h3>The post <a href=\"https://simplyhormones.com/the-original-menopause-pioneer/\">The Original Menopause Pioneer</a> first appeared on <a href=\"https://simplyhormones.com\">Simply Hormones</a>.",
  "timestamp": 1617033990000,
  "source": "11ba2e4b31d3",
  "category": ""
}