{
  "guid": "https://old.reddit.com/r/Ayahuasca/comments/1qeynwt/the_issue_with_simply_saying_it_is_just_your/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qeynwt/the_issue_with_simply_saying_it_is_just_your/\" target=\"_blank\">The issue with simply saying it is just ‘your’ shadow.</a></h1>",
  "link": "https://old.reddit.com/r/Ayahuasca/comments/1qeynwt/the_issue_with_simply_saying_it_is_just_your/",
  "pubDate": "2026-01-17T01:08:05.000Z",
  "description": "<div><p>Please read with an open mind, given the complexity of this medicine. Unfortunately, I have had the so called ‘privilege’ of coming to know this side of the practice. </p> <p>Twenty years later, a lot has changed even just in how this practice is viewed and offered but unfortunately some things never change…</p> <p><strong>No Ai was used in this article</strong>. </p> <p><strong>A little Glimpse of the underworld and brujería</strong>.</p> <p>I wanted to share my experience regarding intrusions and, at times outright harm that may not simply be a reflection of one’s inner shadow. 😔</p> <p>Universal darkness is necessary, as it gives life to light; of course. </p> <p>However, the modern spiritual perspective often does not wish, or does not have the capacity to account for the use of advanced witchcraft, entity possession, demonic exchange, rites and ritualistic invocations that are sometimes employed to fulfill the will of certain shamans and indigenous lineages. </p> <p>These individuals may align themselves with certain ‘energies’ and at times unknowingly utilize such energies for purposes far beyond simply giving contrast or depth to the light.</p> <p>From what I can gather is whom claim to be healers are often driven by narcissistic personality traits then form ‘relationships’ with these beings in the name of power and ego. </p> <p>What is even more troubling is that they initiate lost and wounded healers, who believe they are being guided along a path of truth; only to discover, sometimes only by sheer luck, that their teachers are energetically draining participants and weaving them into a web of harm during ceremonies or stealing their Diets…</p> <p>This includes practices such as Brujeria. </p> <p>This ‘dynamic’ was also quite common during the Guru culture of the nineteen sixties alike a pyramid scheme wherein this mal-intent or malicious energy is passed through their students at times unbeknown to them because they’ve financially and emotionally invested in their Maestro etc aka a massive blind spot…</p> <p>When these practitioners encounter resistance or accountability from the wider community, it is common for them to redirect blame onto the participants by labeling the experience as the person’s shadow nature. </p> <p>In doing so, <strong>all responsibility is dissolved</strong>.</p> <p>This is an unfortunate reality within certain ayahuasca circles, and it is not a matter of personal shadow, but rather a well rehearsed use of black magic or simply dirty energy finding itself in the energy of participants and passed off as some type of ‘gaslight’ or projection etc. </p> <p>Many participants I have personally encountered believe they have received a coronation, initiation or induction into a lineage of light, yet in truth they are often much further from it than they realize.</p> <p>I say this after many journeys and ceremonies with healers from around the globe from the Kalawaya of Bolivia to the Tibetan Oracles of Ladakh to the curanderos of the Amazon who coincidentally all employ tools, prayers, practices, offerings and certain plants specifically designed to prevent these dark entities from entering their ceremonial space. So this stuff exists in their cosmology so we should be aware of its potential. </p> <p>DMT is a powerful doorway for energies that can feel demonic in nature particularly when one is propelled rapidly into non ordinary realms with a friction of energy that uplifts and compresses trauma in a way that it may become even more buried than before. </p> <p>In such states there is little room to discern what is truly occurring as attention is easily consumed by the intensity of the visionary experience. </p> <p>I’ve been told that even certain Bliss states achieved by AYA and psychedelics in general can pull us further from our trauma and thus make it even harder to access further down the path of healing. </p> <p>In eastern medicine these hyper realms are associated with the primordial energy of Fire. When this force is overused, whether naturally or synthetically it can lead to disillusionment and a disconnection from the heart mind nadi which is the subtle channel of intelligence and feeling. </p> <p>Please be cautious of modern trends that suggest the more visuals or psychedelia one experiences the more therapeutic the process becomes. Often the visions are a distraction! </p> <p>This thinking is a contradiction too as healing ultimately is a soothing grounding energy more alike water or Ying/Feminine followed by the structure offered by the masculine once the heart has found its space…</p> <p>Much love, and apologies for the heaviness. This is a topic that deserves a broader and more nuanced perspective.</p> <p>This is shared as empirical insight rather than a blanket statement. There is without question, profoundly beautiful healing of the soul that can occur through these medicines. </p> <p>Of course, I understand this may be misread, dismissed, or received with shifting resonance, depending on one’s own experience and perspective. </p> <p>All the best on your path. ❤✌</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Siddha-Somanomah\"> /u/Siddha-Somanomah </a> <br /> <span><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qeynwt/the_issue_with_simply_saying_it_is_just_your/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qeynwt/the_issue_with_simply_saying_it_is_just_your/\">[comments]</a></span>",
  "timestamp": 1768612085000,
  "source": "9f63288fb4a5",
  "category": ""
}