{
  "guid": "https://old.reddit.com/r/Ayahuasca/comments/1qdtw6v/pharmauasca_trip_report/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qdtw6v/pharmauasca_trip_report/\" target=\"_blank\">Pharmauasca Trip Report</a></h1>",
  "link": "https://old.reddit.com/r/Ayahuasca/comments/1qdtw6v/pharmauasca_trip_report/",
  "pubDate": "2026-01-15T19:54:00.000Z",
  "description": "<div><p>Last night, I took 'Pharmauasca', which is just Ayauasca, but with the processed pure ingredients instead of making a brew. My dosage was 150mg of the MAOI (50/50 harmine/harmaline freebase), and 100mg of DMT that I extracted myself. I prepared for this trip by fasting 12 hours before hand to avoid negative interactions with the MAOI, and set my intentions to be mainly focused my addiction to sugar, which I recently fell back on after getting my sugar intake under control for 2 years.</p> <p>Let me start by saying to everyone that's interested in trying it. Ayauasca is not just another 'drug' on your checklist to try. It's not just another psychedelic, it's more than that. There is a layer of depth that it takes you that most normal people that havnt done heavy spiritual work may not be ready to do this, and if you do try this, please do it with a shaman or guide. The experience of Ayauasca is not a pleasant one, it's not fun, it's not comfortable, It makes you ill, very ill. You have to make sure that the stuff you are eating is not going to negatively interact with the MAOI, otherwise you can be in for a horrible experience and potentially get yourself hurt, or even die.</p> <p>Now, let's dive into this experience. I took the 150mg of the MAOI, waited 30 minutes, then took the DMT. The MAOI started taking effect right around my DMT dosage. First effects I felt were nausea and sedation. As the MAOI takes it's effect on me, I started to feel extremely cold, and started getting shivers and sweating profusely, especially on my palms and the bottom of my feet, much like a flu-like sickness. I felt the muscualar constriction take it's effect, progressively locked jaw, and the desire to crawl into a fetal position. </p> <p>In about 20 minutes, the DMT starts to kick in. It comes in waves, but it was a smooth and quick come up. The first wave was mostly seeing more details in the texture in my bedsheets and my carpet, slight smooth chaotic patterns start to appear, which were quite pleasant and soft. The visuals were surprisingly not DMT like at all, they were less aggressive and less alien than smoking it. </p> <p>The next wave of DMT came in decently strong. Was seeing rainbows that started with the color purple at the outer ring, which transitioned to blue and yellow respectively in the inner rings. My walls started to have this 'reverb' effect, where the shape of things in my room would start to echo in this new rainbow color pallet. </p> <p>The visuals started out very pretty and pleasant, but I was feeling VERY nauseous by this point, and was sweating profusely as if I was running a marathon in Texas summer 100% humidity weather, while also feeling like it's 55°F freezing in my room.</p> <p>As the DMT started to take its full effect, I began to see the veil start to be lifted. I began to hear a faint voice in my head that wasn't me. This voice was just talking gibberish, not really making any sense, but it was speaking in an American southerners accent, which would continue to get louder and louder. As more voices started to appear, the visuals started to get extremely dark and sinister. Weirdly, some of the voices were not in my head, I could hear people talking physically around me in my room, speaking in differnt dialects that would reflect the demographic of where i live, like Native American, African American, and White voices. There was maybe about 6 voices, and I could hear a couple of them around me, one kept trying to talk in my ear, and their voices began to get aggressive, with tones of violence with slight sexual undertones.</p> <p>Dark imagery began being put into my head, imagery of distorted faces with crimson red eyes, with hyperbolic smiles akin to a joker smile. Everything started to look like witchcraft, like my soul was being manipulated by evil spirits. I would occasionally feel deep electrical shocks through my body which felt and sounded like I was being struck by lightning with orgasmic intensity lighting up my body, with each shock being more intense than the last one. The sound of loud drums and aggressive banging would happen seemingly randomly that would Jumpscare me. I had tears streaming down my face, despite me not being emotional at all, I wasnt crying but the tears were prosistant the entire time non stop. I surprisingly did not freak out, but was able to look at my dire situation objectively, without emotions and maintaining clarity of what was happening. These souls were unwanted and unwelcomed guests, that I did not allow them into me! They intruded into my mind and soul, and we're trying to cause problems! I was extremely uncomfortable and disturbed my the things I was seeing and hearing! The darkness was all around me like I was in some shadow scape, not to dissimilar to what I imagine a DPH or Benadryl trip would be like.</p> <p>This is at about 30-45 minutes after the DMT stated to take effect, and maybe 15ish minutes after the voices started appearing. The voices began chanting, so i completely shut my brain out, and casted all entities out of my head! </p> <p>I don't tolerate Intruders into my house, if these were human, id have shot them right then and there without hesitation. I rebuke and reject any and all spirits and energy in their entirety! The things I was hearing and seeing would probably get me permanently banned on most social platforms if I repeat or describe, so I will not discuss the content of their voices.</p> <p>Ignorance is bliss, so I chose ignorance over interacting with whatever dark magic I witnessed. I did not talk to them, I did not ask them questions, I simply have zero interest in what these demonic forces have to say, I don't care and I'm not going to allow them to try to interact with me. </p> <p>The instant I shut my brain down, the voices stopped. </p> <p>It went silent. The silence was loud.</p> <p>The shocks stopped, and the banging drums were at rest.</p> <p>The visuals became meaningless and disorderly both open eyed and closed eyed. I manually killed my trip only 30-45 minutes into it, and that was it. I was left with some moderate visuals after that, and peaked shortly after. Nothing significant happened after this point, the trip was dead, and Im glad I killed it.</p> <p>Im lucky that I have the spiritual gifts that I do, and was able the close my mind in time before something happened that I couldnt reverse. This trip could have been life ruining if I didn't shut it down at the beginning. Luckily, I was able to get out of this unscathed however, someone going into this spiritually undeveloped with no supervision by a professional could have been hurt or worse. </p> <p>Ayauasca is not something you should look forward to, it's something you should fear. Only do if you're prepared mentally and spiritually to walk through hell barefooted. This is a spiritual journey, not a trip. Remember that death stays on the table with Ayauasca, so take it seriously, please!</p> <p>If I could have gone back and change things, I would have. I wish I took the advise online and took it as seriously as what people were saying. I wish I did the 2 week diet, I wish I had a guide, I wish I understood what they meant when they said this was more than a psychedelic experience. Knowing what I know now, I would have not taken it, and waited instead of rushing it. </p> <p>After the trip, I was in a puddle of sweat, my bedsheets imprinted from my body, still in a feverish ill.i surprisingly didn't throw up, despite the nausea getting quite intense. I walked to my bathroom to pee, and almost slipped on my tile floor from the bottom of my feet being dripping with sweat. The DMT worn off at about the 6 hour mark after ingestion, while the MAOI continued to keep it's effects for about 10 hours after ingestion. Ended up fasting for a full 24 hours because I didn't want food to upset my stomach and make me throw up. I felt super dehydrated from all the sweating, so make sure yall hydrate a lot before the ceremony. It's now been about 20 hours after ingestion, and I feel relatively fine. My stomach feels a little off, but nothing concerning. No voices have came back, so that's good. Mentally, I feel ok, maybe a little foggy. I do have some moderately bad HPPD after that trip, hopefully it goes away. The experience was spiritually very intense, but the actual \"trip\" was moderately mild. Visually, it wasn't that intense. </p> <p>I don't know if I'll ever try it again, if I do I would need a lot of spiritual work to be done. </p> <p>Beyond the veil is beyond the prospect of the \"god\" religion paints. They paint God as a 2D stick figure compared to what God really is.</p> <p>It's beyond what the human mind is capable of understanding, and I have to be contempt with me not knowing durring this lifetime. I know that I don't know, I know that I'll never now, I know that's ok. </p> <p>I use to believe death was the end to suffering, but after last night I no longer believe that go be true. </p> <p>The path to enlightenment is dim and vaguely paved with dread, hard to distinguish the path from the dirt. One wrong turn and you'll be lost in delirium or nihilism, which is the antithesis to enlightenment. </p> <p>If senses are electrical, and emotions are chemical then reality is merely perspective.</p> <p>An empty mind is a room to breath.</p> <p>Thank you! </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Trikotic\"> /u/Trikotic </a> <br /> <span><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qdtw6v/pharmauasca_trip_report/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Ayahuasca/comments/1qdtw6v/pharmauasca_trip_report/\">[comments]</a></span>",
  "timestamp": 1768506840000,
  "source": "9f63288fb4a5",
  "category": ""
}