{
  "guid": "https://old.reddit.com/r/Meditation/comments/1q4addk/thought_i_was_terrible_at_meditation_until_i/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Meditation/comments/1q4addk/thought_i_was_terrible_at_meditation_until_i/\" target=\"_blank\">Thought i was terrible at meditation until i realized i was actually doing it right</a></h1>",
  "link": "https://old.reddit.com/r/Meditation/comments/1q4addk/thought_i_was_terrible_at_meditation_until_i/",
  "pubDate": "2026-01-05T03:12:52.000Z",
  "description": "<div><p>ok so i keep seeing posts here about anxiety and racing thoughts and i finally want to share something that actually helped me but not in like a cheesy instagram quote way, more like a practical \"oh shit that actually makes sense\" way.</p> <p>i avoided meditation for literally years because i thought it was supposed to be this thing where you sit there and your mind goes completely blank and you become some enlightened being or whatever. like i thought the goal was ZERO thoughts. just pure empty peaceful void.</p> <p>so whenever id try it would go like this. id sit down, close my eyes, and immediately my brain would start going \"ok we're meditating now very zen very peaceful wait did i lock the door? also my leg itches. god im so bad at this. what was that thing sarah said last week? ok FOCUS. why cant i focus? do i have adhd? should i get tested for that? wait no im supposed to be meditating. fuck im terrible at this\"</p> <p>and then id quit because clearly my brain was broken and i just wasnt a meditation person.</p> <p>here's the thing though. that whole experience where your mind wanders and you notice it and try to come back? that IS meditation. like thats literally the entire practice. nobody told me that for like 10 years.</p> <p>some teacher said its like training a puppy. puppy runs off, you call it back. runs off again, you call it back again. youre not mad at the puppy for being a puppy and youre not failing when it runs off. calling it back IS the exercise. that changed everything for me when i finally understood that.</p> <p>your brain is supposed to think. thats its whole job. trying to stop thoughts is like trying to stop waves in the ocean, its just not how it works. meditation is just noticing when you get lost in thought and gently redirecting back to breath or body or whatever.</p> <p>so apparently theres this thing called the default mode network in your brain. its basically the part thats always spiraling about stuff that happened years ago or might happen in the future. most of us are stuck in that mode like constantly. meditation actually shrinks the part of your brain that does anxiety (amygdala i think?) and strengthens the part that helps you regulate emotions. they can literally see the changes on brain scans after like 8 weeks.</p> <p>i read somewhere that people with chronic pain had it decrease by almost half after doing meditation regularly for a couple months. not because the pain went away but because their relationship to it changed. pretty crazy.</p> <p>anyway heres what i actually do because most meditation advice is annoying and vague.</p> <p>i just sit on my couch or wherever. close my eyes. and notice stuff. like \"i hear traffic outside. my shoulder is tense. im thinking about work. im breathing.\" thats it. when i realize ive been lost in thought for 5 minutes i just go \"oh hey thinking about that thing again\" and come back to noticing. no judgment just redirecting.</p> <p>i do this for maybe 5 minutes. sometimes 3 if im being honest. you dont need to sit for an hour.</p> <p>when im really anxious or having a panic attack i do box breathing. breathe in for 4 seconds, hold for 4, out for 4, hold for 4. repeat that like 5 times. it works because you cant worry about your problems AND count at the same time, your brain just cant do both.</p> <p>another thing i do when my thoughts are absolutely spiraling is body scan. start at your toes and just actually feel them. are they cold? tense? whatever. then slowly move up through your whole body. by the time you get to your head youve been present for several minutes without forcing anything.</p> <p>the puppy metaphor is honestly what i use most. mind wanders, i imagine calling a puppy back. \"hey come back to the breath.\" then it wanders again 30 seconds later. call it back again. thats the whole practice.</p> <p>common stuff people worry about. \"my mind races too much\" yeah mine too, everyones does. more racing thoughts just means more opportunities to practice noticing and redirecting. \"i dont have time\" you have 3 minutes, you were just scrolling reddit for 20. \"i fall asleep\" then you needed sleep, try sitting up straighter. \"it makes me MORE anxious\" yeah because sitting still makes you finally notice the anxiety thats been there all along, like turning on lights in a messy room. stick with it.</p> <p>ive been doing this somewhat regularly for like a year now. not every single day because im not perfect but most days. and look its not like it cured my anxiety or fixed my life.</p> <p>but i notice now when im spiraling. like ill catch myself in the middle of an anxiety loop about something that hasnt even happened and go \"oh im doing the thing again.\" just that little space between the thought and my reaction has changed a lot. i dont send as many stupid texts when im upset. i can sit with uncomfortable feelings without immediately trying to escape them.</p> <p>i still have bad days and anxiety and all that but im not as completely trapped in my own head anymore if that makes sense.</p> <p>anyway if youve been avoiding meditation because you think youre bad at it, youre not. theres no such thing. your mind wandering IS what youre supposed to practice with.</p> <p>just try 3 minutes tomorrow. sit down, notice stuff, redirect when your mind wanders. thats literally it.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/thomasmcgrat\"> /u/thomasmcgrat </a> <br /> <span><a href=\"https://old.reddit.com/r/Meditation/comments/1q4addk/thought_i_was_terrible_at_meditation_until_i/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Meditation/comments/1q4addk/thought_i_was_terrible_at_meditation_until_i/\">[comments]</a></span>",
  "timestamp": 1767582772000,
  "source": "77e6af033ceb",
  "category": ""
}