{
  "guid": "https://old.reddit.com/r/Meditation/comments/1puasc8/been_meditating_regularly_and_i_swear_time_feels/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Meditation/comments/1puasc8/been_meditating_regularly_and_i_swear_time_feels/\" target=\"_blank\">Been meditating regularly and I swear time feels different now</a></h1>",
  "link": "https://old.reddit.com/r/Meditation/comments/1puasc8/been_meditating_regularly_and_i_swear_time_feels/",
  "pubDate": "2025-12-24T01:21:56.000Z",
  "description": "<div><p>Has anyone else noticed that meditation messes with your perception of time? like not in a bad way but its just strange</p> <p>I started meditating mostly because my anxiety was getting really bad and my therapist suggested it. Been doing 15-20 mins every morning before work. Honestly at first I hated it and kept checking the timer constantly lol</p> <p>But now something weird is happening. My meditation sessions feel like they last maybe 5 minutes but when the timer goes off its been 20. And then during my actual work day, time feels slower? Like I'm not constantly in this rushed panic mode where the day disappears. I actually notice my lunch break, my commute home, stuff like that</p> <p>My coworker thinks im crazy but I swear im experiencing my days more fully now. Even boring stuff like waiting in line at the grocery store doesn't feel like wasted time anymore, its just.. time. Hard to explain</p> <p>The funny part is I had money set aside from Stаke to buy a new gaming setup because I thought I needed something to help me relax after work. Now I barely even think about gaming anymore because I don't feel like I need to escape as much</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/HurtfulFiring\"> /u/HurtfulFiring </a> <br /> <span><a href=\"https://old.reddit.com/r/Meditation/comments/1puasc8/been_meditating_regularly_and_i_swear_time_feels/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Meditation/comments/1puasc8/been_meditating_regularly_and_i_swear_time_feels/\">[comments]</a></span>",
  "timestamp": 1766539316000,
  "source": "77e6af033ceb",
  "category": ""
}