{
  "guid": "https://old.reddit.com/r/tripreports/comments/1qh82u9/first_time_edibles_trip_report/",
  "title": "<h1><a href=\"https://old.reddit.com/r/tripreports/comments/1qh82u9/first_time_edibles_trip_report/\" target=\"_blank\">first time edibles (trip report)</a></h1>",
  "link": "https://old.reddit.com/r/tripreports/comments/1qh82u9/first_time_edibles_trip_report/",
  "pubDate": "2026-01-19T16:01:01.000Z",
  "description": "<div><p>got the edibles...</p> <p>i was really excited about the upcoming experience, but this poor soul didn't know that how much he's going to freak out. i had a very light dinner that night, i was really excited all throughout the dinner but tried to stay calm. after dinner, i went to my room and took the edibles, it was one bhang goli (bhola munakka, very common edible in india). then i started studying for my exam with full determination and excitement. exactly after 1hr i stood up from my chair and booom!!!, i felt like the way dr. strange punches out peter parker's soul out of his body. i was like woahh, f*ck this is crazy, holy sweet jesus! then i felt a beam of strong laser which was originated from my throat and terminated at my belly button. i felt like a kick drum, DHAB DHAB DHAB! i could feel my heart getting heavy and it freaked me out and made me anxious, i got so scared as my heart beat fastened ( pls guys thats completely normal pls dont freak out). i jumped on my bed and asked my brother to bring me some water as i was feeling really thirsty. after drinking a litre of water i felt a bit relief then i started talking some random bs to my brother and laughing like a maniac, my face was red as a fresh farm tomato. oh jesus that non-stop laugh haha. then i switched off the room lights and started scrolling short with altering thoughts lol, idk what i was even thinking about. then i suddenly had another random thought and i called my gf and guess what, she was also so fucking high hahaha, she was also high on edibles. then i started talking in a really freaky way. every word, every movement, every second felt really exaggerated and felt never ending with a heaviness in the chest, that was the only irritating part of that high. while talking to my gf -- i was speaking and forgetting what i spoke TT and the same was with her she keeps speaking and forgetting what she said earlier, ah that was funny as fuck, then we ended the call with a crazy laugh. then i started feeling sleepy but i was still scrolling youtube and was thinking that how will penguins drive car (what a bs TT). idk when i slept. i found my phone on the floor the next morning. and omg that was the best sleep ever. i want to sum it up with -- THE HIGH WAS SO F*CKING EUPHORIC.</p> <p>and i noted in the past few days that edibles really helped my migraine, like damn the pain disappears, i am certain that the brain just focuses on enjoying the euphoria at that moment and ignored the pain.</p> <p>thats it guys hope y'all liked the trip report. pls upvote :&gt;</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/OnePerformance8792\"> /u/OnePerformance8792 </a> <br /> <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qh82u9/first_time_edibles_trip_report/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qh82u9/first_time_edibles_trip_report/\">[comments]</a></span>",
  "timestamp": 1768838461000,
  "source": "b0014430c144",
  "category": ""
}