{
  "guid": "https://old.reddit.com/r/tripreports/comments/1qho13e/accidentally_tripped_balls_on_rso_rick_simpson_oil/",
  "title": "<h1><a href=\"https://old.reddit.com/r/tripreports/comments/1qho13e/accidentally_tripped_balls_on_rso_rick_simpson_oil/\" target=\"_blank\">Accidentally Tripped balls on RSO (Rick Simpson Oil)</a></h1>",
  "link": "https://old.reddit.com/r/tripreports/comments/1qho13e/accidentally_tripped_balls_on_rso_rick_simpson_oil/",
  "pubDate": "2026-01-20T02:00:58.000Z",
  "description": "<div><p>I’ve stopped using cannabis for a little over a month now. It’s been a good tolerance cleanse. I decided I wanted to get something non smokeable but also without any added food coloring or unwanted unwanted ingredients, so I got ahold of some RSO cannabis oil. I put some on a piece of cookie and added coconut oil on top. I used an entire 0.1, not realizing how large of a dose it was. I put on some old UFC fights and watched Jon Jones and Daniel Cormier go at it. When they were cursing eachother out and Jon was saying he would kill DC if he ever spit on him, I realized how absolutely terrifying Jon Jones was, I felt like he was looking through MY soul, I have an image of him in my head that absolutely terrifies me and I don’t know why. I actually ended up realizing that I was tripping and I was stuck in one spot. I literally had tears running down my face from laughter at some points, then I passed out and my gf woke me up and that’s when I realized I went on a ride. I learned that it was a bit too much for me and now understand the amount required for me. I must’ve taken about 100mgs with no tolerance and I’ve never hallucinated like that off weed before. Be careful with RSO 🤣</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Capable-Pair-9994\"> /u/Capable-Pair-9994 </a> <br /> <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qho13e/accidentally_tripped_balls_on_rso_rick_simpson_oil/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qho13e/accidentally_tripped_balls_on_rso_rick_simpson_oil/\">[comments]</a></span>",
  "timestamp": 1768874458000,
  "source": "b0014430c144",
  "category": ""
}