{
  "guid": "https://old.reddit.com/r/tripreports/comments/1qd1ci8/200mg_cannabis_1mg_klonopin_150mg_dph_trip_report/",
  "title": "<h1><a href=\"https://old.reddit.com/r/tripreports/comments/1qd1ci8/200mg_cannabis_1mg_klonopin_150mg_dph_trip_report/\" target=\"_blank\">200mg cannabis + 1mg klonopin + 150mg dph trip report</a></h1>",
  "link": "https://old.reddit.com/r/tripreports/comments/1qd1ci8/200mg_cannabis_1mg_klonopin_150mg_dph_trip_report/",
  "pubDate": "2026-01-14T22:19:41.000Z",
  "description": "<div><p>I got home from school and felt in the mood to take a kpin and chill for a little bit. (if you dont know, its basically very similar to xanax.) I had taken half of one of these pills before (the pills are 1mg each) and actually helped me alot. I am diagnosed with severe anxiety and have paranoia, so it kind of helps me anyway. I took the full pill, waited for it to dissolve, and I decided to go walk down the street to the rec center for a little bit, because my friends usually hang out there. I was going to play basketball, but by the time I came here, I felt very disassociated and relaxed so I just sat down at the table area near the lobby that had a tv, for a little. One of my friends little cousins was there with me and was trying to talk with me, he asked me a question about some sort of movie that was on the tv, didnt know what he really said but i just turned my head back a little and said \"yeah\" in a very relaxed tone. After a little my friends were done playing basketball they came to the lobby to go get some food (they gave free food here) and I also got up to get some food. I was so fucking dizzy that I could barely walk and was stumbling all over the place, and I was laughing at nothing. After getting my food I walked back with one of my friends and shortly got home. I came to my room, and for some reason decided to also take 6 benadryl that was just laying in my cabinet, didnt even research if you could mix these pills or anything, I guess kpins just make you retarded. I went to the sunroom for a little while my family was in the kitchen and also decided to take a weed gummy, which I THOUGHT, for some reason said 10mg, but turned out to be 200mg, I guess. I went back to my room for a little bit, kind of just layed down on my bed, I was feeling really drowsy and tired at this point that I kind of just sank into my bed and closed my eyes. After like 5 minutes, I started to see shapes and figures of different colors behind my eyes, including a visual of a game that I used to play when I was young, \"tomb of the mask\" but in red. I then felt my chest getting very heavy and starting to feel very weird, so I panicked and stood up, went to the kitchen, and told my ENTIRE family what I had just done. I guess they seemed really disappointed. I asked them to come to my room, and my mom came. The movements of my family members and when they were talking, seemed unnervingly robotic, like they were fake or made by AI. I layed down for a little bit in my bed and kind of just closed my eyes, I don't remember much but I remember my mom trying to calm me down. Probably like 15 minutes later, I opened my eyes again and my vision was extremly blurry and my walls kind of looked like they were morphing like a snake. I closed my eyes again out of fear and I remember a while after, my dad coming into the room. My parents were both talking to me saying something like \"This is what you wanted right?\" But I could barley make out what they were saying. My dad started to look very creepy and robotic, to the point where he didnt he seem human, then the longer I stared at him he kind of started to look like a cartoon character. I then closed my eyes for a little bit and opened them again, and my entire room had become an aquarium. I sat up to look a little bit and saw my cat underneath a chair, and then my cat turned into a fish. I closed my eyes again and opened them, and my room turned into a sci-fi green looking video game. I freaked out and closed my eyes and then my vision turned into a phone screen which flipped over, and then I started to see colorful and rainbow patterns. After this I have almost no idea what happened, as I have no memory of it. But, I then randomly snapped back into reality and saw my sister in the room and a trash can, I guess I had thrown up a few times, but I didnt know. I closed my eyes again for I dont know how much time, and then randomly snapped back to my dad in the bed, trying to calm me down. Again, I went unconcious for a while and then I remember being on the beach laying down next to a blue bucket, I could feel like I was vomitting everywhere but couldnt see it. I then remember hearing someone saying \"We have to take your pants off\" Having no idea what was happening, I said \"Why?\" and they responded, and said there was vomit all over me. Im guessing this was my parents, but I didnt realize it. After this, I literally remember nothing. I then woke up a few hours later, seeing that I had actually vomited ALL over my bed. I woke up and my mom gave me some food; I didn't go to school this day because I was still feeling a little weird. I was really just glad that it was over.</p> <p>don't do drugs kids</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Worried_Stage4831\"> /u/Worried_Stage4831 </a> <br /> <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qd1ci8/200mg_cannabis_1mg_klonopin_150mg_dph_trip_report/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/tripreports/comments/1qd1ci8/200mg_cannabis_1mg_klonopin_150mg_dph_trip_report/\">[comments]</a></span>",
  "timestamp": 1768429181000,
  "source": "b0014430c144",
  "category": ""
}