{
  "guid": "https://old.reddit.com/r/smallbusiness/comments/1qfdosp/my_best_client_referred_me_to_their_friend_that/",
  "title": "<h1><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qfdosp/my_best_client_referred_me_to_their_friend_that/\" target=\"_blank\">My best client referred me to their friend. That referral just cost me my best client</a></h1>",
  "link": "https://old.reddit.com/r/smallbusiness/comments/1qfdosp/my_best_client_referred_me_to_their_friend_that/",
  "pubDate": "2026-01-17T13:49:54.000Z",
  "description": "<div><p>I've been doing web development for about 4 years now. Last year I landed this marketing agency that became my anchor client steady projects, $1,000-1,200 a month, super professional, paid within 48 hours every time. I'm thinking this is what sustainable freelancing looks like. Around November they tell me their business partner is launching a new venture and needs a developer. \"You'd be perfect for this, they're great to work with, we've been in business together for 6 years.\" I take the referral because of course I do. Good client vouching for someone, easy decision. First call with the referral and I can already tell something's off. Vague about requirements, keeps saying \"we'll figure it out as we go,\" but I push through because I trust my original client's judgment. Project starts and it's a nightmare. Constantly changing scope, wants daily updates, questions every decision, rude on calls. \"Why is this taking so long?\" \"I found a template that does this in 10 minutes.\" \"My nephew said he could build this.\" I'm bending over backwards trying to make it work detailed documentation, extra calls, revisions I'm not charging for. Two months in I finally realize this isn't going to get better. I send a professional email saying I don't think we're the right fit, offered to transition everything to another developer, even gave them a partial refund for the hassle. They lose it. Email my original client saying I \"abandoned their project\" and \"wasted their time.\" Suddenly my anchor client is cold. \"You made me look bad in front of my partner.\" \"I vouched for you.\" Haven't gotten a new project from them since. It's been two months.</p> <p>That referral didn't just cost me one bad client, it killed a $10K/year relationship I spent a year building. The thing that kills me is I don't even know what I was supposed to do differently. Keep working with someone who made every day miserable? Or stand my ground and lose my best client anyway? How do you handle nightmare referrals from good clients without torching the relationship? Or do you just never take referrals?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Cheap-Front-7722\"> /u/Cheap-Front-7722 </a> <br /> <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qfdosp/my_best_client_referred_me_to_their_friend_that/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qfdosp/my_best_client_referred_me_to_their_friend_that/\">[comments]</a></span>",
  "timestamp": 1768657794000,
  "source": "a7ea70f4b355",
  "category": ""
}