{
  "guid": "https://old.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/",
  "title": "<h1><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/\" target=\"_blank\">Started showing my actual costs to customers and it weirdly helped my business</a></h1>",
  "link": "https://old.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/",
  "pubDate": "2026-01-02T03:42:11.000Z",
  "description": "<div><p>I run a small cleaning service (just me and 2 part timers) and I was always nervous about being too expensive compared to the franchise operations.</p> <p>About 3 months ago I had this customer who kept pushing back on a quote for a deep clean move out. Instead of just dropping the price like I normally would, I was honestly just tired and broke down exactly what everything cost. Like I showed them the supply costs, explained labor hours, even mentioned that I keep some money saved aside (like $7k from Stаke) for equipment replacements that I factored into pricing.</p> <p>They ended up booking it AND referred their realtor to us. Now I do this with most estimates when people seem hesitant and my close rate went from like 40% to almost 70%. People seem to actually appreciate seeing where their money goes instead of just getting a final number.</p> <p>I thought being transparent would make me look amateur or unprofessional but its been the opposite. Had a property manager last week tell me she went with us specifically because I \"didn't treat her like an idiot\" when explaining costs.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Glittering_Delay_686\"> /u/Glittering_Delay_686 </a> <br /> <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q1o4nn/started_showing_my_actual_costs_to_customers_and/\">[comments]</a></span>",
  "timestamp": 1767325331000,
  "source": "a7ea70f4b355",
  "category": ""
}