{
  "guid": "https://old.reddit.com/r/smallbusiness/comments/1qdmgaj/my_favorite_client_just_sent_me_a_1star_review/",
  "title": "<h1><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qdmgaj/my_favorite_client_just_sent_me_a_1star_review/\" target=\"_blank\">My 'favorite' client just sent me a 1-star review because I started charging for extra work</a></h1>",
  "link": "https://old.reddit.com/r/smallbusiness/comments/1qdmgaj/my_favorite_client_just_sent_me_a_1star_review/",
  "pubDate": "2026-01-15T15:25:25.000Z",
  "description": "<div><p>I've been doing web development for about 4 years. Back in March I landed a restaurant owner who needed a simple website menu, hours, contact form, maybe 10 pages total. $2,500, signed contract, everything by the book. First month goes great. He's responsive, sends assets on time, compliments the work. I'm thinking this is the dream client. Then the site launches and the \"quick questions\" start. \"Can you just add a reservations button?\" Sure, 30 minutes, I'll throw it in. \"Can you make the menu downloadable as a PDF?\" Fine, easy. \"Can you add a little animation to the header?\" Okay, getting annoying but whatever. By month two I've done maybe 15 of these \"quick\" things. I finally sit down and add it up 12 hours of extra work. At my rate that's $600 I just gave away for free. So I send him a nice email explaining that future changes will be billed hourly, gave him my rate, even offered a discount because we had a good relationship. He loses it. Says I'm \"nickel and diming\" him. Says a \"real professional\" would stand behind their work. Says he thought we were \"building something together.\" I tried to explain the original scope was delivered months ago but he just kept saying \"it's the same website though.\"</p> <p>Yesterday he left me a 1-star Google review saying I \"surprised him with hidden fees after the project was done.\" The thing that kills me is I don't even think he's being malicious. He genuinely doesn't understand that what he asked for was extra. In his head, he hired me to \"do his website\" and the website isn't done until he says it's done. I should have had this conversation after the second or third request. Instead I stayed quiet trying to be the \"chill\" freelancer and now I'm the bad guy. How do you even explain scope to a client who doesn't think in those terms? Or do you just avoid these clients entirely?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Cheap-Front-7722\"> /u/Cheap-Front-7722 </a> <br /> <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qdmgaj/my_favorite_client_just_sent_me_a_1star_review/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qdmgaj/my_favorite_client_just_sent_me_a_1star_review/\">[comments]</a></span>",
  "timestamp": 1768490725000,
  "source": "a7ea70f4b355",
  "category": ""
}