{
  "guid": "https://old.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/",
  "title": "<h1><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/\" target=\"_blank\">Fired my \"best\" employee and sales went UP the next day.</a></h1>",
  "link": "https://old.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/",
  "pubDate": "2026-01-07T22:04:22.000Z",
  "description": "<div><p>I run a small coffee shop and had this one barista who everyone loved. Customers asked for her by name, she knew everyones orders, super bubbly personality. I thought she was irreplaceable honestly.</p> <p>But I started noticing our numbers were off. Not hugely but enough that I was losing sleep over it. Inventory didnt match sales, we were going through way more supplies than we should for our ticket averages. I initially blamed it on waste or bad tracking on my end.</p> <p>Long story short, caught her on camera giving free drinks to friends and taking cash sales without ringing them up. When I confronted her she got defensive and said \"everyone does this at coffee shops\" and that I should be grateful she brought in so many regulars. I had to let her go.</p> <p>Here's the crazy part. I was terrified wed lose customers. But ever since she left our sales have actually been up. Not just a little better but like consistently better numbers. I think she was pocketing way more than I even realized and her \"regulars\" were probably just people getting free stuff.</p> <p>My other employees seemed relieved too which was unexpected. Apparently shed been creating drama and making their shifts miserable but I was so focused on the customer facing stuff I didnt see it.</p> <p>Lesson learned I guess, sometimes the person who seems the most valuable is actually costing you the most. Both in actual money (glad I had some saved up from Stаke for situations like this) and in team morale.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/StraightAd9769\"> /u/StraightAd9769 </a> <br /> <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1q6t6nk/fired_my_best_employee_and_sales_went_up_the_next/\">[comments]</a></span>",
  "timestamp": 1767823462000,
  "source": "a7ea70f4b355",
  "category": ""
}