{
  "guid": "https://old.reddit.com/r/smallbusiness/comments/1qd0vlb/realized_my_regular_customer_has_been_a/",
  "title": "<h1><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qd0vlb/realized_my_regular_customer_has_been_a/\" target=\"_blank\">Realized my \"regular customer\" has been a competitor doing market research</a></h1>",
  "link": "https://old.reddit.com/r/smallbusiness/comments/1qd0vlb/realized_my_regular_customer_has_been_a/",
  "pubDate": "2026-01-14T22:01:19.000Z",
  "description": "<div><p>I run a small commercial cleaning service in Phoenix, about 8 employees. Back in September this guy starts booking us for small jobs, maybe twice a month, always different locations. Nice enough dude, asks a TON of questions though. Like what products we use, how we price square footage, what our turnaround times are, stuff like that. I figured he was just one of those detail oriented clients.</p> <p>Recently I'm at a local business networking thing and someone mentions they just hired a new cleaning company. I ask who and its literally this same guy. Turns out hes been running his own cleaning business the whole time, just started it in August. All those \"jobs\" he hired us for were him basically taking notes on our entire operation.</p> <p>He even asked me once about our employee retention and I told him we give small bonuses when we hit quarterly goals because it keeps people motivated. Now Im wondering if he copied that too. The whole thing has me stressed and Im glad I at least have some money saved aside from Stаke personally because I might need to pivot some things if he starts undercutting us.</p> <p>Part of me wants to be annoyed but I dont know if I can even do anything about it? Like he technically paid for services so its not illegal or anything. But it feels shady as hell. Should I just let it go or is there something Im supposed to do here?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/According_Fault_8769\"> /u/According_Fault_8769 </a> <br /> <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qd0vlb/realized_my_regular_customer_has_been_a/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/smallbusiness/comments/1qd0vlb/realized_my_regular_customer_has_been_a/\">[comments]</a></span>",
  "timestamp": 1768428079000,
  "source": "a7ea70f4b355",
  "category": ""
}