{
  "guid": "https://old.reddit.com/r/Futurology/comments/1it5h9d/potus_just_seized_absolute_executive_power_a_very/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Futurology/comments/1it5h9d/potus_just_seized_absolute_executive_power_a_very/\" target=\"_blank\">POTUS just seized absolute Executive Power. A very dark future for democracy in America.</a></h1>",
  "link": "https://old.reddit.com/r/Futurology/comments/1it5h9d/potus_just_seized_absolute_executive_power_a_very/",
  "pubDate": "2025-02-19T13:28:58.000Z",
  "description": "<div><p>The President just signed the following Executive Order:</p> <p><a href=\"https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/\">https://www.whitehouse.gov/presidential-actions/2025/02/ensuring-accountability-for-all-agencies/</a></p> <p>\"Therefore, in order to improve the administration of the executive branch and to increase regulatory officials’ accountability to the American people, it shall be the policy of the executive branch to ensure Presidential supervision and control of the entire executive branch. Moreover, all executive departments and agencies, including so-called independent agencies, shall submit for review all proposed and final significant regulatory actions to the Office of Information and Regulatory Affairs (OIRA) within the Executive Office of the President before publication in the Federal Register.\"</p> <p>This is a power grab unlike any other: \"For the Federal Government to be truly accountable to the American people, officials who wield vast executive power must be supervised and controlled by the people’s elected President.\"</p> <p>This is no doubt the collapse of the US democracy in real time. Everyone in America has got front-row tickets to the end of the Empire. </p> <p>What does the future hold for the US democracy and the American people.</p> <p>The founding fathers are rolling over in their graves. One by one the institutions in America will wither and fade away. In its place will be the remains of a once great power and a people who will look back and wonder \"what happened\"</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/chota-kaka\"> /u/chota-kaka </a> <br /> <span><a href=\"https://old.reddit.com/r/Futurology/comments/1it5h9d/potus_just_seized_absolute_executive_power_a_very/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Futurology/comments/1it5h9d/potus_just_seized_absolute_executive_power_a_very/\">[comments]</a></span>",
  "timestamp": 1739971738000,
  "source": "32f99fc9e761",
  "category": ""
}