{
  "guid": "https://old.reddit.com/r/VietNam/comments/1lcxjq3/to_indians_visiting_vietnam_from_another_indian/",
  "title": "<h1><a href=\"https://old.reddit.com/r/VietNam/comments/1lcxjq3/to_indians_visiting_vietnam_from_another_indian/\" target=\"_blank\">To Indians visiting Vietnam from another Indian</a></h1>",
  "link": "https://old.reddit.com/r/VietNam/comments/1lcxjq3/to_indians_visiting_vietnam_from_another_indian/",
  "pubDate": "2025-06-16T16:34:09.000Z",
  "description": "<div><p>I'm about to leave Vietnam, and here are some observations I have observed from Indians here. When we are abroad, we represent our country and we need to behave according to the customs of the country.</p> <p><strong>1. Crazy haggling -</strong> Stop bargaining to crazy amounts. Begin at 50-60% and make your way up. If the seller doesn't agree, stop harassing them. You are not owed anything. I saw this in Hanoi and Saigon and it was embarassing. So much so that when I went to go buy something in the market, the old man selling begrudgingly gave me his calculator, even tho I was ready to pay full price. Also stop trying to get discounts at places where there is a clearly listed price (spas, shops, restaurants).</p> <p>edit: on multiple occasions, I had to intervene and ask these tourists to mind their tone and not make the seller uncomfortable. </p> <p><strong>2. Argumentative tone -</strong> When something does not go as expected, you should not immediately assume the worst in the Vietnamese people and begin yelling at them. This is absolutely disrespectful.</p> <p><strong>3. Unreasonable requests from the hotel -</strong> I stayed in a hotel in Sa Pa where a gujarati family came back at 1am and demanded watermelon from the receptionist. What. In what world is that a reasonable request. So late at night and also atypical of a 3 star hotel.</p> <p><strong>4. Spatial awareness -</strong> There's not enough space, especially in the old quarter. Stop walking in massive groups and not moving when there is traffic trying to get by.</p> <p><strong>5. Staring -</strong> Stop gawking at the people here. Both Viet and non-Viet. Seriously. What is your deal? It makes people uncomfortable.</p> <p>I know i will get hate on this post, but this misbehavior is affecting how Indians are perceived in Vietnam and frankly other countries too. I'm done with it, and I'm tired of it affecting how I am perceived abroad.</p> <p>Edit 2: this has suddenly become a place where people have started listing all their grievances with indians. Some of you are decentering the conversation away from behavior in Vietnam and using it to encourage racism against Indians. That was not the goal of this post. The goal was to keep Indians accountable from another indian. It was not an space to begin saying hateful comments about indians</p> <p>edit 3: I keep getting asked why I'm not posting it on Indian subs. It's because I know indians will come and search here when they are researching for their trip. Also, if I post on Indian subs, the massive egos will begin harassing me to take it down. I have already received multiple harassing messages from this post saying that I am making indians look bad. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/crazybrah\"> /u/crazybrah </a> <br /> <span><a href=\"https://old.reddit.com/r/VietNam/comments/1lcxjq3/to_indians_visiting_vietnam_from_another_indian/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/VietNam/comments/1lcxjq3/to_indians_visiting_vietnam_from_another_indian/\">[comments]</a></span>",
  "timestamp": 1750091649000,
  "source": "4894e2286025",
  "category": ""
}