{
  "guid": "https://old.reddit.com/r/Paraguay/comments/1pwy4u3/los_expats_me_caen_como_el_ogt/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Paraguay/comments/1pwy4u3/los_expats_me_caen_como_el_ogt/\" target=\"_blank\">Los “expats” me caen como el ogt</a></h1>",
  "link": "https://old.reddit.com/r/Paraguay/comments/1pwy4u3/los_expats_me_caen_como_el_ogt/",
  "pubDate": "2025-12-27T13:42:54.000Z",
  "description": "<div><p>Sí, me caen re mal estos pelotudos pelados de países ricos. En X publicando que están viviendo en el paraíso y que no hay mejor lugar, obviamente son vendedores de bienes raíces haciendo su negocio muchos de estos. Lo que me molesta es uno, el término expat para diferenciarse de inmigrantes, ¿porqué?, porque ellos no son pobres y no lo hacen por necesidad y no son como los de latam por ejemplo, entonces son superiores. Dos, muestran solo una cara de la moneda, no como vive el ciudadano local promedio. Muestran una vida llena de lujos cenando en Carmelitas o en La Galería. Tres, les chupa un huevo el país, solo están por lo económico y por puterío, tienen cero conocimiento de la historia/cultura local y ni hablan o se esfuerzan en aprender el idioma. Cuatro, los criptobros y trabajadores remotos no aportan nada para el desarrollo del país, solo los que vienen a abrir empresas. Otros punto es que usan al país como puticlub, quieren hacer algo como pasa en Colombia y Tailandia, entonces publicitan al país con mujeres hermosas y familieras, en otros post con chicas en yates o en piscinas en tanga. El progreso/retroceso en esto va a depender de las mujeres y como se comporten con ellos. En fin no estoy en contra de la inmigración porque yo también traté de ser emigrante, pero yo me rompí estudiando el idioma y la cultura por lo menos de ese país, ah y se dice emigrante/inmigrante no expat</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Interesting_Snow_765\"> /u/Interesting_Snow_765 </a> <br /> <span><a href=\"https://old.reddit.com/r/Paraguay/comments/1pwy4u3/los_expats_me_caen_como_el_ogt/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Paraguay/comments/1pwy4u3/los_expats_me_caen_como_el_ogt/\">[comments]</a></span>",
  "timestamp": 1766842974000,
  "source": "4e87880e5d4a",
  "category": ""
}