{
  "guid": "https://old.reddit.com/r/castaneda/comments/1qcsfg1/recapitulation_like_cheese/",
  "title": "<h1><a href=\"https://old.reddit.com/r/castaneda/comments/1qcsfg1/recapitulation_like_cheese/\" target=\"_blank\">“Recapitulation like Cheese”</a></h1>",
  "link": "https://old.reddit.com/r/castaneda/comments/1qcsfg1/recapitulation_like_cheese/",
  "pubDate": "2026-01-14T16:50:39.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/castaneda/comments/1qcsfg1/recapitulation_like_cheese/\"> <img src=\"https://preview.redd.it/x6fsqkp6hcdg1.jpeg?width=640&amp;crop=smart&amp;auto=webp&amp;s=c81b7e11b5f3979395809a2018b77207fe88dcc6\" alt=\"“Recapitulation like Cheese”\" title=\"“Recapitulation like Cheese”\" /> </a>  <div><p>Two days ago while doing my morning passes before my coffee I had the need to recap some memories of my childhood that have been coming back to me over and over again as a recall for quite some time now. This time I tried to burn again some seeds from the Angelica plant that mention in Taisha's unpublished book, chapter:Cleansing Angelica. I lit a charcoal for incense and placed a pinch of seeds, filling the room with smoke. I sat with the silence crystals in my fingers, starting the recap from the most intense memory..I started the head sweeps and forcing inner silence, after a while the purple puffs appear, as I tried to remember as best I could details from the memory the purple puffs started to join together and follow the movements from my head reaching the point where it stretched like a long horizontal line. This line began to open and slowly the tonal energy began to appear as holes. At this point I completely forgot the memory I was working on and looked at the holes that were opening in front, the central hole had an image inside it that looked like a closed window, starting to zoom in until I found myself in the bathroom of my parents' house. It was morning, I was brushing my teeth looking out the window at the neighbors' houses before leaving for school. I did a few head sweeps inside the memory and found myself looking again at the tonal holes, each of which now contained a memory, the images were blurry and I couldn't understand what each one contained. also between the tonal holes was a blurry image of an IOB head that looked like a evil nun. The presence of all of these at the same time triggered a chaos within me, an unprecedented feeling, even though I felt it coming from my \"guts\", something else was preventing it from fully manifesting itself. I sat for a while observing this sight until it faded out. Opening my eyes and getting up to gather the items, my vision was filled with quite a bit of \"noise\".</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Bilissss\"> /u/Bilissss </a> <br /> <span><a href=\"https://i.redd.it/x6fsqkp6hcdg1.jpeg\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/castaneda/comments/1qcsfg1/recapitulation_like_cheese/\">[comments]</a></span> ",
  "timestamp": 1768409439000,
  "source": "63d9e5ba2819",
  "category": ""
}