{
  "guid": "https://old.reddit.com/r/castaneda/comments/1qeyj4d/left_body_and_right_body/",
  "title": "<h1><a href=\"https://old.reddit.com/r/castaneda/comments/1qeyj4d/left_body_and_right_body/\" target=\"_blank\">Left Body and Right Body</a></h1>",
  "link": "https://old.reddit.com/r/castaneda/comments/1qeyj4d/left_body_and_right_body/",
  "pubDate": "2026-01-17T01:02:57.000Z",
  "description": "<div><p><a href=\"https://preview.redd.it/hslwg36i4sdg1.jpg?width=736&amp;format=pjpg&amp;auto=webp&amp;s=c4214dd511e6fcb8826236a17cf410eafda68487\">\\\"Bilateral\\\" Symmetry</a></p> <p>Someone made a post on Cleargreen’s forum recently that delved into a topic that we really haven’t addressed in here. An excerpt from it:</p>  <p><em>Dr. Jill Bolte Taylor, a Harvard-trained and published neuroanatomist, describes a part ofthe left hemisphere of the brain as the \"storyteller\" or \"brain chatter\". She developed this perspective based on her personal experience of having a massive stroke in her left hemisphere, which caused her to temporarily lose the function of this internal voice and its associated self-awareness.</em></p> <p><em>According to Taylor, the \"storyteller\" component of the left brain is responsible for:</em></p> <p><em>• Language and thought: It thinks in language and processes information in a linear, methodical way.</em></p> <p><em>• Creating a sense of self: This part of the brain generates our sense of individual identity and ego (\"I am Jill Bolte Taylor, intellectual, neuroanatomist\").</em></p> <p><em>• Organizing information: It takes bits of data and weaves them into a coherent, logical story of our reality, focused on the past and future</em></p> <p><em>During her stroke, as her left brain functions deteriorated, Taylor experienced a shift in consciousness to her right hemisphere, which she describes as a state of pure awareness, euphoria, and a feeling of being connected to the universe as an \"energy being\".</em> <a href=\"https://community.castaneda.com/c/conversations/the-storyteller-and-the-energy-being\"><em>source page</em></a></p>  <p>Having a stroke 😳 not being a viable strategy for silencing the internal dialogue, we must look to Tensegrity to enact modifications to the synergy of the Left and Right Body. </p> <p><strong>This is directly actionable via “The Separation of the Left Body and the Right Body: The Heat Series,”</strong> the fourth series in the book <em>Magical Passes</em>:</p> <p>• <a href=\"https://www.reddit.com/r/castaneda/wiki/tensegrity/core_tensegrity\"><strong>Core Tensegrity Series</strong></a> <strong>-</strong> three Saturday classes from <a href=\"/u/Jadeyelmonte\">u/Jadeyelmonte</a> cover this series; I also grouped these videos into a <a href=\"https://www.youtube.com/playlist?list=PLvLSLokAPYVDjYdzcbBVLyCYne2vvEc1V\">YouTube Playlist</a>.</p> <p><strong>•</strong> <strong>And many of the passes in the</strong> <a href=\"https://www.reddit.com/r/castaneda/wiki/tensegrity/mapping/\"><strong>mapping series</strong></a> <strong>of our Wiki.</strong></p> <p>There is more information about the balance (or lack thereof) between the left and right body in the intro to the fourth series in the book:</p>  <p>Don Juan taught his disciples that for the sorcerer-seers who lived in Mexico in ancient times, the concept that a human being is composed of two complete functioning bodies, one on the left and one on the right, was fundamental to their endeavors as sorcerers. Such a classificatory scheme had nothing to do with intellectual speculations on the part of those sorcerers, or with logical conclusions about possibilities of distribution of mass in the body.</p> <p>When don Juan explained this to me, I countered that modern biologists had the concept of <em>bilateral symmetry</em>, which means \"a basic body plan in which the left and right sides of the organism can be divided into approximate mirror images of each other along the midline.\"</p> <p>\"The classifications of the sorcerer-seers of ancient Mexico,\" don Juan replied, \"were more profound than the conclusions of modern scientists, because they stemmed from perceiving energy directly as it flows in the universe. When the human body is perceived as energy, it is utterly patent that it is composed not of two parts, but of two different types of energy: two different currents of energy, two opposing and at the same nine complementary forces that coexist side by side, mirroring, in this fashion, the dual structure of everything in the universe at large.\"</p> <p>The sorcerer-seers of ancient Mexico accorded each one of these two different kinds of energy the stature of a total body, and spoke exclusively in terms of the left body and the right body. Their emphasis was on the left body, because they considered it to be the most effective, in terms of the nature of it's energy configuration, for the ultimate goals of sorcery. The sorcerer-seers of ancient Mexico, who depicted the two bodies as streams of energy, depicted the left stream as being more turbulent and aggressive, moving in undulating ripples and projecting out waves of energy. When illustrating what he was talking about, don Juan asked me to visualize a scene in which the left body was like half of the sun, and that all the solar flares happened on that half. The waves of energy projected out of the left body were like those solar flares—always perpendicular to the round surface from which they originated.</p>  <p><a href=\"https://i.redd.it/158s6lwa5sdg1.gif\">left body energy</a></p>  <p>He depicted the stream of energy of the right body as not being turbulent at all on the surface. It moved like water inside a tank which was being slightly tilted back and forth. There were no ripples in it, but a continuous rocking motion.</p>  <p><a href=\"https://i.redd.it/1uzqadde1tdg1.gif\">right body energy</a></p>  <p>At a deeper level, however, it swirled in rotational circles in the form of spirals. Don Juan asked me to envision a very wide, peaceful looking tropical river, where the water on the surface seemed barely to move, but which had shattering riptides below the surface.</p>  <p><a href=\"https://i.redd.it/v5ml1oyi5sdg1.gif\">right body energy (deeper)</a></p>  <p>In the world of everyday life, these two currents are amalgamated into a single unit: the human body as we know it.</p> <p>To the eye of the seer, however, the energy of the total body is circular. This meant to the sorcerers of don Juan's lineage that the right body was the predominant force.</p> <p>\"What happens in the case of left-handed people?\" I asked him once. \"Are they more suitable for the endeavors of sorcerers?\"</p> <p>\"Why do you think they should be?\" he replied, seemingly surprised by my question.</p> <p>\"Because obviously, the left side is predominant,\" I said.</p> <p>\"This predominance is of no importance whatsoever for sorcerers,\" he said. \"Yes, the left side predominates in the sense that they can hold a hammer with their left hand very effectively. They write with their left hand. They can hold a knife with their left hand, and do it very well. If they are leg shakers, they can certainly shake the left knee with great rhythm. In other words, they have rhythm in their left body, but sorcery is not a matter of that kind of predominance. The right body still rules them with a circular motion.\"</p> <p>\"But does left-handedness have any advantages or disadvantages for sorcerers?\" I asked. I was driven by the implication built into many of the Indo-European languages of the sinister quality of left-handedness.</p> <p>\"There are no advantages or disadvantages to my knowledge,\" he said. \"The division of energy between the two bodies is not measured by dexterity, or the lack of it. The predominance of the right body is an energetic predominance, which was encountered by the sorcerer-seers of those ancient times. They never tried to explain why this predominance happened in the first place, nor did they try to further investigate the philosophical implications of it. For them, it was a fact, but a very special fact. It was a fact that could be changed.\"</p> <p>\"Why did they want to change it, don Juan?\" I asked.</p> <p>\"Because the predominant circular motion of the right body's energy , is too friggin' boring!\" he exclaimed. \"That circular motion certainly takes care of any event of the daily world, but it does it circularly, if you know what I mean.\"</p> <p>\"I don't know what you mean, don Juan,\" I said.</p> <p>\"Every situation in life is met in this circular fashion,\" he replied, making a small circle with his hand. \"On and on and on and on and on. It's a circular movement that seems to draw the energy inward always, and turns it around and around in a centripetal motion. Under these conditions, there's no expansion. Nothing can be new. There is nothing that cannot be inwardly accounted for. What a drag!\"</p> <p>\"<strong>In what way can this situation be changed, don Juan?\" I asked.</strong></p> <p><strong>\"It's too late to be really changed,\" he replied. \"The damage is already done. The spiral quality is here to remain. But it doesn't have to be ceaseless. Yes, we walk the way we do, we can't change that, but we would also like to run, or to walk backward, or to climb a ladder; just to walk and walk and walk and walk is very effective, but meaningless. The contribution of the left body would make those centers of vitality more pliable. If they could undulate instead of moving in spirals, if only for an instant, different energy would get into them, with staggering results...\"</strong></p> <p><strong>\"…The sensation that human beings have of being utterly bored with themselves,\" he continued, \"is due to this predominance of the right body (and of reason).</strong> The only thing left for human beings to do, in a universal sense, is to find ways of ridding themselves of boredom. What they end up doing is finding ways of killing time: the only commodity no one has enough of. But what's worse is the reaction to this unbalanced distribution of energy. The violent reactions of people are due to this unbalanced distribution. It seems that from time to rime, (<em>learned</em>) helplessness builds furious currents of energy within the human body, which explode in violent behavior. Violence seems to be, for human beings, another way of killing time….\"</p> <p>…Don Juan was convinced that the predominance of the right body in this unbalanced merging of the right and left bodies marks the interruption of our <em>journey of awareness</em>. What seems for us to be the natural dominance of one side over the other was, for the sorcerers of his lineage, an aberration, which they strove to correct.</p> <p>Those sorcerer-seers believed that in order to establish a harmonious division between the left and the right bodies, practitioners needed to enhance their awareness. Any enhancement of human awareness, however, had to be buttressed by the most exigent discipline. Otherwise, this enhancement, painfully accomplished, would turn into an obsession, resulting in anything from psychological aberration to energetic injury.</p> <p>Don Juan Matus called the collection of magical passes which deal exclusively with the separation between the left body and the right body <em>The Heat Group</em>: the most crucial element in the training of the sorcerer-seers of ancient Mexico. This was a nickname given to this collection of <em>magical passes</em> because it makes the energy of the right body a little more turbulent. Don Juan Matus used to joke about this phenomenon, saying that the movements for the left body put an enormous pressure on the right body, which has been accustomed from birth to ruling without opposition. The moment it is faced with opposition, it gets hot with anger. Don Juan urged all his disciples to practice <em>The Heat Group</em> assiduously, in order to use it's aggressiveness to reinforce the weak left body.</p> <p>In Tensegrity, this group is called <em>The Heat Series</em>, in order to make it more congruous with the aims of Tensegrity, which are extremely pragmatic on the one hand and extremely abstract on the other, such as the practical utilization of energy for well-being coupled with the abstract idea of how that energy is obtained. In all the <em>magical passes</em> of this series, <strong>it is recommended to adopt the division of left and right bodies, rather than left and right sides of the body</strong>. The end result of this observance would be to say that during the execution of these magical passes, <strong>the body that doesn't perform the movements is kept immobile. However, all it's muscles should be engaged, not in activity, but in awareness.</strong> This immobility of the body that is not performing the movements should be extended to include it's head; that is to say, to the opposite side of the head. Such immobility of half of the face and head is more difficult to attain, but it can be accomplished with practice.</p>  <p>—————————</p> <p>An additional note: one of the commenters on the Cleargreen forum related some details about the vagus nerve, and it’s function as a mediator/regulator; which is important as you can’t directly affect the brain (it doesn’t even feel pain) with breathe or movement (outside of hyperventilating/asphyxiation or trauma), as you can the vagus:</p>  <p><em>The Vagus nerve (Latin for \"wandering\") starts in the brain and spins as two main branches - to left and right [body] - that connect to every major organ, constantly relaying vital information back and forth: heart, lungs, liver, spleen, stomach, and intestines. The Vagus is an enormous conduit of nerve cells affecting and exchanging neurochemical energy.</em></p>  <p><a href=\"https://preview.redd.it/yw8muopfasdg1.png?width=1750&amp;format=png&amp;auto=webp&amp;s=f416c31379de087f6469fc253d13c9bc8bc1e235\">vagus nerve</a></p>  <p><em>The Vagus is the master regulator,</em> <em>mediating between two opposite yet complementary functions of the divided nervous system, to maintain homeostasis</em>:</p> <p><em>• Sympathetic nervous system - which triggers \"fight or flight\", our Limbic system, preparing us for anything from being chased by a wild animal to that all important job interview -- [right body engaged].</em></p> <p><em>• Parasympathetic nervous system - which relies on the vagus nerve to help put the brakes on and brings the body back into a state of calm “rest and digest” wellbeing. [left body engaged]</em></p>  <p><a href=\"https://i.redd.it/i3byhf6kdsdg1.gif\">https://i.redd.it/i3byhf6kdsdg1.gif</a></p>  <p><em>The sympathetic nervous system [right body] and the parasympathetic nervous system [left body] pathways cross in the brainstem</em>, <em>i.e. nerve pathways originating in the left brain innervate the right body and all nerve pathways originating in the right brain innervate the left body..</em></p> <p><em>The vagus works in concert with the limbic system, and the Amygdala, to regulate emotions, stress responses, and attaching emotional significance to memories; the vagus nerve being</em> <strong><em>the</em></strong> <em>crucial interconnected communication pathway, sending information about the body's internal state (visceral sensory information) to the brain, directly influencing the activity of key limbic structures.</em></p> <p><em>Dysfunction or damage to these systems/frameworks, has been associated with a range of conditions, including: dementia, anxiety disorders, and schizophrenia.</em> <a href=\"https://community.castaneda.com/c/conversations/alien-installation-attacks-human-vagus\"><em>source page</em></a></p>  <p>Finishing with some passages from the books, explaining the falseness of mind-body dualism; starting with chapter 4 of <em>The Sorcerers’ Crossing</em> by Taisha Abelar:</p>  <p>Clara explained that we are convinced that a dualism exists in us; that the mind is the insubstantial part of ourselves, and the body is the concrete part. This division keeps our energy in a state of chaotic separation, and prevents it from coalescing.</p> <p>\"Being divided is our human condition,\" she admitted. \"But our division is not between the mind and the body, but between the body, which houses the mind or the self, and the <em>double</em>, which is the receptacle of our basic energy.\"</p> <p>She said that before birth, man's imposed duality doesn't exist, but that from birth on, the two parts are separated by the pull of mankind's <em>intent</em>. One part turns outward and becomes the physical body; the other, inward and becomes the <em>double</em>. <strong>At death the heavier part, the body, returns to the earth to be absorbed by it, and the light part, the</strong> <strong><em>double</em></strong>, <strong>becomes free. But unfortunately, since the double was never perfected, it experiences freedom for only an instant, before it is scattered into the universe</strong>.</p> <p><strong>\"If we die without erasing our false dualism of body and mind, we die an ordinary death,\" she said.</strong></p> <p>\"How else can we die?\"</p> <p>Clara peered at me with one eyebrow raised. Rather than answer my question, she revealed in a confiding tone that <strong>we die because the possibility that we could be transformed hasn't entered our conception. She stressed that this transformation must be accomplished during our lifetime, and that to succeed in this task is the only true purpose a human being can have. All other attainments are transient since death dissolves them into nothingness….</strong></p> <p>…In order for you to understand all this, you have to change,\" Clara said patiently: \"But then, that's precisely why you are here: to change. And to change means that you will be able to succeed in making the abstract flight, at which time everything will be clear to you.\"</p> <p>At my desperate urging, <strong>she explained that this unimaginable flight was symbolized by moving from the right side of the forehead to the left, but what it really meant was bringing the ethereal part of us, the</strong> <strong><em>double</em></strong>, <strong>into our daily awareness.</strong></p> <p>\"As I've already explained to you,\" she went on, \"the body-mind dualism is a false dichotomy. The real division is between the physical body, which houses the mind, and the ethereal body or the <em>double</em>, which houses our energy. The abstract flight takes place when we bring our double to bear on our daily lives. In other words, the moment our physical body becomes totally conscious of it's energetic ethereal counterpart, we have crossed over into the abstract; a completely different realm of awareness.\"</p> <p>\"If it means I'll have to change first, I seriously doubt I'll ever be able to make that crossing,\" I said. \"Everything seems so deeply ingrained in me that I feel I'm set for life.\"</p> <p>Clara poured some water into my cup. She put down the ceramic pitcher and looked at me squarely.</p> <p>\"There is a way to change,\" she said, \"and by now you are up to your ears in it. It's called the<a href=\"https://www.reddit.com/r/castaneda/wiki/recapitulation\"> recapitulation</a>.\"</p> <p>She assured me that a deep and complete recapitulation enables us to be aware of what we want to change by allowing us to see our lives without delusion. It gives us a moment's pause in which we can choose to accept our usual behavior, or to change it by <em>intending</em> it away before it fully entraps us.</p> <p>\"And how do you <em>intend</em> something away?\" I asked. \"Do you just say, 'Begone, Satan!'?\"</p> <p>Clara laughed and took a sip of water. \"To change, we need to meet three conditions,\" she said: \"First, we must announce out loud our decision to change so that <em>intent</em> will hear us. Second, we must engage our awareness over a period of time: We can't just start something and give it up as soon as we become discouraged. Third, we have to view the outcome of our actions with a sense of complete detachment. This means we can't get involved with the idea of succeeding or failing. Follow these three steps and you can change any unwanted feelings and desires in you,\" Clara assured me.</p>  <p>From chapter 18 of <em>The Active Side of Infinity</em>:</p>  <p>“Today, we're going to discuss a most serious topic in sorcery,\" don Juan said abruptly, \"and we're going to begin by talking about the <em>energy body</em>.\"</p> <p>He had described the <em>energy body</em> to me countless times, saying that it was a conglomerate of energy fields, the mirror image of the conglomerate of energy fields that makes up the physical body when it is <em>seen</em> as energy that flows in the universe. He had said that it was smaller, more compact, and of heavier appearance than the luminous sphere of the physical body.</p> <p>Don Juan had explained that the body and the <em>energy body</em> were two conglomerates of energy fields compressed together by some strange agglutinizing force. He had emphasized no end that the force that binds that group of energy fields together was, according to the sorcerers of ancient Mexico, the most mysterious force in the universe. His personal estimation was that it was the pure essence of the entire cosmos, the sum total of everything there is.</p> <p><strong>He had asserted that the physical body and the</strong> <strong><em>energy body</em></strong> <strong>were the only counterbalanced energy configurations in our realm as human beings. He accepted, therefore, no other dualism than the one between these two. The dualism between body and mind, spirit and flesh, he considered to be a mere concatenation of the mind, emanating from it without any energetic foundation.</strong></p> <p><strong>Don Juan had said that by means of discipline it is possible for anyone to bring the</strong> <strong><em>energy body</em></strong> <strong>closer to the physical body</strong>. Normally, the distance between the two is enormous. <strong>Once the</strong> <strong><em>energy body</em></strong> <strong>is within a certain range, which varies for each of us individually, anyone, through discipline, can forge it into the exact replica of their physical body—that is to say, a three-dimensional, solid being. Hence the sorcerers' idea of the</strong> <strong><em>other</em></strong> <strong>or the</strong> <strong><em>double</em></strong>. <strong>By the same token, through the same processes of discipline, anyone can forge their three dimensional, solid physical body to be a perfect replica of their</strong> <strong><em>energy body</em></strong> <strong>— that is to say, an ethereal charge of energy invisible to the human eye</strong> (<strong><em>but not the double</em></strong>), <strong>as all energy is</strong>.</p> <p>When don Juan had told me all about this, my reaction had been to ask him if he was describing a mythical proposition. He had replied that there was nothing mythical about sorcerers. Sorcerers were practical beings, and what they described was always something quite sober and down-to-earth. According to don Juan, the difficulty in understanding what sorcerers did was that they proceeded from a different cognitive system.</p>  </div>   submitted by   <a href=\"https://old.reddit.com/user/TechnoMagical_Intent\"> /u/TechnoMagical_Intent </a> <br /> <span><a href=\"https://old.reddit.com/r/castaneda/comments/1qeyj4d/left_body_and_right_body/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/castaneda/comments/1qeyj4d/left_body_and_right_body/\">[comments]</a></span>",
  "timestamp": 1768611777000,
  "source": "63d9e5ba2819",
  "category": ""
}