{
  "guid": "https://old.reddit.com/r/castaneda/comments/1qhtezj/through_the_wall_of_the_bedroom/",
  "title": "<h1><a href=\"https://old.reddit.com/r/castaneda/comments/1qhtezj/through_the_wall_of_the_bedroom/\" target=\"_blank\">Through the Wall of the Bedroom</a></h1>",
  "link": "https://old.reddit.com/r/castaneda/comments/1qhtezj/through_the_wall_of_the_bedroom/",
  "pubDate": "2026-01-20T06:18:53.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/castaneda/comments/1qhtezj/through_the_wall_of_the_bedroom/\"> <img src=\"https://preview.redd.it/34gbgva83geg1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=080bf7780a26b7014a2071c11e76be031ef2fbb3\" alt=\"Through the Wall of the Bedroom\" title=\"Through the Wall of the Bedroom\" /> </a>  <div><p>This happened last week. I put the main points in chat and was asked to post it.</p> <p>I woke up early Wednesday morning, gulped some coffee, and started recapitulating the day before. We recently had a death in the family, and I've been making it a point to recap each day as best I could, and the prior day was loaded.</p> <p>I was sitting with my legs crossed and my back against the bed, eye mask on, eyes open. During the recap, I had good control, targeted specific events without skipping around much, and made an effort to silence my dialogue. </p> <p>Halfway through the day's recap, I found myself interacting by doing head sweeps and intensely staring at a flat pink/black puff. I remember staring at it hard with each head sweep, my gaze was energizing it, realizing I was using a lot doing this, and that I needed to get it right or else it'd be a waste. There was a constant loud whooshing noise. </p> <p>In the bottom right corner of my field of vision, a yellow thick outline of a square with diagonal black lines through the color appeared. When I saw the square, I said out loud, \"Let's go!\" Shortly after, I was sliding forward across the carpet in the room and through the wall.</p> <p>After going through the wall of my room, I was flying through space, passing what appeared to be galaxies. I was excited to report back on the experience, realizing I was thinking too much; I intended to be silent. I knew I was intending in the second attention. When I felt uncomfortable, I intended to remain calm. I was sitting on something and being taken through the universe, and I couldn't see what it was. I remember wishing I learned more about astronomy so I could identify what I was seeing. Then I started to feel some fear and was aware of a transition. All of this felt extremely real. I was thinking and talking clearly throughout the flight.</p> <p>**Marking this as a spoiler because it might be triggering - Dream &amp; Death stuff**</p> <p><span class=\"md-spoiler-text\">I found myself on a world similar to ours, staring at a sun that was more yellow. Then I was with my wife (it sounded like her, I don't remember what people there looked like), and we were going through my dad's stuff at his place; he was gone there as well. Instead of a residential home, it was an apartment off a main street. I started helping and got sucked into what was happening there. My wife and I went to a hotel for the night. I recall the trip there, using the restroom, and going back to his place. We were making breakfast plans, then I realized and remembered where I came from. I wondered what would happen to me if I didn’t go back. I remembered Carlos's story and got scared that I couldn't return because I'd been interacting in this place so intensely. I thought to or wrote 'home' on my right hand between my thumb and index finger. I tried to come back and couldn't, then got distracted and forgot again.</span></p> <p>When I remembered again, I sat down with my back against the wall, and did head sweeps, and intended to come back. After a short while, I was back in my room, still sitting upright in a sweat, eyes open, gazing at blue splotches floating in front of me. Looked at my hands, checked the time (35 minutes), took a few minutes to collect myself, realizing I missed my wife from over there, it sounded and acted like her. Then I dumped my notes in the chat.</p> <p>After I wrote the main points. I did my daily passes and sat to gaze. During passes, anytime I stopped to think about what had happened, the room would 'pop' loudly; it happened at least three times. I felt it was important to put myself back together after what just happened. The popping isn't new, but it was more intense than usual. The rest of the day, I was in a daze. It took me until four or five in the afternoon to wake up.</p> <p>I really feel that I could have stayed there if I wanted to. I've had experiences similar to this, but never so pointed and related to what was happening here in my life.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/drinkjetfuel\"> /u/drinkjetfuel </a> <br /> <span><a href=\"https://i.redd.it/34gbgva83geg1.png\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/castaneda/comments/1qhtezj/through_the_wall_of_the_bedroom/\">[comments]</a></span> ",
  "timestamp": 1768889933000,
  "source": "63d9e5ba2819",
  "category": ""
}