{
  "guid": "https://old.reddit.com/r/advancedentrepreneur/comments/1ptgt0f/18_running_4_online_stores_doing_high_4figsmonth/",
  "title": "<h1><a href=\"https://old.reddit.com/r/advancedentrepreneur/comments/1ptgt0f/18_running_4_online_stores_doing_high_4figsmonth/\" target=\"_blank\">18, running 4 online stores doing high 4-figs/month - ready to scale but need direction from people who’ve been there</a></h1>",
  "link": "https://old.reddit.com/r/advancedentrepreneur/comments/1ptgt0f/18_running_4_online_stores_doing_high_4figsmonth/",
  "pubDate": "2025-12-23T01:19:09.000Z",
  "description": "<div><p>I’m 18, UK-based, and I’ve been grinding since 14. Right now I’m running 4 separate Vinted/eBay stores (menswear, womenswear, luxury fashion, and watches) doing high 4-figures monthly, sometimes 4-figures weekly.</p> <p>Here’s where I’m at:</p> <p>The reselling game has taught me a lot - customer acquisition, inventory management, cash flow. But I can feel the ceiling. I’m not interested in just scaling horizontally (more stores, more inventory). I want to build something with real leverage.</p> <p>I’ve been teaching myself Facebook Ads, Google Ads, and AI automation/workflows. I’ve got capital saved. I’m hungry and willing to put in the work. But I’m at a crossroads and could really use perspective from people who’ve made similar transitions.</p> <p>The reality of operating solo at 18:</p> <p>I dropped out of college because sitting in a classroom learning theory from people who’ve never run a business felt like a waste of time when I was already running one.</p> <p>Recently cut ties with a long-time friend I tried doing business with. I spent months trying to help him get started with reselling - he made some money but just wasn’t serious about it. That’s when it hit me: business isn’t for everyone, and I can’t afford to surround myself with people who aren’t hungry.</p> <p>The truth is, I don’t have anyone around me operating at the level I’m trying to reach. Everyone my age is focused on college, partying, or working part-time jobs. I’m not judging that, but it’s isolating when you’re trying to build something real.</p> <p>What I’m actually asking:</p> ∙ For those who scaled past the “trading time for money” stage - what was your next move? ∙ Should I master paid acquisition (ads) before pivoting, or is that a distraction from finding a better business model? ∙ How did you find people to learn from or build with when you were ahead of your peer group? ∙ If you were 18 with proven hustle, some capital, and time to build - what would you focus on?  <p>I’m not looking for cheerleading or motivation. I’ll outwork most people. What I need is strategic direction from people who’ve actually navigated this transition.</p> <p>Even if you just want to connect and talk shop regularly, I’m down. Building in isolation is hard, and I’d value having people around (even online) who actually get it.</p> <p>What would you do in my position?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Negative_Praline_939\"> /u/Negative_Praline_939 </a> <br /> <span><a href=\"https://old.reddit.com/r/advancedentrepreneur/comments/1ptgt0f/18_running_4_online_stores_doing_high_4figsmonth/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/advancedentrepreneur/comments/1ptgt0f/18_running_4_online_stores_doing_high_4figsmonth/\">[comments]</a></span>",
  "timestamp": 1766452749000,
  "source": "b08857167589",
  "category": ""
}