{
  "guid": "https://old.reddit.com/r/IWantOut/comments/1n27dkx/iwantout_24m_no_special_skills_israel/",
  "title": "<h1><a href=\"https://old.reddit.com/r/IWantOut/comments/1n27dkx/iwantout_24m_no_special_skills_israel/\" target=\"_blank\">[IWantOut] 24M no special skills Israel -> canada/germany</a></h1>",
  "link": "https://old.reddit.com/r/IWantOut/comments/1n27dkx/iwantout_24m_no_special_skills_israel/",
  "pubDate": "2025-08-28T09:14:25.000Z",
  "description": "<div><p>How to move out of Israel?</p> <p>I posted in the past, about how I'm an ex idf solider who became an objector and joined breaking the silence. I thought that staying in israel would be the best choice as my voice is valuable here, and maybe I can make a difference by raising awareness. </p> <p>Since then however, I began thinking that maybe leaving Israel is the way to go. I'm tired of the racist brain-washed mentality here, and knowing I'm living on a stolen land is pretty heartbreaking. </p> <p>I still want to make a change, I still want to help Palestinians and strive towards peace, but I feel like I'm going crazy and I hate this place. </p> <p>I'm pretty sure I want to leave, but I don't know where. I might be eligible for a polish citizenship, though I don't speak polish and never been there. I'd like to go to a place where I can get a fresh start. Preferably a place without a lot of antisemitism, that's generally accepting to foreigners. I figured canada or Germany are both good options. I've hear both have nice people and scenery, and good health systems. </p> <p>I'm afraid people will hate me wherever I go, cause I was once part of the occupation, and maybe that's just hatred, though I kinda hate myself as well. </p> <p>Anyway, I don't feel like I can live in this place anymore, so , any suggestions?</p> <p>Edit: I'm 22, not 24, finger slipped</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/All_Hale_sqwidward\"> /u/All_Hale_sqwidward </a> <br /> <span><a href=\"https://old.reddit.com/r/IWantOut/comments/1n27dkx/iwantout_24m_no_special_skills_israel/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/IWantOut/comments/1n27dkx/iwantout_24m_no_special_skills_israel/\">[comments]</a></span>",
  "timestamp": 1756372465000,
  "source": "c7aafa1f5b44",
  "category": ""
}