{
  "guid": "https://old.reddit.com/r/consciousness/comments/1qice8e/is_consciousness_just_the_brain_tracking_its_own/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consciousness/comments/1qice8e/is_consciousness_just_the_brain_tracking_its_own/\" target=\"_blank\">Is Consciousness \"just\" the Brain Tracking Its Own Change Over Time?</a></h1>",
  "link": "https://old.reddit.com/r/consciousness/comments/1qice8e/is_consciousness_just_the_brain_tracking_its_own/",
  "pubDate": "2026-01-20T20:24:32.000Z",
  "description": "<div><p>I was reading the last<a href=\"https://www.scientificamerican.com/article/what-is-consciousness-science-faces-its-hardest-problem-yet/\"> Scientific American post abou Consciousness</a>. For sure is still one of the hardest problems in science. We can map brain activity and neural correlates, but there’s still a gap between physical processes and subjective experience. One aspect that’s might actually be fundamental for me is <strong>time</strong>.</p> <p>Are there a theory that see <strong>consciousness as not just information processing, but temporally structured information processing</strong> ? (maybe TST? IDK)</p> <p>For me, all conscious experience is lived <em>in time</em>. Even experiences described as “timeless” (deep meditation, psychedelics, near-death experiences) are later remembered and reported as unfolding within a temporal structure. There is no consciousness without some internal flow.</p> <p>Crucially, this is <strong>not physical clock time</strong>. The brain doesn’t access time as an external variable. What it has access to are <strong>changes in its own internal states</strong>. Consciousness, on this view, depends on how a system integrates and compares its own states over time.</p>   <p>From an evolutionary perspective, this also makes sense: early organisms needed to integrate sensory information over time to guide action in changing environments. That temporal integration likely came before identity, narrative, or reflection (features that appear only in more complex forms of consciousness.)</p> <p>This also suggests that consciousness comes in degrees. Any living system capable of comparing its own internal states over time may instantiate some minimal form of experience. What distinguishes humans is not the existence of this mechanism, but how efficiently and densely the brain integrates information and feeds the results of that comparison back into itself.</p> <p>In the human brain, this process happens extremely fast and continuously, creating a tight feedback loop between incoming information, internal state comparison, and state updating. The subjective feeling of “being conscious” is not the detection of an external clock, but the experiential consequence of this rapid, ongoing self-updating process. In other words, consciousness feels like something because the system is constantly tracking and updating the rate of its own internal change. </p> <p>Under this framework, current AI systems are not conscious—not because they lack complexity, but because they do not construct a lived temporal perspective of their own internal states. Likewise, during deep sleep or general anesthesia, the brain does not stop processing information altogether; rather, the system that continuously compares and integrates its own states over time breaks down. When this self-comparison loop is inactive, the lived present disappears, and with it, conscious experience.</p> <p>Consciousness isn’t a thing, a place, or a moment. It’s a <strong>temporally extended, self-referential process</strong>—the emergence of a lived present from the continuous comparison of internal states over time.</p> <p><strong>___________________________</strong></p> <p>I’m not a medical professional or a philosopher—just posting here for the first time to share an idea I’ve been thinking about and to learn from the discussion. I’d really appreciate hearing where you think this makes sense, where it breaks down, or how you’d frame it differently.</p> <p>Thanks</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Routine-Poet-6972\"> /u/Routine-Poet-6972 </a> <br /> <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qice8e/is_consciousness_just_the_brain_tracking_its_own/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qice8e/is_consciousness_just_the_brain_tracking_its_own/\">[comments]</a></span>",
  "timestamp": 1768940672000,
  "source": "91280f3aa210",
  "category": ""
}