{
  "guid": "https://old.reddit.com/r/consciousness/comments/1qflbk0/people_often_assume_consciousness_evolved_to/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consciousness/comments/1qflbk0/people_often_assume_consciousness_evolved_to/\" target=\"_blank\">People often assume consciousness evolved to become more complex over time. But could the reverse actually be true? The case for microbial consciousness being vastly more complex</a></h1>",
  "link": "https://old.reddit.com/r/consciousness/comments/1qflbk0/people_often_assume_consciousness_evolved_to/",
  "pubDate": "2026-01-17T18:47:00.000Z",
  "description": "<div><p>Image: <a href=\"https://files.catbox.moe/mwr6f6.png\">consciousness evolving in an n-dimensional world</a> (see explanation below)</p> <p>Its often assumed that the organisms that are our distant evolutionary ancestors had \"less complex\" consciousness, for example many of them did not evolve 3D vision (the definition of consciousness im using is \"having experiences of any kind\"). Or that on a spectrum of consciousness, they were \"less conscious\". After all, our brain and consciousness evolved right? And our intelligence is clearly capable of things other organisms are not capable of.</p> <h1>Evolving within an \"n-dimensional energy soup\"</h1> <p>But have a look at <a href=\"https://youtu.be/OV9MnAZLmMQ?t=902\">this 1 minute video</a> (timestamp 15:02). It visualises the idea from John O'Keefe (he won the nobel prize in 2014):</p>  <p>John O’keefe, discoverer of place cells put it this way: let’s assume that the world is an n-dimensional energy soup. Animals on all levels of the evolutionary scale develop systems sensitive to various aspects of this soup; these become their version of reality. One evolutionary development led to a set of systems which divided the soup sharply into discrete objects and provided a spatial framework for containing these objects.</p> <p>In other words, arranging the world into What and Where and When, is our brain’s most efficient and meaningful way of carving nature at its joints. The fundamentality and primacy of space and time may stem from the fact that we have no alternative way of partitioning our experience. Many scientists are accepting the demise of spacetime as a fundamental entity.</p>  <p>Basically this means that the 3D reality we perceive is the result of a long evolutionary path within a multidimensional reality. It is a niche in that larger system.</p> <h1>Microbial consciousness as vastly more complex</h1> <p>This also has implications for the aforementioned assumed \"spectrum of consciousness\" that evolved from simple to more complex.</p> <p>For example, lets say microbes are conscious and exist in the \"n-dimensional energy soup\". They may experience the multidimensional reality and be absolute masters in navigating this vastly more complex world, interacting with other intelligences there, constructing habitats to survive in, etc. And of course this results in a radically different perception of time, since this is not taking place in spacetime as we know it.</p> <p>But from our human perspective, we just see them as organisms operating in a 3D reality, shuffling matter around. We do not see them build houses, computers, rockets to other planets, etc.</p> <p>It may be impossible for us to imagine, but it raises the question if the experience of the \"n-dimensional energy soup\" <a href=\"https://youtu.be/ubs6gwqr8m4?t=17\">could be something like this</a> (this is a reconstruction of what a human can experience when the brain is messed with)</p> <h1>Other implications</h1> <p>This also has other implications. For example earth (and stars and other planets) would not be actually round, but some other kind of structure within the n-dimensional energy soup. Consciousnesses evolved with this structure and some of them see it as a 3D object. The same goes for the entire universe</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/phr99\"> /u/phr99 </a> <br /> <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qflbk0/people_often_assume_consciousness_evolved_to/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qflbk0/people_often_assume_consciousness_evolved_to/\">[comments]</a></span>",
  "timestamp": 1768675620000,
  "source": "91280f3aa210",
  "category": ""
}