{
  "guid": "https://old.reddit.com/r/consciousness/comments/1qg5skf/i_dont_think_i_have_one/",
  "title": "<h1><a href=\"https://old.reddit.com/r/consciousness/comments/1qg5skf/i_dont_think_i_have_one/\" target=\"_blank\">I don’t think I have one</a></h1>",
  "link": "https://old.reddit.com/r/consciousness/comments/1qg5skf/i_dont_think_i_have_one/",
  "pubDate": "2026-01-18T11:00:19.000Z",
  "description": "<div><p>So a bit of background - I have TBI since 4-5 years old. Don’t remember much of my life before that if at all. I have some memories and I can memorize things or texts. However, the World doesn’t seem real. Everything looks like a dream. I feel like I go through life without being in control. Things just happen around me and I have a tough time trying to register them.</p> <p>Never had an inner voice or sense of self. People look at me like I’m still a kid. I have a feeling they hide something from me too. People’s eyes look weird sometimes and I can’t tell why. I’ve never felt the “consciousness field” people talk about. Even in my rare, brief moments of awareness where the world looks real.</p> <p>I generally have difficulty making decisions and look to others for their opinions to base my decisions on. From what to eat to where to go. Never had any self talk mostly owing to not being aware of my inner voice. It only appears when I’m reading or typing like right now.</p> <p>Moreover, I’m not even sure of what or who I am. What does “I” even mean. Trying to understand how humans are and what I’m missing out on.</p> <p>Edit:</p> <p>My therapist said something about not being able to connect on a higher level. My girlfriends in the past have said “talking to you is like talking to a wall”. I’ve heard people talk to me behind my back and refer to me as a “monkey”, “robot”, and be in disbelief that i could study and go through school and college</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/stonersun\"> /u/stonersun </a> <br /> <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qg5skf/i_dont_think_i_have_one/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/consciousness/comments/1qg5skf/i_dont_think_i_have_one/\">[comments]</a></span>",
  "timestamp": 1768734019000,
  "source": "91280f3aa210",
  "category": ""
}