{
  "guid": "https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/",
  "title": "<h1><a href=\"https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/\" target=\"_blank\">Vietnam - Disrupting The Tinder Scam Operation in Old Town Hanoi - Protecting Tourists & Keeping The Area Safe (Adventures in Organised Crime Disruption)</a></h1>",
  "link": "https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/",
  "pubDate": "2026-01-05T06:32:19.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/\"> <img src=\"https://b.thumbs.redditmedia.com/UtnHfH4VF2mpeUx4M_rDkAB5vWS2pgtQjKTgLBDPnoc.jpg\" alt=\"Vietnam - Disrupting The Tinder Scam Operation in Old Town Hanoi - Protecting Tourists &amp; Keeping The Area Safe (Adventures in Organised Crime Disruption)\" title=\"Vietnam - Disrupting The Tinder Scam Operation in Old Town Hanoi - Protecting Tourists &amp; Keeping The Area Safe (Adventures in Organised Crime Disruption)\" /> </a>  <div><p>It has become a minor obsession of mine and I have to stop before it becomes too dangerous. I was never the victim of the scam although one girl tried: as soon as I saw her I knew it wasn't right and bailed - but I became obsessed with it.</p> <p>Why? <em>I hate dishonesty</em>. I feel like the heterosexual dynamic has enough trust issues without a bunch of criminals setting up hundreds of fake Tinder accounts to lure men into dodgy scam clubs and restaurants. So I made a study of it: I have spent the last Fridays and Saturdays for the previous month warning victims, blocking the scams, pissing off the men running the scam, working with local cafes and businesses (only one was helpful), doing research.</p> <p>I want to share my findings and explain that this scam is easy to disrupt: one person can disrupt the entire operation quite easily - though it is best to work in a small group for safety.</p> <p>I also want to raise questions about why this scam, which according to the scam-business reviews on Google Maps, hasn't been stopped by the police.</p> <p><strong>Details of The Scam:</strong></p> <p>You already know it, everyone should know it, all the locals know it - it hardly needs explaining, it's posted about here every week. Yet nothing has been done for five years.</p> <p>Fake Tinder Profiles -&gt; a handler arranges a meeting place -&gt; random prostitute women meet the mark and take him do a rip-off restaurant and then a dangerous extorionate scammy club which has reviews accusing it of all sorts.</p> <p><strong>Details you may not know:</strong></p>  <li>Despite the hundreds of fake Tinder profiles, there are usually <strong>only around five women per night</strong> working the streets and actually scamming the men. For some reason they almost always all wear white, which makes them very very easy to spot.</li> <li>There are <strong>ONLY TWO BUSINESSES</strong> behind the scam which means it is easy to see, easy to block, easy to warn people: very easy for the police to shut-down if they wish.</li> <li>The scam is localised to, basically, a very small area of Old Town - a single police officer posted there would be able to stop the entire operation (as I, myself, have largely been able to do for the hours I have spend disrupting it)</li> <li>Based on my observations there are <strong>30-50 scam victims each nigh</strong>t, most will lose <strong>$100-200</strong>, so they're earning around $5k/night from this scam. Its been going on for years meaning that this is actually a substantial organised crime operation.</li> <li>The victims are just painfully normal men, usually very grateful to have been saved: usually aged 20-30, almost always white but sometimes Indian, never Vietnamese (meaning these constitute racially-motivated crimes, targettting ethnic minorities who visit Vietnam)</li> <li>Eventually the men who run the scam will try to stop you from interfering: at no point did it get violent because I always stayed calm - but certainly they tried to intimadate and escalate things - never fall for this (there are many of them, one of you, it would be suicide) - I just always stayed calm and when they questioned what I was doing I just said \"Protecting tourists from crime\" - they even tried to pay me off, obviously I refused.</li> <li>The men overseeing the operation in the street seem to be in their mid-20s, the mastermind is (I suspect) the person running the dodgy nightclub (since they're the ones taking most of the money from victims).</li> <li>When I questioned a local cafe as to why they don't just put signs up, or tell the police to stop it, the manager whispered to me in husghed tones: \"If we try to stop it the police will make trouble for us\" - however I have no direct evidence of police corruption so cannot take this to the anti-corruption officials in Vietnam.</li> <li>The fraudsters operate on Firdays &amp; Saturdays but the restaurant scam seems to operate pretty much every night of the week.</li>  <p><strong>Specifics:</strong></p> <p>The street on which the Tinder-scammer cockroach women meet is: P. Hàng Chĩnh, Hàng Buồm, Hoàn Kiếm, Hà Nội (<a href=\"https://maps.app.goo.gl/c7MUT57zTWHzFDzP6\">https://maps.app.goo.gl/c7MUT57zTWHzFDzP6</a>)</p> <p><a href=\"https://preview.redd.it/disrupting-the-tinder-scam-operation-in-old-town-hanoi-v0-dewhoyhj86bg1.png?width=976&amp;format=png&amp;auto=webp&amp;s=cd9fa0a93a07eca89e36701f45f92275086b6270\"></a></p> <p><a href=\"https://preview.redd.it/nnde6t546hbg1.png?width=976&amp;format=png&amp;auto=webp&amp;s=0fc57f896cb39974d1bfaa9c3f9ce1b99962f330\">SCAM-ZONE: Tourist's Beware!</a></p> <p>The two busineses I have observed the scammers take their victims to are as follows:</p> <ul> <li>A dodgy hotpot restautant: <a href=\"https://maps.app.goo.gl/kxru3PKoSoUAMQRt5\">https://maps.app.goo.gl/kxru3PKoSoUAMQRt5</a> (read the reviews)</li> <li>More seriously: the nightclub with the metal shutter (used to trap victims) on the corner, which seems to have changed its name to create ambiguity and avoid Google Map reviews. You can read reviews indicating both scamming and other criminal activities occuring with the following Google Map businesses: Fien -<a href=\"https://maps.app.goo.gl/djXkxJ6X3Lh1E2Zr5\">https://maps.app.goo.gl/djXkxJ6X3Lh1E2Zr5</a> &amp; The Bunker - <a href=\"https://maps.app.goo.gl/f8TpK2fqjxT2gSgT8\">https://maps.app.goo.gl/f8TpK2fqjxT2gSgT8</a></li> </ul> <p><a href=\"https://preview.redd.it/e7965rq56hbg1.jpg?width=1960&amp;format=pjpg&amp;auto=webp&amp;s=cd2ad16ebf8c5f8910b4c446b925fa5435721b54\">Scam Club: variously known as 'Fien' / The Bunker on Google Maps</a></p> <p>[Sort reviews by lowest first, you can see this scam has been operating for about 5 years now]</p> <p><a href=\"https://preview.redd.it/y24xwkjc6hbg1.png?width=980&amp;format=png&amp;auto=webp&amp;s=f725b5d4786b8c4e50e7b51eba3a6809ec789faa\">https://preview.redd.it/y24xwkjc6hbg1.png?width=980&amp;format=png&amp;auto=webp&amp;s=f725b5d4786b8c4e50e7b51eba3a6809ec789faa</a></p> <p><a href=\"https://preview.redd.it/disrupting-the-tinder-scam-operation-in-old-town-hanoi-v0-4obai2bi96bg1.jpg?width=1960&amp;format=pjpg&amp;auto=webp&amp;s=c9fb3e68fefb135982f128ae695192b6420411ea\"></a></p> <p><a href=\"https://preview.redd.it/disrupting-the-tinder-scam-operation-in-old-town-hanoi-v0-3tm4o52wa6bg1.png?width=980&amp;format=png&amp;auto=webp&amp;s=97f827e36c0507d46ad893a03a5f5adbda65898d\"></a></p> <p><strong>Why You Should Care:</strong></p> <ul> <li>The victims have not committed any crime, they do not deserve to be the victims of these crimes (even if you disagree with their lifestyle choices)</li> <li>The operation is illegal: it attempts to make money through deception and trickery - a violation of Vietnamese law</li> <li>Vast amounts of money are being illegally taken from tourists: nothing is being done to protect them.</li> <li>The club uses a metal shutter to trap scam-victims inside: this is highly illegal as it constitutes false-imprisonment, especially when coupled with their extortion practices.</li> <li>This has been going on for about five years, if we don't stop it it's going to just go on and on.</li> <li>We all have a duty to make travelling safe and to keep tourists safe</li> <li>Since this is a race-based crime: we also have a duty to protect people from being targetted by racially motivated crimes</li> <li>Many of the local businesses want the scamming stopped but feel powerless to do anything about it. A few of them thanked me for my efforts (I basically spent hours patrolling this aera to disrupt the operation)</li> <li>It's also incredibly fun and rewarding to do something so directly positive, it's a good use of time if you have nothing better to do.</li> <li>It's one of the biggest and most famous scams in Vietnam, run by two businesses, easily stopped by the police: so a group of about 20-30 people are doing massive reputational damage to Vietnam as a country and Hanoi as a city.</li> </ul> <p><strong>What I Did To Disrupt The Scam</strong></p>  <li>If white men or Indian guys seem to be waiting on the street, <strong>politely inform them that it is THE capital of the entire Tinder Scam operation</strong>, indicate the two businesses involved. 95% of the time they will make the wise decision and walk away (you'd be amazed that some don't listen and still volunteer to be scammed: utter morons)</li> <li>Spending time observing the scam: I quickly learned which women are the scammers and can <strong>casually walk up to the men walking with them and inform them \"this woman works for the restaurant and bar, you are being scammed\"</strong> and keep walking.</li> <li>If unsure I would simply politely ask the men \"Did you meet this woman here this evening from an online dating app?\" if they say \"no\" I would apologise for the interuption and explain why I brought it up. If yes, I would explain (saving another one!)</li> <li>If I saw them being taken inside \"Fein\" or \"The Bunker\" or whatever the place is called: I'd simply tell them to read the reviews, tell them they are being scammed, tell them the girl is tricking them.</li> <li>You can usually save at least ten men per hour, it's easy good karma, a fun use of your time if your bored. I encourage other tourists to try it for kicks and to doa good deed for a fellow traveller.</li>  <p>[Section redacted to protect the identity of the one local business owner who actitries to help me]</p> <p>Frankly, I am appalled at the inaction of the other local businesses. They all know that 30-50 men are being defrauded right outside their own businesses every night and have done NOTHING: no signs to warn people, no police action, nothing.</p> <p><strong>Results:</strong></p> <p>After an hour or two of my meddling: the scammers tend to pause operations because they know it's a waste of time. This means <strong>YOU CAN MAKE A REAL DIFFERENCE</strong> and if we organise we can permanently stop the entire operation.</p> <p>Many of the men I saved were so so incredibly grateful, they couldn't believe I was dedicating my time to such a simple goal of saving male tourists from being scammed, when they asked me why I was doing it I usually would just say \"because nobody else is\".</p> <p>In the last month I have prevented over 100 men from being scammed in that street, and warned many others about the scam loitering in the area.</p> <p>This is actually just two businesses. It isn't some massive operation: although the nightclub staff are numerous, amoral, and the operators of the scam eventually will try to intimidate you (but, basically, there's nothing they can actually do).</p> <p><strong>Questions:</strong></p> <p><strong>How can a clearly observable scam continue for five years without police action?</strong></p> <p><strong>How can Detective Nobody (me) 'crack the case' in one night of observation whilst the police, seemingly, are unaware of this organised crime operation?</strong></p> <p><strong>Why don't locals do something to stop the crime? (e.g. report it to the police, and then escalate it to anti-corruption officials?)</strong></p> </div>   submitted by   <a href=\"https://old.reddit.com/user/TheAstroidIsComing\"> /u/TheAstroidIsComing </a> <br /> <span><a href=\"https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/southeastasia/comments/1q4eea7/vietnam_disrupting_the_tinder_scam_operation_in/\">[comments]</a></span> ",
  "timestamp": 1767594739000,
  "source": "0590622abfef",
  "category": ""
}