{
  "guid": "https://old.reddit.com/r/southeastasia/comments/1o9adph/i_took_a_sketchbook_to_southeast_asia_a_few/",
  "title": "<h1><a href=\"https://old.reddit.com/r/southeastasia/comments/1o9adph/i_took_a_sketchbook_to_southeast_asia_a_few/\" target=\"_blank\">I took a sketchbook to Southeast Asia a few months ago.</a></h1>",
  "link": "https://old.reddit.com/r/southeastasia/comments/1o9adph/i_took_a_sketchbook_to_southeast_asia_a_few/",
  "pubDate": "2025-10-17T19:14:21.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/southeastasia/comments/1o9adph/i_took_a_sketchbook_to_southeast_asia_a_few/\"> <img src=\"https://b.thumbs.redditmedia.com/YFdT8KPra1gFQ78BJtytA71H-nzUvuNXUhiDIhViE6E.jpg\" alt=\"I took a sketchbook to Southeast Asia a few months ago.\" title=\"I took a sketchbook to Southeast Asia a few months ago.\" /> </a>  <div><p>I spent three days in Bangkok, three days in Chiang Mai, four days in Luang Prabang, four days in Siem Reap, and two in Singapore.</p> <p>I used to live in Thailand as a teacher and I have traveled around the area a lot but this was my boyfriend's first time in Asia so I wanted to show him the highlights. I really like where we ended up and hopefully these pictures bring up memories or inspiration.</p> <p>My highlights in each place were:</p> <p>Bangkok: canal boat tour on the other side of Chao Praya. This is where the Big Buddha is in the first picture (it was covered in scaffolding earlier this year but I think it's not anymore). This was a neat way to see a more residential area from a different perspective.</p> <p>Chiang Mai: cooking class! I've done a lot of cooking classes over the years but this time I chose Benny's Home Cooking because they have a specifically Northern Thai class where I could make khanom jeen nam ngiao, which is an amazing spicy soup with blood cakes. I've also done beginner classes with Thai Farm and Asia Scenic and they were great too.</p> <p>Luang Prabang: we spent a day at Mandalao walking with elephants which was pretty great. You basically walk with the elephants pretty slowly as they take random breaks and detours to go munch around in the forest. I found them on the World Animal Protection elephant-friendly tourist guide. </p> <p>Siem Reap: starting about a decade ago, Wildlife Alliance starter repopulating wild gibbons and Asian otters around Angkor and on this trip I was lucky enough to see both! There are now three generations of reintroduced gibbons and I got to see a couple with a baby high up in the trees at a small temple in Angkor Thom. I also saw a family of otters in the moat at Preah Khan, which is one of the sketches.</p> <p>Singapore: Really the highlight here was the food. We would stop into a random hawker center and see 2-3 Michelin recommended stalls. I ate so much.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/upsidedownbat\"> /u/upsidedownbat </a> <br /> <span><a href=\"https://www.reddit.com/gallery/1o9adph\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/southeastasia/comments/1o9adph/i_took_a_sketchbook_to_southeast_asia_a_few/\">[comments]</a></span> ",
  "timestamp": 1760728461000,
  "source": "0590622abfef",
  "category": ""
}