{
  "guid": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1ieyizq/my_therapist_is_a_zionist_and_i_dont_know_how_to/",
  "title": "<h1><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ieyizq/my_therapist_is_a_zionist_and_i_dont_know_how_to/\" target=\"_blank\">My Therapist is a Zionist and I don't know how to feel about it. Friends think I should compartmentalize.</a></h1>",
  "link": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1ieyizq/my_therapist_is_a_zionist_and_i_dont_know_how_to/",
  "pubDate": "2025-02-01T04:35:00.000Z",
  "description": "<div><p>During my recent therapy session, I discovered that my therapist is from Israel and is pro-Israel. She also does not believe that what is happening in Gaza qualifies as genocide, describing the term as <em>“tricky.”</em> She also mentioned that she watches Israeli news daily with her family.</p> <p>I expressed to her that I see it as a genocide and that her perspective makes me deeply uncomfortable. I told her that I believe all human life is valuable, regardless of nationality or background. She responded that she agrees that all life is valuable especially innocent life and believes everyone deserves basic respect and dignity. In an effort to drive this point across she took a couple minutes to rant about how terrible and wrong drunk driving is. However, given her stance, I struggle to reconcile how much she truly means that, as she appears to support a military campaign that I view as fascist and genocidal against civilians.</p> <p>Despite this, I don’t want to lose her as my therapist. She is the most skilled and well-trained therapist I’ve worked with, particularly in trauma healing, and I genuinely believe she can help me. Over the past several sessions, she has worked to build my trust and create a space where I feel seen, heard, and comfortable. That has been incredibly meaningful to me. In every other aspect, we get along well—this is the only issue that stands between us.</p> <p>I don’t know how to process this. When she admitted she was pro-Israel, I nearly had a panic attack. It was incredibly difficult for me to confront her, and I could tell she preferred to avoid the conversation, but I brought it up anyway. She even acknowledged how hard that must have been for me and commended me for standing up for what I believe in.</p> <p>Now, I find myself grappling with this internal conflict. I want to continue working with her, but I’m struggling with what I now know about her beliefs. I’m not sure how to move forward. What do you think?</p> <p>Edit: </p> <p>After reading all the comments and thinking about it, I'm starting to look for a new therapist. It turns out there are other therapists in my area who claim to have similar skill sets. Ill start reaching out to interview them soon and postpone my next session in the meantime. I have absolutely no one in my life to turn to for advice or help with emotional processing so if im in crisis id rather have access to a therapist within a few days than not. </p> <p>I think my trust with her has been broken and I keep hearing that trust is manadatory in therapy. If Im going to heal the right way I want to feel completely safe with my therapist. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/ImagineWagonzzz3\"> /u/ImagineWagonzzz3 </a> <br /> <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ieyizq/my_therapist_is_a_zionist_and_i_dont_know_how_to/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ieyizq/my_therapist_is_a_zionist_and_i_dont_know_how_to/\">[comments]</a></span>",
  "timestamp": 1738384500000,
  "source": "93d78b7a2c14",
  "category": ""
}