{
  "guid": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1ltevv9/every_mental_health_worker_i_talked_to_besides/",
  "title": "<h1><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ltevv9/every_mental_health_worker_i_talked_to_besides/\" target=\"_blank\">Every mental health worker i talked to (besides one) got angry and defensive when i bring up socialist values or complain about social inequality, fascism, classism, racism etc.</a></h1>",
  "link": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1ltevv9/every_mental_health_worker_i_talked_to_besides/",
  "pubDate": "2025-07-06T23:10:21.000Z",
  "description": "<div><p>Most mental health workers (especially in big institutions) operate inside systems that exist to maintain social order, are tied into state structures, depend on funding from governments, health services, insurance and are dominated by middle class professionals whose own comfort relies on the status quo so when i complain i'm not just venting personal feelings. I'm critiquing The very system they work for, the social order that legitimizes their jobs, their own identities as “good, professional people”. That’s why they get pissed. You’re challenging the ground under their feet.</p> <p>Therapy is political, whether they admit it or not. </p> <ul> <li><p>Who gets diagnosed is political.</p></li> <li><p>Who gets detained is political.</p></li> <li><p>Who gets believed is political.</p></li> <li><p>What “healthy” looks like is political.</p></li> <li><p>Which emotions are acceptable is political</p></li> </ul> <p>Telling someone “Your anxiety is just faulty thinking\" while ignoring Poverty, Racism, Police violence, Workplace exploitation, Housing insecurity is political silence. It’s choosing to uphold the system.</p> <p>“Detached/Neutrality” often means siding with whoever holds power, silencing victims, pathologizing resistance. </p> <p>It’s not just professional. It’s personal. Most therapists are middle class or upper/middle class. Their families benefited from the same social structures you’re criticizing, they’ve often never felt the consequences of systemic oppression, they built their identities around “I’m a helper, I’m a good person.” </p> <p>Our socialism or critique of inequality forces them to face their privilege, threatens their sense of being “one of the good ones\". Makes them feel personally implicated so they either shut you down, get defensive, redirect you back to your “personal issues\".</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/leon385\"> /u/leon385 </a> <br /> <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ltevv9/every_mental_health_worker_i_talked_to_besides/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1ltevv9/every_mental_health_worker_i_talked_to_besides/\">[comments]</a></span>",
  "timestamp": 1751843421000,
  "source": "93d78b7a2c14",
  "category": ""
}