{
  "guid": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1j21bvc/this_sub_is_a_breath_of_fresh_air_considering_all/",
  "title": "<h1><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1j21bvc/this_sub_is_a_breath_of_fresh_air_considering_all/\" target=\"_blank\">This sub is a breath of fresh air considering all other mental health workers operate on the premise of the \"Just world fallacy\", trying to get you to accept the status quo, conform etc.</a></h1>",
  "link": "https://old.reddit.com/r/PsychotherapyLeftists/comments/1j21bvc/this_sub_is_a_breath_of_fresh_air_considering_all/",
  "pubDate": "2025-03-02T21:01:18.000Z",
  "description": "<div><p>Most mainstream mental health spaces are built around reinforcing the system rather than questioning it. They assume the world is fair (or at least \"the best we can do\"), so if you're struggling, the problem must be you—not the system. Therapy, in that framework, becomes about adjusting you to fit into an unjust world, rather than validating your experiences or helping you resist harmful structures.</p> <p>That's why spaces like this are needed. They acknowledge that a lot of distress comes from oppression, systemic issues, and real injustices—not just from personal failings or \"cognitive distortions.\" Instead of gaslighting people into accepting their suffering as inevitable, they recognize that rage, grief, and alienation are normal reactions to a broken world.</p> <p>It’s no wonder i feel more at home here than in traditional therapy as a neurodivergent, bisexual, working class POC where the focus is often on making you tolerate things that should be unacceptable.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/leon385\"> /u/leon385 </a> <br /> <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1j21bvc/this_sub_is_a_breath_of_fresh_air_considering_all/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/PsychotherapyLeftists/comments/1j21bvc/this_sub_is_a_breath_of_fresh_air_considering_all/\">[comments]</a></span>",
  "timestamp": 1740949278000,
  "source": "93d78b7a2c14",
  "category": ""
}