{
  "guid": "https://old.reddit.com/r/FacebookAds/comments/1ptebpa/everyone_said_test_more_creative_i_did_the/",
  "title": "<h1><a href=\"https://old.reddit.com/r/FacebookAds/comments/1ptebpa/everyone_said_test_more_creative_i_did_the/\" target=\"_blank\">Everyone said 'test more creative.' I did the opposite and went from 0.75 ROAS to 2.5 ROAS in 5 days</a></h1>",
  "link": "https://old.reddit.com/r/FacebookAds/comments/1ptebpa/everyone_said_test_more_creative_i_did_the/",
  "pubDate": "2025-12-22T23:26:55.000Z",
  "description": "<div><p><strong>TL;DR: My profitable ad account collapsed from 1.38 ROAS to 0.75 ROAS overnight when I added new ads. Spent 30 days and $18k trying to \"fix\" it by testing more creative, changing budgets, and restructuring campaigns. Nothing worked. Finally did a full account reset with ONLY my original proven ad - recovered to 2.5 ROAS in 5 days with ZERO new creative. The problem wasn't my ads. It was how Facebook's algorithm allocates budget.</strong></p> <p>I run a supplement brand. CBO, Advantage+ audiences.</p> <p>October: $13k spend, 1.14 ROAS, $53 CPA</p> <p>I had one ad that had been running profitably for 2.5 months straight. Let's call it Ad A. This ad was getting most of the spend and delivering consistent $43 CPA and 1.38 ROAS. Nothing else I posted was outperforming it - I was posting new concepts through the 3-2-2 structure (each concept its adset with 3 hook variations) every week, mostly UGC with voiceover, but also some other formats. Ad A just kept winning.</p> <p>November 1-17: $9k spend, 1.35 ROAS, $48 CPA</p> <p>I consolidated my account structure - instead of 10 new concepts per week each in separate adsets, I started batching 15 ads into single adsets. Performance actually improved slightly. Ad A still getting majority of spend, still performing well at $43 CPA. But there were other ads that emerged and did well.</p> <p>November 17th - The day everything broke:</p> <p>I had my best day of that month. 24-26 purchases at $40 CPA. That same day, I posted a new batch of 6 ads (Batch 4).</p> <p>One ad from that batch - call it Ad B - immediately started eating budget. Within 10 hours, Ad B was getting 50-70% of my daily budget.</p> <p>Here's what's insane:</p> <p>Ad B metrics(from the moment I turned it on till I killed it):</p> <ul> <li>Hook rate: 44%</li> <li>Hold rate: 1.89%</li> <li>Video views: 55k</li> <li>Total spend: $2,500</li> <li>CPA: $68</li> <li>ROAS: 0.85</li> </ul> <p>Meanwhile, Ad A (my proven winner) suddenly collapsed:</p> <ul> <li>Before Nov 17: $16k lifetime spend at $43 CPA, 1.38 ROAS</li> <li>After Nov 17: Next $4k spent at $80 CPA, 0.66 ROAS</li> </ul> <p>Same ad. Same script. Didn't change anything. It just suddenly \"stopped working.\"</p> <p>November 18 - December 16 (my panic phase):</p> <p>I tried everything:</p> <ul> <li>Turned Ad B off → still bad</li> <li>Turned Ad B back on → still bad</li> <li>Added ABO campaign and force spend in proven historic winners, still bad</li> <li>Added more CBOs (promo CBO for BFCM)</li> <li>Increased budget to $900/day trying to push through, then decreased, increased again</li> <li>Decreased budget to limit bleeding</li> </ul> <p>Results:</p> <ul> <li>Nov 18-30: $11k spend, 0.92 ROAS, $72 CPA</li> <li>Dec 1-16: $7k spend, 0.75 ROAS, $87 CPA</li> </ul> <p>Every change I made seemed to make it worse. I was losing about $25 on every purchase.</p> <p>December 16 - The nuclear option:</p> <p>I paused everything. Complete stop for 24 hours.</p> <p>December 17, I launched a completely fresh adset with only 10 ads inside, in my historic CBO (been running that for 1 year and has over 100k$ in spent): it had an iteration of that AdA but with better content, some statics, and other videos. So only 10 ads running in the ad account</p> <p>December 17-22 results(after the reset:</p> <p><strong>Day 1:</strong> $318 spend, <strong>11 purchases</strong>, $28.91 CPA, <strong>2.50 ROAS</strong><br /> <strong>Day 2:</strong> $326 spend, <strong>6 purchases</strong>, $54.33 CPA, <strong>1.22 ROAS</strong><br /> <strong>Day 3:</strong> $275 spend, <strong>4 purchases</strong>, $68.75 CPA, <strong>0.81 ROAS</strong> <em>(weak day, fb put budget on random statics)</em><br /> <strong>Day 4:</strong> $365 spend, <strong>13 purchases</strong>, $28.10 CPA, <strong>1.72 ROAS</strong><br /> <strong>Day 5:</strong> $488 spend, <strong>17 purchases</strong>, $28.71 CPA, <strong>1.90 ROAS</strong><br /> <strong>Day 6:</strong> $550 spend, <strong>17 purchases</strong>, $32.35 CPA, <strong>1.71 ROAS</strong><br /> <strong>Day 7:</strong> $656 spend, <strong>20 purchases</strong>, $32.80 CPA, <strong>1.97 ROAS</strong> </p> <p>88 conversions in 7 days. Zero new creative. This winner ad was in november, it was when the ad account was bleeding, and it also got tested in abo and didn't perform</p> <p>Here's what I think happened:</p> <p>Ad B had way better engagement metrics than Ad A (44% hook rate vs 41%, and 1.89% hold rate vs 0.74%). When Ad B launched on November 17, Facebook's algorithm saw those engagement numbers and decided to test it heavily on the best-performing audiences that Ad A had been converting.</p> <p>But Ad B didn't convert those audiences well ($68 CPA). Meanwhile, Ad A got pushed to lower-quality audiences and its performance tanked ($80 CPA).</p> <p>The algorithm was optimizing for engagement (views, hold rate, clicks) not conversions. So it kept spending on the ad people were watching, not the ad people were buying from.</p> <p>When I removed all the other ads in December and forced Facebook to spend only on the proven concept alongside som new ads we did, it had to find the right audiences again. And it did. Performance came back immediately.</p> <p>What's wild is the performance trend since the reset:</p> <p>Not only did it recover to the 1.38 ROAS baseline - it's actually improving.</p> <p>I spent $18k from mid-November to mid-December learning that Facebook will happily burn your budget on high-engagement ads that don't convert, while ignoring your proven winners.</p> <p>The lesson: High engagement ≠ high conversions. Facebook can't tell the difference in the first 12 hours when it's allocating budget. By the time actual conversion data comes in, it's already committed most of your spend to the wrong ad.</p> <p>Has anyone else dealt with this? How do you test new creative without killing your proven winners?</p> <h1>QUESTIONS I'M STILL WRESTLING WITH:</h1>  <li><strong>How do you scale when you only have 1-2 proven ads?</strong> Do you test new concepts in parallel campaigns? Risk merging them?</li> <li><strong>Is there a way to TELL Facebook \"ignore engagement, optimize for revenue\"?</strong> Or is the algorithm fundamentally biased toward engagement?</li> <li><strong>Has anyone else experienced this \"audience cannibalization\" phenomenon?</strong> Where a new ad kills a proven ad's performance by stealing its audiences?</li> <li><strong>What's the right account structure for Advantage+ CBO?</strong> Everything I read says \"throw 10 ads in a campaign, let algorithm pick winners.\" My experience says that's exactly how you destroy your account.</li>  <h1>THE NUMBERS SUMMARY:</h1>   Period Spend ROAS CPA Notes    October $13k 1.14 $53 Baseline (chaotic but profitable)   Nov 1-17 $9k 1.35 $48 Improved after consolidation   Nov 18-30 $11k 0.92 $72 Collapsed after Ad B launch   Dec 1-16 $7k 0.75 $87 Death spiral (panic changes)   Dec 17-22 $2.1k 1.4-2.5 $23-39 Recovered with clean reset   <p><strong>Total November-December damage: ~$18k spent at bad ROAS, lost ~$8k.</strong></p> <p><strong>Current state: 2.5 ROAS at $500/day, ready to scale in January.</strong></p> <p><strong>Anyone else dealt with this? Am I crazy or is Facebook's algorithm fundamentally broken when it comes to choosing which ads to spend on?</strong></p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Wooden-Principle7582\"> /u/Wooden-Principle7582 </a> <br /> <span><a href=\"https://old.reddit.com/r/FacebookAds/comments/1ptebpa/everyone_said_test_more_creative_i_did_the/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/FacebookAds/comments/1ptebpa/everyone_said_test_more_creative_i_did_the/\">[comments]</a></span>",
  "timestamp": 1766446015000,
  "source": "9b633bb65108",
  "category": ""
}