{
  "guid": "https://old.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/",
  "title": "<h1><a href=\"https://old.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/\" target=\"_blank\">How I’m trying to build and maintain a “rainy day” fund as a freelancer</a></h1>",
  "link": "https://old.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/",
  "pubDate": "2026-01-14T17:09:15.000Z",
  "description": "<div><p>I do a mix of photography and digital art, so my income is all over the place. Some months are stacked with shoots, edits, and commissions. Other months it’s quiet in a way that makes you question every life choice.<br /> Now I'm treating the rainy day fund less like a savings goal and more like part of the workflow.<br /> When a payment comes in, I move a small percentage out immediately, even if it feels almost pointless on slower months. On good months, I don’t get aggressive or try to “catch up,” I just keep the same rule and let the volume do the work. That way I’m not making emotional decisions based on how busy I feel that week.<br /> I also stopped framing it as money I’m not allowed to touch. It’s there for exactly the stuff that always happens as a freelancer. A client pushing a payment. A camera repair. A dry couple of weeks. If I dip into it, the only rule is that I slowly rebuild it once things pick back up, no guilt spiral attached. It’s still imperfect, but it’s the first system that doesn’t fall apart the second my schedule does. For context, I keep the rainy day money in the same place my freelance income lands. I use karat, but the main thing is just keeping it out of my personal spending flow.</p> <p>Would love to hear how other freelancers here handle their rainy day fund, especially if your work swings between creative and digital like mine.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Historical_Bug_6870\"> /u/Historical_Bug_6870 </a> <br /> <span><a href=\"https://old.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/freelance/comments/1qcsxvv/how_im_trying_to_build_and_maintain_a_rainy_day/\">[comments]</a></span>",
  "timestamp": 1768410555000,
  "source": "2e678c3ee65f",
  "category": ""
}