{
  "guid": "https://old.reddit.com/r/attachment_theory/comments/1mlqegu/this_is_what_happens_when_your_fa_ex_comes_back/",
  "title": "<h1><a href=\"https://old.reddit.com/r/attachment_theory/comments/1mlqegu/this_is_what_happens_when_your_fa_ex_comes_back/\" target=\"_blank\">This is what happens when your FA ex comes back</a></h1>",
  "link": "https://old.reddit.com/r/attachment_theory/comments/1mlqegu/this_is_what_happens_when_your_fa_ex_comes_back/",
  "pubDate": "2025-08-09T14:11:29.000Z",
  "description": "<div><p>This is my personal experience for those who are curious. Of course everyone will be different but I thought it might help those who are waiting or wishing (APs I'm talking mostly to you)</p> <p>Firstly the background. We met 3 years ago and then an official relationship a year after meeting. Things started off really strong. Could talk for 5+ hours until the early hours and made eachother laugh. I had never met anyone as compatible as him in terms of our chemistry. Our sexual chemistry was also off the charts and we fell in love. He told me I was the perfect fit for him and that he was lucky and grateful to have met someone like me. We talked about the future and getting married, kids etc. </p> <p>No avoidant tendencies at all in the first 3 months but I could see the anxious tendencies. He'd get worried and call me multiple times in a row or get jealous. After 4 months we started to have arguments and that's when I noticed some deactivation and distancing after each argument. He'd have an issue about something but then would keep it to himself to keep the peace, then if I brought up an issue, all of a sudden he'd dump a laundry list of issues he had kept to himself and the argument then would spiral and become draining. He'd then withdraw, sometimes for days. </p> <p>By 6 months he started to withdraw from intimacy/affection and my anxous rejection wounds would be triggered. We'd have some good weeks that would give me hope, and then we'd have a spiralling argument that left us feeling disconnected again. He would \"test me\" with a breakup and then if I accepted it, got upset. I realised he wanted me to fight for him. The deactivation would get worse until I eventually left after a year because I couldn't take it anymore. </p> <p>2 weeks later, I sent a nice closure message to wish him well because I felt bad about leaving things on bad terms. He reached out and we talked again for hours like we had in the beginning. We \"got back together\" but unofficially. It was quite unstable though from all the previous hurt and we broke up again about 3 months later after a jealousy/betrayal spiral. </p> <p>A week later he reached out to send me a gift that he had gotten me while we were together. The gift was very personal and sweet and we reconnected again. Unfortunately a stressful and traumatic event meant I was feeling quite depressed and I needed his support. He was never good at dealing with heavy emotions and would try to cheer me up with jokes that felt insensitive for the situation. I understood what he was trying to do, but it just wasn't what I needed. I wanted him to just listen and be empathetic. His shame wounds were triggered and lead to an argument where he claimed he couldn't meet my needs and I agreed. It had been 4 months and we broke up again. </p> <p>6 weeks later, he reached out after I thanked him for returning an item. He said this time he wanted to try again in an official relationship and that he didn't want to lose me, that we were meant to be together. This time with real change. We tried again for 8 months with individual therapy and couples therapy. There were definitely improvements, he was distancing less and regulating himself more but he had only just became aware of his attachment style and had only just started working on himself. His shame wounds kept getting triggered in therapy and he kept a lot of things to himself which lead to blow ups and then deactivation. My AP wounds got triggered and made the situation worse when he distanced. Eventually after another argument he said we weren't working and he couldn't see us ever being able to work long term and we broke up for the final time. </p> <p>So there you have it. Even if they want to come back, if they haven’t done serious and long term work on their attachment, don't expect things to change. The pattern will repeat and things will end. If I had accepted the first breakup, I could have moved on by now. </p> <p>I have learned a lot though and I do love him despite it all. I don't blame him and he will always have a special place in my heart. I have my own wounds to heal so it's my responsibility too, not just his. </p> <p>I noticed that there was a very distinct pattern. Honeymoon period and anxiousness for the first 4 months, then the start of deactivation, and by 6 months intimacy and affection had decreased. By the time he started deactivating there was basically no hope for us to improve because he'd be silently listing all the reasons we couldn't work. It wasnt until after a breakup that the deactivation would end and he'd want me again. Well, I guess for future, I'll know for the signs to look out for and I hope it helps for those who might be considering reunion. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/momentsnotmilestones\"> /u/momentsnotmilestones </a> <br /> <span><a href=\"https://old.reddit.com/r/attachment_theory/comments/1mlqegu/this_is_what_happens_when_your_fa_ex_comes_back/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/attachment_theory/comments/1mlqegu/this_is_what_happens_when_your_fa_ex_comes_back/\">[comments]</a></span>",
  "timestamp": 1754748689000,
  "source": "5d86c91d277b",
  "category": ""
}