{
  "guid": "https://old.reddit.com/r/attachment_theory/comments/1jr7lft/the_and_theory/",
  "title": "<h1><a href=\"https://old.reddit.com/r/attachment_theory/comments/1jr7lft/the_and_theory/\" target=\"_blank\">The \"and\" theory...</a></h1>",
  "link": "https://old.reddit.com/r/attachment_theory/comments/1jr7lft/the_and_theory/",
  "pubDate": "2025-04-04T09:13:34.000Z",
  "description": "<div><p>I saw this a few days ago and started to implement it, I can't tell you how much it has allowed me to have more compassion for myself, create a clearer head and process my emotions.</p> <p>The and theory is really simple, you can have 2 conflicting emotions and thoughts at the same time, so for me, I've been using the following....</p> <p>\"I can miss her and the memories we created AND know that she isn't right for me.\"</p> <p>\"I can be angry at the complete lack of closure and the horrible way she treated me AND understand this is to do with her and her wounds / maladaptive coping strategies\"</p> <p>\"I can feel upset at the rebound AND understand the relationship was so broken it could never work out\".</p> <p>If you find yourself stuck in a loop, ruminating and experiencing cognitive dissonance, then give yourself the grace to know that all your emotions are valid.</p> <p>But using this approach had allowed me to accept it is over. Every memory I have drawing me back in, I now add an AND to that thought to remind me of why I should never go back, break no contact and consider reconciliation if the opportunity ever arose.</p> <p>Toxic people are toxic. A lot of the times through no faily of their own, they just have incredibly unhealthy coping mechanisms. BUT, as an adult, whatever trauma they've been through, it IS their responsibility to change these strategies.</p> <p>Your worth is not tied to one person who continually disrespects you. Stonewalls you. Emotionally abuses you.</p> <p>If you don't recognise who you have, or, are becoming in a relationship, then trust me, they are not the one.</p> <p>Try the 'AND' method to reprogram every thought that comes in wanting to go back, to also include a reason you shouldn't.</p> <p>It's very simple, but has been incredibly effective for me.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Opposite-Tangelo136\"> /u/Opposite-Tangelo136 </a> <br /> <span><a href=\"https://old.reddit.com/r/attachment_theory/comments/1jr7lft/the_and_theory/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/attachment_theory/comments/1jr7lft/the_and_theory/\">[comments]</a></span>",
  "timestamp": 1743758014000,
  "source": "5d86c91d277b",
  "category": ""
}