{
  "guid": "https://old.reddit.com/r/ObsidianMD/comments/1pyjqfl/notebook_navigator_20_for_obsidian_is_out_now/",
  "title": "<h1><a href=\"https://old.reddit.com/r/ObsidianMD/comments/1pyjqfl/notebook_navigator_20_for_obsidian_is_out_now/\" target=\"_blank\">Notebook Navigator 2.0 for Obsidian is out now!</a></h1>",
  "link": "https://old.reddit.com/r/ObsidianMD/comments/1pyjqfl/notebook_navigator_20_for_obsidian_is_out_now/",
  "pubDate": "2025-12-29T11:14:16.000Z",
  "description": "  <a href=\"https://old.reddit.com/r/ObsidianMD/comments/1pyjqfl/notebook_navigator_20_for_obsidian_is_out_now/\"> <img src=\"https://preview.redd.it/2j6qzn92l4ag1.png?width=640&amp;crop=smart&amp;auto=webp&amp;s=cf1823c406254807e19a540c6d09d02dee75f694\" alt=\"Notebook Navigator 2.0 for Obsidian is out now!\" title=\"Notebook Navigator 2.0 for Obsidian is out now!\" /> </a>  <div><p><strong>Notebook Navigator 2.0</strong> is here and there are so many new features!</p> <p>First off: <strong>Notebook Navigator now automatically creates thumbnails for all your notes</strong> and saves them to the metadata cache database for super fast scrolling! 🎉 If enabled, Notebook Navigator will now also download external images and YouTube thumbnails for feature images!</p> <p>We also have <strong>Templater support!</strong> You can now create new notes from templates directly in the navigation pane or in the current folder / tag using the new command!</p> <p>Also there are lots of other improvements in this release like a new <strong>visual editor for file icons</strong> and the option to <strong>change all user interface icons</strong>!</p> <p>Happy new year! 🎉</p> <h1>New</h1> <ul> <li>Notebook Navigator will now <strong>automatically create thumbnails for all your notes</strong> and store them in the metadata cache database for super fast scrolling in the list pane! You no longer need the plugin <strong>Featured Image</strong> installed! You can still use a custom property for feature image if you want, otherwise the first image, external link or Youtube thumbnail in each document will be used.</li> <li>New setting: <strong>Notes &gt; Appearance &gt; Download external images</strong>. If enabled, Notebook Navigator will download external images and YouTube thumbnails to use as feature images in the list pane. Default enabled.</li> <li>New setting: <strong>General &gt; Icons &gt; Interface icons</strong>. You can now customize all icons used in the Notebook Navigator interface, like pinned section icon, shortcuts icon, recent notes icon, folder expand/collapse icons, all toolbar buttons, and more.</li> <li><strong>File name icons and file type icons can now be edited with a new visual editor</strong>. Just click the new <strong>edit button</strong> next to each text field in Settings &gt; Notes &gt; Icons.</li> <li><strong>You can now use icons from icon packs for file name icons and file type icons</strong>.</li> <li>New menu command: <strong>New file from template</strong>. If you have the plugin <strong>Templater</strong> installed you can now create new notes with templates directly from the navigation pane!</li> <li>New command: <strong>Create new note from template</strong>. If you have the plugin <strong>Templater</strong> installed you can now create a new note with template in the current folder or tag.</li> <li>New commands: <strong>Open shortcut 1-9</strong>. Use this to quickly open your shortcut files, navigate to folders/tags, or load a custom search filter. Tip: Bind them to CMD+1 etc for quick file and folder access!</li> <li>New setting: Navigation pane &gt; Shortcuts &amp; recent items &gt; <strong>Shortcut badge</strong>. You can now choose to show index number (1-9) to help with shortcut commands, show item count or show no badge next to shortcuts. Default is index (1-9).</li> <li>New setting: General &gt; Behavior &gt; <strong>Single pane animation</strong>. You can now customize the new animation speed when switching between navigation pane and list pane.</li> <li>New theme variable: <strong>--nn-theme-mobile-bg</strong> to change mobile background color. Set it in Style settings or through themes / CSS.</li> </ul> <h1>Improved</h1> <ul> <li><strong>Links to external images and YouTube videos now show as feature images</strong> in the list pane, as long as you prefix them with !.</li> <li><strong>PDF files and inline PDF documents such as ![[mydocument.pdf]] now show the first page as a feature image</strong> in the list pane.</li> <li><strong>Excalidraw drawings now show as feature images</strong> in the list pane.</li> <li><strong>Significantly improved scrolling performance</strong> since all feature images are now rendered from thumbnails with a fast LRU memory cache.</li> <li>Switching between navigation pane and list pane on desktop in single pane mode <strong>is now animated</strong>.</li> <li>On iOS devices you can now swipe anywhere to go from the list pane to navigation pane, this matches Obsidian default behavior.</li> <li>You can now use spaces in file icon mappings, e.g. 'ai ' to prevent matching titles like 'mail'.</li> <li>Improved toolbar button layout on all Android devices and iOS devices running Obsidian 1.10 and earlier.</li> <li>Notebook Navigator is now fully compatible with Obsidian 1.11 and later, including the new Liquid Glass theme style.</li> </ul> <h1>Changed</h1> <ul> <li>The setting <strong>List pane &gt; Appearance &gt; Optimize note height</strong> no longer decreases vertical height for notes with feature images.</li> <li>Removed the \"Reset\" button next to the file name and file icon mapping text fields to avoid removing mappings by accident.</li> <li>Removed the theming variable --nn-theme-mobile-toolbar-border-color since it is no longer used.</li> <li>Removed the theming variable --nn-style-pinned-section-icon. Use General &gt; Icons &gt; Interface icons to change the pinned icon.</li> <li>Updated the Notebook Navigator licensing agreement. Developers can no longer submit forks of Notebook Navigator to the Obsidian community plugins list without my permission.</li> </ul> <h1>Fixed</h1> <ul> <li>Fixed vertical text alignment in tag pills for certain fonts by adding explicit line-height.</li> <li>Fixed \"New Tldraw drawing\" failing after a Tldraw plugin update.</li> <li>You can now collapse and expand the Tags virtual folder with the keyboard.</li> </ul> </div>   submitted by   <a href=\"https://old.reddit.com/user/jsann\"> /u/jsann </a> <br /> <span><a href=\"https://i.redd.it/2j6qzn92l4ag1.png\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/ObsidianMD/comments/1pyjqfl/notebook_navigator_20_for_obsidian_is_out_now/\">[comments]</a></span> ",
  "timestamp": 1767006856000,
  "source": "146b79161cbf",
  "category": ""
}