{
  "guid": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1nc8jw6/my_girlfriend_and_i_experienced_something_very/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1nc8jw6/my_girlfriend_and_i_experienced_something_very/\" target=\"_blank\">My girlfriend and I experienced something very very strange tonight</a></h1>",
  "link": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1nc8jw6/my_girlfriend_and_i_experienced_something_very/",
  "pubDate": "2025-09-09T03:35:33.000Z",
  "description": "<div><p>So we’re just on the couch, watching masterchef, like usual. She’d taken her medication so I knew she was probably going to go to bed soon. After the episode, she did her usual door checks to make sure everything was locked and stuff (she can’t go to bed without making sure everything is shut/locked ie windows, doors, all that) and then I followed her to the bedroom to lay with her for a little bit while she fell asleep. Not 15 seconds into laying there with her, we hear absolutely clear as day, this clacking sound coming from my kitchen. It was LOUD. I could hear it with my bedroom door closed. It honestly sounded like something with some real weight was walking around my kitchen. So I lock my bedroom door she calls her friend, and we just hear this….thing walking around my house. After 2-3 minutes it just stops. I tentatively go out of the bedroom, look around my entire house…. Empty. Door is locked. Every window shut. I have no clue what happened, but that was the strangest thing I have ever experienced in my life.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/CryptographerHot6198\"> /u/CryptographerHot6198 </a> <br /> <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1nc8jw6/my_girlfriend_and_i_experienced_something_very/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1nc8jw6/my_girlfriend_and_i_experienced_something_very/\">[comments]</a></span>",
  "timestamp": 1757388933000,
  "source": "4d28d3b10b32",
  "category": ""
}