{
  "guid": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1lwzsfe/second_daughter_disappeared/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1lwzsfe/second_daughter_disappeared/\" target=\"_blank\">Second daughter disappeared</a></h1>",
  "link": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1lwzsfe/second_daughter_disappeared/",
  "pubDate": "2025-07-11T06:31:31.000Z",
  "description": "<div><p>So I have a second cousin, who has been married to his wife for about 20 years. About seven years ago, I went to a family reunion that he, his wife and their two daughters were at. At one point I was watching all of the kids, including my own. His daughters names were Hannah and Hailey. I spent time with those girls I took them fishing. My daughter remembers both of them, because she was the older cousin. About two years later, I saw a post on Facebook That they had taken Hannah to Disney World. I was confused because I was like where is Hailey? I have seen and have taken pictures of her. My daughter remembers her. They posted lots of other posts where they were doing stuff with Hannah. So naturally,I asked about Hailey And they both stated that they did not have a daughter named Hailey. I remember having a conversation with my cousin’s wife about the spelling of their daughters name. So I went back into my Google photos to see if I could find pictures of Hailey and she was not there. My daughter had pictures of her in her phone as well, and she was freaked out because they were gone. Like the pictures were still there but Hailey was not in them. No one else in the family remembers her. Even though some of the pictures were of aunts and uncles and cousins with her. It’s like somebody photo shopped her out of all the pictures. I am so confused like what happened to her? How does this child not exist that I remember fishing with. I even asked multiple family members if they knew any child named Hailey, Because I thought well maybe she was somebody else’s kid? No one knows who she is And even my mom states that she does not remember that name. WTH?</p> <p>Edit:To answer some questions. I noticed this About 5 years ago. I did do a deep dive into it. I googled things and people involved. I found other girls with the same name but none of them were her. I went through old photos. I was convinced something had happened to her and no one wanted to talk about it. I asked so many other cousins, uncles, aunts and Haileys grandparents. My daughter had taken a bunch of selfies with her cousins, as they had camped out a couple of nights in the same tent. She was gone from all the pictures even the one I had had of her and my great aunt of just the 2 of them. My daughter was 14 at the time. My son was 11 and he doesn't remember Hailey either. The girl's dad does in fact boil fish. My cousins wife did have multiple miscarriages after Hannah and thats why she said they only have the one child. Maybe she was a ghost? </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/varelalady\"> /u/varelalady </a> <br /> <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1lwzsfe/second_daughter_disappeared/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1lwzsfe/second_daughter_disappeared/\">[comments]</a></span>",
  "timestamp": 1752215491000,
  "source": "4d28d3b10b32",
  "category": ""
}