{
  "guid": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1n47awj/our_missing_desk_drawer_turned_up_12_years_later/",
  "title": "<h1><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1n47awj/our_missing_desk_drawer_turned_up_12_years_later/\" target=\"_blank\">Our missing desk drawer turned up 12 years later on the street.</a></h1>",
  "link": "https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1n47awj/our_missing_desk_drawer_turned_up_12_years_later/",
  "pubDate": "2025-08-30T17:24:22.000Z",
  "description": "<div><p>This is the freakiest thing that has ever happened to me. About 16 or 17 years ago we bought a desk that had a big drawer. This was my wife´s pride and joy and when it was about 1 year old our place got broken into and the robber jumped through the window onto the table. This is important as the table and also the front of the drawer got scratched.</p> <p>We moved house and city and the drawer stayed in storage for about 3 or 4 years. When we got it out of storage the drawer was missing. This was about 12 years ago. I have been hearing literally for the last 12 years about how I must have lost the drawer, and it is my fault and how much of a shame it is that the drawer is missing etc..</p> <p>Come to last weekend and we went back to the city we used to live in for a few days holiday. We were walking down a street a few blocks from where we used to live and the topic of \"what ever happened to the desk drawer came up\".. I was like not again, just drop it finally.... Then literally a minute later leaning against the wall of an apartment block ( This is Germany, and people, if they want to get rid of old furniture tend to leave it on the street leaning against the wall for people to take ), was a black desk drawer.. We both looked at each other and were like WTF.... When we got closer we were like OMG it even has the scratch marks on it, this cannot be.. We were dumbfounded. We took it with us and to our absolute amazement it fit right into our desk.</p> <p>OUR FREAKING DESK DRAWER TURNED UP ON THE STREET A FEW BLOCKS FROM WHERE WE USED TO LIVE APPROX 12 YEARS LATER.</p> <p>The chance that someone had it that long, then decided to throw it out the exact evening that we walked past 12 years later is just mind blowing. We have no idea how where when and why it went missing. But after all these years we were reunited at last.</p> <p>Can someone calculate the odds of this happening?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Intelligent_Reply628\"> /u/Intelligent_Reply628 </a> <br /> <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1n47awj/our_missing_desk_drawer_turned_up_12_years_later/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/Glitch_in_the_Matrix/comments/1n47awj/our_missing_desk_drawer_turned_up_12_years_later/\">[comments]</a></span>",
  "timestamp": 1756574662000,
  "source": "4d28d3b10b32",
  "category": ""
}