{
  "guid": "https://old.reddit.com/r/ExpatFIRE/comments/1qgfajt/one_year_retired_in_france/",
  "title": "<h1><a href=\"https://old.reddit.com/r/ExpatFIRE/comments/1qgfajt/one_year_retired_in_france/\" target=\"_blank\">One year retired in France</a></h1>",
  "link": "https://old.reddit.com/r/ExpatFIRE/comments/1qgfajt/one_year_retired_in_france/",
  "pubDate": "2026-01-18T17:54:17.000Z",
  "description": "<div><p>January 20th, Inauguration Day, marks our one year anniversary in France. We moved here on the VLS-TS Visitor visa as Americans and have applied, but not yet received, our residency card renewal.</p> <p>Overall the experience has been a bit of a rollercoaster. The first few months had many more downs than ups, but things have steadily improved for us as we've gotten over the initial culture shock, moved to a better city, and really started to settle in and make friends.</p> <p>When we first arrived, we moved to the Nice area. We had previously spend two months there and it looked like it had everything we wanted: beautiful mountains and sea, mild climate, outdoor activities, and plenty to do. But after living there for a few months the reality set in: the French Riviera is largely built for rich, aging pensioners to spend their days cooking under the Mediterranean sun. There are very few young people to befriend, and even fewer taking advantage of all the beautiful outdoors. The public transport in Southern France is underdeveloped and makes it very difficult to live without a car. Summer temperatures are brutal and only getting worse, but there are very few indoor activities. Traveling during July and August in Europe is crazy expensive and crowded, making it difficult to spend the season elsewhere.</p> <p>Then in September, we moved to Annecy. What a breath of fresh air. The city is lively and filled with young people enjoying the mountains. The public transport is developed and efficient, but we rarely use it because of how walkable, bikeable, and liveable the city is. Plus, tartiflette.</p> <p>Costs have been higher than we expected here, largely due to the falling exchange rate. We spent $60k in 2025, without owning a car. Our biggest expense was rent, €950/month in the south and €1500/month in Annecy. Food has also been surprisingly costly, although that's probably true everywhere; €800 or more most months, not including restaurants. Healthcare continues to be pleasantly affordable, we spend €100/month for top-up insurance for two and have very little expenses above that.</p> <p>I'll do a full write-up on the tax situation after we file around May or June. I was careful to stay just below the standard deduction and 0% cap gain in the US, and the €46k PUMA threshold for France. This year France will likely add additional fees (if they can pass a budget without the government collapsing), and I expect the PUMA threshold to be eliminated, and the 6.5% social charge levied on all capital income. Interestingly, this will likely only apply to us until we're permanent residents in four years.</p> <p>Feel free to ask any questions and I'll do my best to answer them.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/France_FI\"> /u/France_FI </a> <br /> <span><a href=\"https://old.reddit.com/r/ExpatFIRE/comments/1qgfajt/one_year_retired_in_france/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/ExpatFIRE/comments/1qgfajt/one_year_retired_in_france/\">[comments]</a></span>",
  "timestamp": 1768758857000,
  "source": "9e57797bc227",
  "category": ""
}