{
  "guid": "https://old.reddit.com/r/DimensionJumping/comments/1l3j9bf/i_found_myself_somewhere_i_have_no_recollection/",
  "title": "<h1><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1l3j9bf/i_found_myself_somewhere_i_have_no_recollection/\" target=\"_blank\">I found myself somewhere I have no recollection of going in</a></h1>",
  "link": "https://old.reddit.com/r/DimensionJumping/comments/1l3j9bf/i_found_myself_somewhere_i_have_no_recollection/",
  "pubDate": "2025-06-04T22:36:22.000Z",
  "description": "<div><p>I don't know where else to post this.</p> <p>Something super weird happened to me today and I still can’t wrap my head around it. I haven't told anyone.</p> <p>A few years ago there was this pizza place on the outskirts of my town that closed down, it was always kind of a sketchy spot and I never went there as a kid, but I heard it used to have those kids play areas with ball pits and inflatables. The place eventually closed down and the building was abandoned. I’d driven by it a bunch of times and even joked with my roommate about checking it out, but I never actually made any concrete plans of going in there.</p> <p>Last night, I went to bed around midnight after watching a movie, and that’s the last thing I remember.</p> <p>Next I just wake up and for the life of me I had zero clue where I was. I was just standing there with my phone in hand and the flashlight turned on, the place was completely empty. I stumbled around until I finally found an exit, and when I stepped outside I recognized the building as that pizza place. My car was parked right in front, and the keys were in the ignition. I have no memory of actually going in there or how I got there. My memories just skip from last night directly to right then (it was around 4pm).</p> <p>When I got home, I asked my roommate a few questions (but I didn’t say anything about what happened). He told me that this morning I said I was going to my aunt’s for lunch but didn’t say much else. I called my aunt to check, she wasn’t expecting me, and I definitely didn’t go there. This is unlike me. I seem to be fine, no bruises or cuts anywhere and nothing was missing from inside the car or on me.</p> <p>At this point, I’m freaking out a little because I have no idea what happened between when I fell asleep and when I woke up. Has anyone ever had something like this happen?</p> <p>UPDATE: <a href=\"https://www.reddit.com/r/DimensionJumping/s/NGr9bm4PL3\">https://www.reddit.com/r/DimensionJumping/s/NGr9bm4PL3</a></p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Wise_Magician4323\"> /u/Wise_Magician4323 </a> <br /> <span><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1l3j9bf/i_found_myself_somewhere_i_have_no_recollection/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1l3j9bf/i_found_myself_somewhere_i_have_no_recollection/\">[comments]</a></span>",
  "timestamp": 1749076582000,
  "source": "712c2a7cd689",
  "category": ""
}