{
  "guid": "https://old.reddit.com/r/DimensionJumping/comments/1ik1t0t/how_to_purposely_timeline_jump_to_where_a_loved/",
  "title": "<h1><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1ik1t0t/how_to_purposely_timeline_jump_to_where_a_loved/\" target=\"_blank\">HOW to purposely timeline jump to where a loved one is still alive?</a></h1>",
  "link": "https://old.reddit.com/r/DimensionJumping/comments/1ik1t0t/how_to_purposely_timeline_jump_to_where_a_loved/",
  "pubDate": "2025-02-07T18:22:48.000Z",
  "description": "<div><p>TW: Suicide</p> <p>My soulmate of 8 years purposely drank himself to death 2 years ago. I have always been a more sensitive person, extremely empathic and I’ve had many paranormal/spiritual experiences over the course of 35 years. I have SEEN some things, let me tell you…</p> <p>I have studied quantum physics, metaphysics, simulation theory, solipsism, Gnosticism, law of assumption, and several other ideologies and philosophies so I am no stranger to the concept of quantum immortality. I had a spiritual awakening experience one year ago, approximately one year after my beloved left, and so much was revealed to me. However, I can’t seem to let go of my beloved.</p> <p>We planned an entire future together and then things for really dark for him and I couldn’t save him from himself. The thing is, there’s this strange but overwhelmingly powerful sensation that I can be with him again. During the spiritual awakening, I was shown that death is an illusion and that it was only his physical body that died and that he still lives and there is a version of him that was never afflicted and addicted. I was told I would be with that version of him in this lifetime…I was not shown how or why this would happen though, hence my question here. </p> <p>I have this weird impulse to check inside every vehicle that was the same make and model of his to make sure he’s not the driver. I never saw him dead as he was found by a neighbor and I think that also lends to this feeling I have. Furthermore, I have dreamed about him at least 2x vividly every month for 2 years like clockwork. In each dream, he is alive, but he’s either still an addict or he has a completely different girlfriend and doesn’t know who I am or sometimes he does know who I am but I strongly feel as though each of those dreams is me viewing him in other timelines…these “dreams” feel different than my other dreams. Also, after this spiritual awakening experience, I suddenly developed mediumistic abilities and was capable of connecting and communicating with him. This only lasted for several months as he described he was still in this timeline trying to tie up loose ends with family because of his suicide. At one point, he “crossed over” fully and that was the last time I was able to talk to him.</p> <p>I know this sounds like some poor sap who is consumed in grief but I’m not…. I’m more curious than I am sad. I miss him dearly, of course, but I want to know how to go about jumping a timeline to where someone is still alive….I have heard many saying that deaths, intentional or accidental seem to be successful but I don’t want to KMS in this timeline and cause pain to friends and family….</p> </div> <br /> <span><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1ik1t0t/how_to_purposely_timeline_jump_to_where_a_loved/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/DimensionJumping/comments/1ik1t0t/how_to_purposely_timeline_jump_to_where_a_loved/\">[comments]</a></span>",
  "timestamp": 1738952568000,
  "source": "712c2a7cd689",
  "category": ""
}