{
  "guid": "https://old.reddit.com/r/AstralProjection/comments/1qfe0pn/astral_sex/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfe0pn/astral_sex/\" target=\"_blank\">Astral Sex</a></h1>",
  "link": "https://old.reddit.com/r/AstralProjection/comments/1qfe0pn/astral_sex/",
  "pubDate": "2026-01-17T14:04:11.000Z",
  "description": "<div><p>Hello, I was trying to astral project this morning. I fell asleep ans when I work up I told myself that was the perfect time to try and project. I usually do a whole meditation beforehand but not this time. When I felt the vibrations I tried sitting up but I kind of just floated up. I set my intention to see a friend of mine and felt like I was being thrust through time and space, surrounded by all this light. However looking back I don't think I left my bedroom because I saw the same curtains and suddenly I found my hand was stroking something hard and hairy. My mind was blank for a few seconds then I saw this tall dark shape with what seemed like curly hair. I took my hand back and politely said I didn't want to do that and had somewhere to be. I set my intention to see my friend again but didn't go anywhere and he/it picked my hand. It felt like a large niddle in my hand. I look in it's direction and was like \"really, why would you do that?\" I got no response so I just went back into my body ans left what I assume was the astral world. I wasn't scared but disappointed and I don't know how I ended up in this situation. It never spoke to me or asked consent. How can I protect myself moving forward? </p> <p>Thank you for your insight and suggestions. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/ceruleanlife\"> /u/ceruleanlife </a> <br /> <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfe0pn/astral_sex/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfe0pn/astral_sex/\">[comments]</a></span>",
  "timestamp": 1768658651000,
  "source": "6a39b26f6ef1",
  "category": ""
}