{
  "guid": "https://old.reddit.com/r/AstralProjection/comments/1qet4fj/theres_something_wrong_with_bbc_news_headquarters/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qet4fj/theres_something_wrong_with_bbc_news_headquarters/\" target=\"_blank\">There's something wrong with BBC news headquarters</a></h1>",
  "link": "https://old.reddit.com/r/AstralProjection/comments/1qet4fj/theres_something_wrong_with_bbc_news_headquarters/",
  "pubDate": "2026-01-16T21:41:33.000Z",
  "description": "<div><p>‎Friday night 16 January 2026 4 am something, I was doing astral travelling and a thought occurred to me out of curiosity that I should visit BBC news headquarters and see what it is like in there as I teleported there I found myself in a circle and there were stairs in the middle of the circle going down in the ground it had fancy black mirror (also a golden man statue holding something) but as I tried to walk down the stairs I felt a heavy pressure all around my soul very intense and sudden intense fear like a warning to go away. I got knocked back into my body harshly and my body was paralyzed I couldn't move it for few minutes after a while I was able to move it. This experience have left me disturbed. Why does BBC news have such high spiritual protection? also if any of you do astral projection can you try to go and check it yourself because why was it so hard to cross the boundaries there and the presence left me with many questions. Now I even have to be careful about some spiritual boundaries what is this? Physical borders are already enough why does there gotta be spiritual borders too? ‎I just wanted to take a look 😭🙏. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/bigfriedwater\"> /u/bigfriedwater </a> <br /> <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qet4fj/theres_something_wrong_with_bbc_news_headquarters/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qet4fj/theres_something_wrong_with_bbc_news_headquarters/\">[comments]</a></span>",
  "timestamp": 1768599693000,
  "source": "6a39b26f6ef1",
  "category": ""
}