{
  "guid": "https://old.reddit.com/r/AstralProjection/comments/1qfxjl8/a_creature_followed_me_to_the_physical_world/",
  "title": "<h1><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfxjl8/a_creature_followed_me_to_the_physical_world/\" target=\"_blank\">A creature followed me to the physical world</a></h1>",
  "link": "https://old.reddit.com/r/AstralProjection/comments/1qfxjl8/a_creature_followed_me_to_the_physical_world/",
  "pubDate": "2026-01-18T03:25:09.000Z",
  "description": "<div><p>This is my first time seeing an entity followed me when I came back to my physical body. </p> <p>I have posted this astral projection experience before but a lot of details were left out and I believe details are very important to mention, even small ones. I want you, the readers, to know what exactly happens to these projections, and share what I’ve seen, feel, hear, and so far I haven’t touched anything yet. </p> <p>Usually when the projections happen, I am already in a realm. This one in particular, I was lying down on my left side. I projected from behind seeing my astral body move away, and seeing my physical body lying down on my bed. It was amazing. A textbook “leaving my body.” </p> <p>Once in the realm, I was above the ground floating. I could see the land, yellowish color, like a desert, and dark blue body of water to the bottom. The water wasn’t flowing. It looked like a dark blue icing on a cake. In the land, I saw a building right by the water. I landed. I was curious about the building in the middle of nowhere. I noticed an entity guarding the building. I couldn’t see how it looked like, but it wasn’t human. Also, it was under a shade and some fence-like structure shielding it. My thoughts were, it was guarding the entrance, and that building must have an underground water, tunnel, underworld since it was by the water.</p> <p>We were staring at each other. I didn’t know what else to do, so I left that realm, came back to my physical body back to bed. When I opened my eyes, I saw a creature on my bed, right by my legs. I even lifted my head up from the pillow. We were staring at each other, just like I was staring at the entity from the realm I just came from. It might’ve been that entity guarding the building. It looked like seal without the hairy mustache. Dark brown. I didn’t see any limbs. No head structure. Just like a seal or even a sea lion. </p> <p>To be quite honest, I wasn’t scared of it at all. I actually don’t get scared of seeing entities when I am in my frequencies, my Higher Self. Perhaps they can control my feelings. It seems like it. I don’t get scared of spiky entity, robotic spiders, the 3 entities appearing in my room or other entities. </p> <p>I also wonder when I astral project those other times, there’s possibility that I don’t remember I projected ,and once I come back to our world, these entities follow me. </p> <p>Has anyone came back from realms and entities or beings followed them back to this physical world? </p> <p>Thank you for reading. </p> </div>   submitted by   <a href=\"https://old.reddit.com/user/PlainSimpleNatural\"> /u/PlainSimpleNatural </a> <br /> <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfxjl8/a_creature_followed_me_to_the_physical_world/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/AstralProjection/comments/1qfxjl8/a_creature_followed_me_to_the_physical_world/\">[comments]</a></span>",
  "timestamp": 1768706709000,
  "source": "6a39b26f6ef1",
  "category": ""
}