{
  "guid": "https://old.reddit.com/r/nosurf/comments/1pvgmea/i_deleted_instagram_and_realized_i_dont_know_what/",
  "title": "<h1><a href=\"https://old.reddit.com/r/nosurf/comments/1pvgmea/i_deleted_instagram_and_realized_i_dont_know_what/\" target=\"_blank\">I deleted instagram and realized I don’t know what I actually enjoy</a></h1>",
  "link": "https://old.reddit.com/r/nosurf/comments/1pvgmea/i_deleted_instagram_and_realized_i_dont_know_what/",
  "pubDate": "2025-12-25T16:15:30.000Z",
  "description": "<div><p>I deleted Instagram and something uncomfortable surfaced almost immediately: I don’t really have hobbies.</p> <p>Most of what I thought I enjoyed was tied to being seen. Cooking was about getting a good photo. Reading was about posting what I was reading. Traveling was about content not experience. Without an audience the motivation evaporated.</p> <p>It made me realize how much of my life was performative. I wasn’t doing things because they felt good I was doing them because they translated well on a feed. When the platform disappeared so did the structure that told me what was “worth” doing.</p> <p>Now I’m sitting with a strange question: what do I actually like when no one is watching? What activities still matter when there’s nothing to document or share?</p> <p>I don’t regret deleting instagram but it forced a reckoning I didn’t expect. Rebuilding a sense of enjoyment that isn’t optimized for visibility feels harder than quitting the app itself.</p> <p>Spent the last three evenings just sitting on my couch playing jackpot city because it's the only thing I could think to do that wasn't tied to performing for anyone. At least it's honest boredom.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/dead_synopsis\"> /u/dead_synopsis </a> <br /> <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pvgmea/i_deleted_instagram_and_realized_i_dont_know_what/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pvgmea/i_deleted_instagram_and_realized_i_dont_know_what/\">[comments]</a></span>",
  "timestamp": 1766679330000,
  "source": "46bf34128943",
  "category": ""
}