{
  "guid": "https://old.reddit.com/r/nosurf/comments/1q19bpk/ai_is_making_it_very_easy_to_quit_social_media_in/",
  "title": "<h1><a href=\"https://old.reddit.com/r/nosurf/comments/1q19bpk/ai_is_making_it_very_easy_to_quit_social_media_in/\" target=\"_blank\">AI is making it very easy to quit social media in 2026</a></h1>",
  "link": "https://old.reddit.com/r/nosurf/comments/1q19bpk/ai_is_making_it_very_easy_to_quit_social_media_in/",
  "pubDate": "2026-01-01T17:16:52.000Z",
  "description": "<div><p>Wanted to get your thoughts on the state of social media in 2025/26. I feel like social media is destroying itself with AI.</p> <p>People aren't even creating real content anymore because you can just generate everything now. Half the time I scroll, i' m just watching AI generated videos. Its getting worse every day.</p> <p>And don't get me started on twitter.. have you seen whats happening with Grok? People are using it now to undress women or putting them in bikinis (doesn't matter how old these womans are, you can even edit a picture of a 14 years old teenager and undress her). It’s been going on for days and my feed is full of this trash, even though I don't look for it or want to see it.</p> <p>Social media just feels boring, lazy, and creepy now. I feel like a lot of people are getting sick of the AI flood. I took a big break in 2025 and just came back for a week during the christmas holidays. I’m already done with it. Deactivating everything again and reduce my phone use.</p> <p>Curious to hear your take: Do you think AI and the lack of ethics will finally be the thing that kills social media addiction for the masses, or are we just going to keep scrolling anyway?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Unstxppable27\"> /u/Unstxppable27 </a> <br /> <span><a href=\"https://old.reddit.com/r/nosurf/comments/1q19bpk/ai_is_making_it_very_easy_to_quit_social_media_in/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/nosurf/comments/1q19bpk/ai_is_making_it_very_easy_to_quit_social_media_in/\">[comments]</a></span>",
  "timestamp": 1767287812000,
  "source": "46bf34128943",
  "category": ""
}