{
  "guid": "https://old.reddit.com/r/nosurf/comments/1pt0z2u/do_you_agree_with_my_grandpas_vision_on/",
  "title": "<h1><a href=\"https://old.reddit.com/r/nosurf/comments/1pt0z2u/do_you_agree_with_my_grandpas_vision_on/\" target=\"_blank\">Do you agree with my grandpa’s vision on smartphone addiction? Extremely scary?</a></h1>",
  "link": "https://old.reddit.com/r/nosurf/comments/1pt0z2u/do_you_agree_with_my_grandpas_vision_on/",
  "pubDate": "2025-12-22T14:31:25.000Z",
  "description": "<div><p>My grandpa and me had a super in-depth conversation on the internet and smartphones (he’s old school and refuses to buy a smartphone, he has a basic Nokia and sticks to a desktop rather than a laptop). He reckons cases of dementia are going to explode due to smartphones causing lack of use of the creativity and problem solving side of the brain. He was also a teacher until recently and said he’s observed kids being way less creative in writing stories and attention spans are pretty much gone to zero.</p> <p>He also said something I found interesting. He reckons the reason there hasn’t been a good movie or TV show recently is because peoples brains are so overstimulated by technology that they literally can’t come up with the scripts and stories they used to before smartphones existed. He used Pixar as an example because a lot of their recent movies have either flopped or been disappointments.</p> <p>He’s even gone as far as to say countries should ban smartphones for under 18s so at least their brains have time to develop naturally. He said he has great fears for humanity if this issue isn’t curbed.</p> <p>What do you guys think? Is he onto something or is this just boomer talk?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Cookie_Cutter32\"> /u/Cookie_Cutter32 </a> <br /> <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pt0z2u/do_you_agree_with_my_grandpas_vision_on/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pt0z2u/do_you_agree_with_my_grandpas_vision_on/\">[comments]</a></span>",
  "timestamp": 1766413885000,
  "source": "46bf34128943",
  "category": ""
}