{
  "guid": "https://old.reddit.com/r/nosurf/comments/1pt2fz5/i_stopped_checking_my_phone_first_thing_in_the/",
  "title": "<h1><a href=\"https://old.reddit.com/r/nosurf/comments/1pt2fz5/i_stopped_checking_my_phone_first_thing_in_the/\" target=\"_blank\">I stopped checking my phone first thing in the morning and it changed the tone of my entire day</a></h1>",
  "link": "https://old.reddit.com/r/nosurf/comments/1pt2fz5/i_stopped_checking_my_phone_first_thing_in_the/",
  "pubDate": "2025-12-22T15:31:31.000Z",
  "description": "<div><p>I went one full week without checking my phone as soon as I woke up. No notifications, no scrolling, no emails, no news. Just waking up and sitting there for a minute.</p> <p>What surprised me most was the silence. Actual quiet. My own thoughts showed up before anyone else’s opinions, problems or urgency did. I realized how rare that’s become to be conscious before being connected.</p> <p>Normally the first thing I do is plug directly into other people’s needs. Messages to respond to. Headlines designed to stress me out. Social feeds telling me how I should feel before I’ve even figured out how I do feel. By the time I’m out of bed my mental state has already been set by whatever I saw first.</p> <p>Without the phone mornings felt slower but clearer. I wasn’t immediately reactive. My mood didn’t start in response mode. It felt like my brain belonged to me for a few minutes before the world rushed in.</p> <p>I didn’t realize how much that one habit was hijacking my day before it even started. Now it’s hard to unsee how invasive that first scroll really is.</p> <p>This morning I slipped and grabbed my phone automatically. Ended up lying there for thirty minutes playing jackpot city and checking messages before I even got out of bed and immediately felt the difference. That quiet headspace was just gone.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Antique-Sky-4876\"> /u/Antique-Sky-4876 </a> <br /> <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pt2fz5/i_stopped_checking_my_phone_first_thing_in_the/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/nosurf/comments/1pt2fz5/i_stopped_checking_my_phone_first_thing_in_the/\">[comments]</a></span>",
  "timestamp": 1766417491000,
  "source": "46bf34128943",
  "category": ""
}