{
  "guid": "https://old.reddit.com/r/bodyweightfitness/comments/1qfxx1i/finally_achieved_my_first_pullup_after_5_years/",
  "title": "<h1><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qfxx1i/finally_achieved_my_first_pullup_after_5_years/\" target=\"_blank\">Finally achieved my first pull-up. After 5 years.</a></h1>",
  "link": "https://old.reddit.com/r/bodyweightfitness/comments/1qfxx1i/finally_achieved_my_first_pullup_after_5_years/",
  "pubDate": "2026-01-18T03:43:27.000Z",
  "description": "<div><p>Man I'm so happy. 5 years ago during COVID I aimed to do my first ever pull-up. I had a video of me struggling like a fish. Throughout the years, I have attempted several times to get that first pull-up. I've been to multiple gyms, performed TRX, etc. I set a goal during a company \"set a personal goal\" activity to do 1 pull up back in 2023. Embarrassingly a dud.</p> <p>I'm 173m, 83 kg. Back when I first aimed for it, I was 73 kg. i thought I was too fat, and can only do it after a weight loss.</p> <p>Last Nov, I decided to retry doing the Recommended Routine. To show my commitment I invested in a Pull Up station. Started from the most basic: deadhangs, then scapulae pulls, then negatives. Currently I'm at 5 rep negatives.</p> <p>Yesterday while preparing for my negatives, I just whimsically wondered if I'm strong enough for 1 pull up. So I tried. The way my body just went up, and my biceps/back muscles just lifted myself, the way my chin reached the bar. It was amazing. I tried again, yep not a dream.</p> <p>I will continue with my dips probably until I reach 8 to build more strength since I did feel a bit of discomfort after the pull-ups. That said, I'm so stoked to actually include it in my work out routine soon. This was 6 years in the making. The process works, trust the process.</p> <p>Thanks BWF.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/BarongChallenge\"> /u/BarongChallenge </a> <br /> <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qfxx1i/finally_achieved_my_first_pullup_after_5_years/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qfxx1i/finally_achieved_my_first_pullup_after_5_years/\">[comments]</a></span>",
  "timestamp": 1768707807000,
  "source": "a6b653b57a7a",
  "category": ""
}