{
  "guid": "https://old.reddit.com/r/bodyweightfitness/comments/1q5lhs5/coregasm_problem_during_some_exercises/",
  "title": "<h1><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1q5lhs5/coregasm_problem_during_some_exercises/\" target=\"_blank\">\"Coregasm\" problem during some exercises</a></h1>",
  "link": "https://old.reddit.com/r/bodyweightfitness/comments/1q5lhs5/coregasm_problem_during_some_exercises/",
  "pubDate": "2026-01-06T15:23:39.000Z",
  "description": "<div><p>Hi everyone, long time lurker here, I hope this is the correct sub for this post. I've been training bodyweight/calisthenics on and off in the last years, but recently I've been trying to get back into it a bit more seriously, especially as complementary training for another related sport.</p> <p>I need/want to train my core for a variety of movements/exercises/skills, BUT I have a big problem with it. Some core exercises (mostly compression abs/legs static holds, L-sit and variations seems to be the worst for me) inevitably give me a \"strange\" feeling after a set amount of time that prompts me to stop even though I feel I still have some \"energy\" left. I've tried to push through the feeling (while alone and at home) and yeah, that happened, it was weird.</p> <p>I've tried to research about it a bit in the past, but haven't found much, especially from other men (seems a bit more common in women? or maybe it's just something men wouldn't openly talk about?) and I definitely haven't found a \"solution\" for it, mostly banter lol. That's why in the past I simply began avoiding those exercises.</p> <p>Has anyone here ever experienced something similar? Does it get better (less frequent) with training? Or am I better off trying to avoid those exercises when possible? It would be a shame, because I would really like to train/achieve some related skills (and I definitely wouldn't want something like THAT to happen in public.)</p> <p>Thanks for stopping by and happy new year!</p> <p>EDIT: I'm a 26yo man, haven't explicitly specified in the post</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/NightFeeling\"> /u/NightFeeling </a> <br /> <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1q5lhs5/coregasm_problem_during_some_exercises/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1q5lhs5/coregasm_problem_during_some_exercises/\">[comments]</a></span>",
  "timestamp": 1767713019000,
  "source": "a6b653b57a7a",
  "category": ""
}