{
  "guid": "https://old.reddit.com/r/bodyweightfitness/comments/1qbh4c4/wall_pushups_humbled_me_and_then_rebuilt_me/",
  "title": "<h1><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qbh4c4/wall_pushups_humbled_me_and_then_rebuilt_me/\" target=\"_blank\">Wall pushups humbled me and then rebuilt me</a></h1>",
  "link": "https://old.reddit.com/r/bodyweightfitness/comments/1qbh4c4/wall_pushups_humbled_me_and_then_rebuilt_me/",
  "pubDate": "2026-01-13T03:55:18.000Z",
  "description": "<div><p>most of the time i thought wall pushups were a joke. then i actually tried to do them properly and realized I'd been cheating every single pushup I'd ever done in my life.</p> <p>Started against the wall because regular pushups were damaging my wrists, and I kept flaring my elbows. figured i'd go back to absolute basics and fix whatever was broken in my movement pattern.</p> <p>first session i focused on keeping my elbows at forty five degrees, really controlling the descent, pausing at the wall, then pushing back without letting my hips sag or my shoulders creep up toward my ears. did three sets of fifteen. felt it in my chest the next day for the first time.</p> <p>Spent about three weeks there. then moved to countertop height. then a sturdy chair. each level i stayed until the movement felt automatic, until i wasn't thinking about form anymore because it was just baked in.</p> <p>When i finally got back to floor pushups, they felt completely different. Solid. No wrist pain. Because of meet august suggestion i actually feeling my chest work instead of my shoulders taking over everything. </p> <p>The progression took almost two months total. Could've rushed it and been doing sloppy floor pushups within a week. But those two months of going embarrassingly slow fixed something that had been wrong for a long time. Sometimes the beginner version is exactly where you need to be.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/Economy-Mud-6626\"> /u/Economy-Mud-6626 </a> <br /> <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qbh4c4/wall_pushups_humbled_me_and_then_rebuilt_me/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/bodyweightfitness/comments/1qbh4c4/wall_pushups_humbled_me_and_then_rebuilt_me/\">[comments]</a></span>",
  "timestamp": 1768276518000,
  "source": "a6b653b57a7a",
  "category": ""
}