{
  "guid": "https://old.reddit.com/r/dpdr/comments/1qi3op3/hyperaware_of_my_mental_processes_and_becominf/",
  "title": "<h1><a href=\"https://old.reddit.com/r/dpdr/comments/1qi3op3/hyperaware_of_my_mental_processes_and_becominf/\" target=\"_blank\">Hyperaware of my mental processes and becominf hyperaware of rhe hyperawareness itself.</a></h1>",
  "link": "https://old.reddit.com/r/dpdr/comments/1qi3op3/hyperaware_of_my_mental_processes_and_becominf/",
  "pubDate": "2026-01-20T15:13:33.000Z",
  "description": "<div><p>Hello dear reader,</p> <p>What the helly is happening. My life has changed for the past weeks. Upside down and I basically feel like I am never going back to normal so pleaaaaaaaase I am searching for hope cause I am messed up. I am lookinf for confirmation that it can and will pass. So please if you are past this, post here so others can thrive and have hope too. Please do not share if you are still struggling or have been struggling for years, because of my severy anxiety I will lose more hope and get caught up worse I am at my wits ends. This thread needs to be a lifesaver for all of us that experienxe something alike. Lets keep it that way.</p> <p>My story: I started rhinking a bit too deep about how toughts occur and all of a sudden I became aware of my own toughts. Terryfing feeling. I could not mindwander without realising I was doing that.</p> <p>From that point I got completely messed up. I got sleep anxiety because I became hyperaware of my sleep, taking a benzo now to help me relax but my sleep is broken.</p> <p>After this the hyperawarness got me harder. I am hyperaware of all mental processes to an extend I cant function. Like everytbing. How my mind makes mental images, remembers, forgets, but also when I am talking or thinking my mind wonders how does my mind do this? Like where does this come from? And I get uncomf. Why do I find this funny? Whenever I need to use my brain this especially pops up, like when I need to work or think about what someone says. When I realise my inner voice that also makes me unfomfy. Like wth.</p> <p>Whenever I am alone It hits me harder because I realise its me and my toughts and it makes me uncomfortable as fuck.</p> <p>So its the hyperawareness of my mind by observing itseld + my mind overanalysing itself by asking how it functions.</p> <p>Crazy.</p> <p>I lost 20 pounds of fhe anxiety this gives me but It makes no fuckinf sense.</p> <p>I should not be terrified this is just how we function. Yet I cant overcome it and I dont think there a meds for it since it is a mental state?</p> <p>Love all of you who are reading this and hope for peace of mind for everyone of you that is suffering. ❤️❤️❤️❤️❤️❤️</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/SenioraFuture3116\"> /u/SenioraFuture3116 </a> <br /> <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qi3op3/hyperaware_of_my_mental_processes_and_becominf/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qi3op3/hyperaware_of_my_mental_processes_and_becominf/\">[comments]</a></span>",
  "timestamp": 1768922013000,
  "source": "957c4c966af2",
  "category": ""
}