{
  "guid": "https://old.reddit.com/r/dpdr/comments/1qdu8n2/i_used_to_feel_like_my_potential_was_being_stolen/",
  "title": "<h1><a href=\"https://old.reddit.com/r/dpdr/comments/1qdu8n2/i_used_to_feel_like_my_potential_was_being_stolen/\" target=\"_blank\">I used to feel like my potential was being stolen by Derealization—so I made a feature film to reclaim it.</a></h1>",
  "link": "https://old.reddit.com/r/dpdr/comments/1qdu8n2/i_used_to_feel_like_my_potential_was_being_stolen/",
  "pubDate": "2026-01-15T20:06:40.000Z",
  "description": "<div><p>UPDATE</p> <p>Thank you Mods!!</p> <p>Hey everyone. My name is Janaé Rachel Ballot. I was diagnosed with dissociation and depersonalization, but the one thing I hate the most is the derealization. It used to make me feel as though I was stuck. Like my potential was being stolen from me with every inching second of \"can I just focus...\", \"can I just feel like I am in this world for a moment...\"</p> <p>I think I have chased the feeling of being present for a very long time because when I was \"online\", I was not at the mercy of myself. The one thing that truly helped me overcome my struggles was making my first feature film called \"Dissociated Me\" which is based on my life.</p> <p>It was 3 years ago I had \"peak\" derealization. I was in the thick of a traumatic event. I knew I had to use my potential in what I've always known - entertainment. It was a burning desire! One day my friend, who has edited some of the biggest action movies in the world, told me I should make a movie based on my life.</p> <p>She saw that the only way to get through the 'fog' was to walk right into it. So, I did. She stepped in to produce and even act in the film. Alongside our DP, Matthew Monelli, we started filming.</p> <p>But I couldn't write. Coming from a background in writing true stories for screen, I couldn't even write my own. I'm the source! I had dissociative episodes. Eventually I threw out the idea of finishing a script, started filming, hired actors and crew.</p> <p>Mid-shoot I was hit by a car at 35 mph. Instead of stopping, my collaborator filmed me in the trauma unit.</p> <p>Making <em>Dissociated Me</em> didn't just give me a film; It forced me to be present because the camera was rolling. I was reliving the most traumatic experiences while filming. But I knew to make something that can resonate with others... to help others... that was grounding me.</p> <p>I know how it feels to think your life is being stolen by this condition. I wanted to share this because for me, the 'burning desire' to create was the only thing louder than the dissociation.</p> <p>I understand anyone reading this might feel vulnerable or enduring their own struggles but again... I truly would like to know what you think dissociation, derealization and depersonalization has done to you.</p> <p>Does it hold you back?</p> <p>Do you escape it? How do you navigate through it? Can't right now? I'd like to hear that as well.</p> <p>I'd also love to know what type of representation you would like to see in media when it comes down to this condition.</p> <p>Thank you for reading.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/janaerachelballot\"> /u/janaerachelballot </a> <br /> <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qdu8n2/i_used_to_feel_like_my_potential_was_being_stolen/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qdu8n2/i_used_to_feel_like_my_potential_was_being_stolen/\">[comments]</a></span>",
  "timestamp": 1768507600000,
  "source": "957c4c966af2",
  "category": ""
}