{
  "guid": "https://old.reddit.com/r/dpdr/comments/1qe8eke/27_years_with_dpdr_i_think_i_finally_figured_out/",
  "title": "<h1><a href=\"https://old.reddit.com/r/dpdr/comments/1qe8eke/27_years_with_dpdr_i_think_i_finally_figured_out/\" target=\"_blank\">27 years with DPDR. I think I finally figured out what’s been keeping me stuck.</a></h1>",
  "link": "https://old.reddit.com/r/dpdr/comments/1qe8eke/27_years_with_dpdr_i_think_i_finally_figured_out/",
  "pubDate": "2026-01-16T06:20:51.000Z",
  "description": "<div><p>I’ve had DPDR for 27 years. Started at 14 after smoking weed and having a panic attack I never told anyone about.</p> <p>I’m 41 now.</p> <p>For most of that time, I thought I was broken. Lazy. Weak. I couldn’t figure out why I could never “snap out of it” like everyone told me to.</p> <p>I worked six years in maximum security prison as an officer. Got promoted. Held it together. And the whole time, I was never actually there. Ghost in a meat suit. You know what I mean if you have this.</p> <p>A few weeks ago, I started building a mathematical model of my condition. Not metaphorically, actually modeling it with variables and equations. I wanted to understand exactly HOW a normal kid gets trapped in this state and WHY it doesn’t go away.</p> <p>Here’s the thing that changed everything for me:</p> <p>The weed didn’t trap me. The suppression did.</p> <p>That night at 14, when the panic hit, I made a choice: hide it. Don’t let anyone see. Act normal.</p> <p>That suppression, that choice to push it down instead of let it out, is what locked the state in. And every day since then, every time I’ve held something back instead of expressing it, I’ve deepened the trap.</p> <p>I ran the numbers. Roughly 20 suppression events per day × 365 days × 27 years = about 197,000 times I reinforced the pattern.</p> <p>The reversal? Expression. Saying the shit out loud instead of holding it in.</p> <p>Not complicated. Just: stop obeying the voice that says “don’t let them see.”</p> <p>I wrote up my whole story, the model, how I think I got stuck, what I’m doing now, if anyone wants to read it's at the bottom in a substack. </p> <p>But honestly I just wanted to share here because I know some of you have been stuck as long as I have, and I know how hopeless it can feel.</p> <p>You’re not broken. You’re stuck in a pattern. Patterns can be reversed.</p> <p>Happy to answer questions if anyone has them.</p> <p><a href=\"https://substack.com/home/post/p-184737110\">https://substack.com/home/post/p-184737110</a></p> </div>   submitted by   <a href=\"https://old.reddit.com/user/akr225a24\"> /u/akr225a24 </a> <br /> <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qe8eke/27_years_with_dpdr_i_think_i_finally_figured_out/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/dpdr/comments/1qe8eke/27_years_with_dpdr_i_think_i_finally_figured_out/\">[comments]</a></span>",
  "timestamp": 1768544451000,
  "source": "957c4c966af2",
  "category": ""
}