{
  "guid": "https://old.reddit.com/r/ADHD/comments/1qgwpum/my_meds_went_from_50month_to_90month_in_2025_now/",
  "title": "<h1><a href=\"https://old.reddit.com/r/ADHD/comments/1qgwpum/my_meds_went_from_50month_to_90month_in_2025_now/\" target=\"_blank\">My meds went from $50/month to $90/month in 2025… now they’re $372/month</a></h1>",
  "link": "https://old.reddit.com/r/ADHD/comments/1qgwpum/my_meds_went_from_50month_to_90month_in_2025_now/",
  "pubDate": "2026-01-19T06:31:08.000Z",
  "description": "<div><p>I pay $800/month in health insurance. The insurance plan that I have says that the absolute maximum for “specialty retail drugs” (the highest tier of medication, for which the generic Vyvanse I take for some reason qualifies) is $250, but evidently that doesn’t matter (???). I know it’s the beginning of the year, but to pull up to my pharmacy to hear that my meds cost roughly a week’s worth of work at my full-time job that I have a Masters degree for, especially given that my rent and health insurance eat the vast remainder of my paycheck…. I cried in front of the pharmacists. I’m not an easy crier, especially not in public, but this just broke me. The pharmacy staff were so kind and apologetic, and obviously I don’t blame them at all because they have no say in any of this. But I just don’t know how to accommodate this reality. I have to work a full week of my (admittedly, infuriatingly, egregiously underpaid) highly specialized job with stringent training criteria just to be able to afford the very medication that helps me be capable of not getting fired.</p> <p>I imagine this is a fairly US-centric complaint/dilemma, but I could really use others’ input. Whether it’s advice, tips, commiseration, validation, or anything else. I don’t know how to keep functioning when it costs me more to function than I can gain.</p> <p>Edit: For those who are suggesting GoodRx, that’s generally an excellent resource, but evidently none of the pharmacies remotely in my area accept their coupons. I’ve done exhaustive research on this and have even been sent discount coupons directly from my medical providers that have “reduced” my ADHD med costs from $1,200+ to $600+ at best. I don’t want my own limitations to prevent the sharing of that resource for others, but I thought I would mention it.</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/hannalysis\"> /u/hannalysis </a> <br /> <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qgwpum/my_meds_went_from_50month_to_90month_in_2025_now/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qgwpum/my_meds_went_from_50month_to_90month_in_2025_now/\">[comments]</a></span>",
  "timestamp": 1768804268000,
  "source": "b40ead970baf",
  "category": ""
}