{
  "guid": "https://old.reddit.com/r/ADHD/comments/1qdn2xw/sensitivity_to_injustice_is_gonna_be_my_downfall/",
  "title": "<h1><a href=\"https://old.reddit.com/r/ADHD/comments/1qdn2xw/sensitivity_to_injustice_is_gonna_be_my_downfall/\" target=\"_blank\">Sensitivity to Injustice is gonna be my downfall</a></h1>",
  "link": "https://old.reddit.com/r/ADHD/comments/1qdn2xw/sensitivity_to_injustice_is_gonna_be_my_downfall/",
  "pubDate": "2026-01-15T15:49:08.000Z",
  "description": "<div><p>My ADHD comes with a strong need for everything to be fair, to be heard when mistreated by others, and to do the same thing for other people when it happens to them.<br /> This has caused me endless amount of problems socially, since most normal people have a sort of \"laissez faire\" atitude when it comes to these grievances.</p> <p>The average normal person value peace and conformity more than enforcing whats fair.<br /> \"you are causing a scene\" they said, whilst allowing the bullies to do their thing, for as long as it is being done so quietly, it is a okay...</p> <p>I see this everywhere. I saw it when I was a kid in school, and im seeing it now that im an adult at work. Nobody is standing up for others, unless it is causing them some kind of discomfort, but by then who are THEY gonna complain to? everyone up the chain thinks the same, it is \"causing a scene\" to complain.<br /> Only with an alliance is it somehow okay to complain, and even then you arent allowed to say it out loud, you have to do this awkward dance pretending you are somehow murdering Julius caesar. \"Hey George, Anna, need help? I really wish we had a solution to... \"nods in Petes general direction\"<br /> \"I do not understand\" George says.<br /> shit! now I have to pretend like I meant something else than Pete....</p> <p>ADHD is like being a hammer, we see a hole and we immediately want to nail it shut, but being normal is like pretending the hole doesnt even exist until enough people has broken a leg. And god forbid you have rejection sensitivity, because OH BOY the issue is gonna explode once they tell you to ignore the problems.</p> <p>So where does this leave us? society arent gonna change its way of doing things, and we cannot change the cards life gave us. Nah we are just gonna fecken drown our personalities in pills so that we no longer care about the unfair social construct of this world.</p> <p>\"TheWholesomeOtter seems so much easier to talk to today\" \"yeah, he just focus on work instead of drama, Sucking that D like a champ\"</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/TheWholesomeOtter\"> /u/TheWholesomeOtter </a> <br /> <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qdn2xw/sensitivity_to_injustice_is_gonna_be_my_downfall/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qdn2xw/sensitivity_to_injustice_is_gonna_be_my_downfall/\">[comments]</a></span>",
  "timestamp": 1768492148000,
  "source": "b40ead970baf",
  "category": ""
}