{
  "guid": "https://old.reddit.com/r/ADHD/comments/1qdszly/the_shame_spiral_of_having_unread_texts_i/",
  "title": "<h1><a href=\"https://old.reddit.com/r/ADHD/comments/1qdszly/the_shame_spiral_of_having_unread_texts_i/\" target=\"_blank\">The shame spiral of having unread texts I physically can't respond to</a></h1>",
  "link": "https://old.reddit.com/r/ADHD/comments/1qdszly/the_shame_spiral_of_having_unread_texts_i/",
  "pubDate": "2026-01-15T19:20:47.000Z",
  "description": "<div><p>I have 10 unread texts right now. I've read all of them. I care about every person who sent them. I've composed elaborate replies in my head multiple times. But actually typing and sending? Impossible.</p> <p>It's not that I don't want to respond. It's that every time I open my phone to reply, my brain just... freezes. The longer I wait, the worse it gets. Now I need to explain why I took so long, which makes the response even harder to write, so I don't write it, which makes it worse.</p> <p>People think I'm ignoring them. They think I'm being rude or don't care. But I'm just paralyzed. The task of responding feels insurmountable even though I know logically it takes 30 seconds. I was playing jackpot city on my laptop last night and saw someone had texted me asking if I was okay since I'd been quiet. That made the shame even worse because now I can't just respond normally - I have to address the fact that I didn't respond before, which makes it even harder.</p> <p>The guilt is crushing but somehow not motivating enough to actually make me reply. It's this awful cycle where caring about responding makes responding harder, which makes me feel worse, which makes it even harder.</p> <p>How do you deal with response paralysis like this, especially when the delay itself becomes part of the anxiety? What has actually helped you break the cycle?</p> </div>   submitted by   <a href=\"https://old.reddit.com/user/MuchAssistant7829\"> /u/MuchAssistant7829 </a> <br /> <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qdszly/the_shame_spiral_of_having_unread_texts_i/\">[link]</a></span>   <span><a href=\"https://old.reddit.com/r/ADHD/comments/1qdszly/the_shame_spiral_of_having_unread_texts_i/\">[comments]</a></span>",
  "timestamp": 1768504847000,
  "source": "b40ead970baf",
  "category": ""
}